{
    "2ndLevelRangerSpells": [
        {
            "Name": "Animal Messenger",
            "School": "Enchantment",
            "Description": "You compel a Tiny beast to travel to a destination you choose and deliver a message."
        },
        {
            "Name": "Barkskin",
            "School": "Transmutation",
            "Description": "You touch a willing creature. Until the spell ends, the target's skin has a rough, bark-like appearance."
        },
        {
            "Name": "Darkvision",
            "School": "Transmutation",
            "Description": "You touch a willing creature to grant it the ability to see in darkness."
        },
        {
            "Name": "Find Traps",
            "School": "Divination",
            "Description": "You sense the presence of any trap within range that is within line of sight."
        },
        {
            "Name": "Lesser Restoration",
            "School": "Abjuration",
            "Description": "You touch a creature and can end either one disease or one condition afflicting it."
        },
        {
            "Name": "Locate Animals or Plants",
            "School": "Divination",
            "Description": "You describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind within 5 miles."
        },
        {
            "Name": "Locate Object",
            "School": "Divination",
            "Description": "You sense the direction of an object's location as long as that object is within 1,000 feet of you."
        },
        {
            "Name": "Pass without Trace",
            "School": "Abjuration",
            "Description": "A veil of shadows and silence radiates from you, masking you and your companions from detection."
        },
        {
            "Name": "Protection from Poison",
            "School": "Abjuration",
            "Description": "You touch a creature. If it is poisoned, you neutralize the poison."
        },
        {
            "Name": "Silence",
            "School": "Illusion",
            "Description": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range."
        },
        {
            "Name": "Spike Growth",
            "School": "Transmutation",
            "Description": "The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns."
        }
    ]
}
