{
    "Archetype Name": "Champion",
    "Archetype Features": [
        {
            "Archetype Feature": "Improved Critical",
            "Level": 3,
            "Updated": "No",
            "Archetype Feature Description": [
                "Beginning when you choose this archetype at 3rd level, your weapon attacks score a critical hit on a roll of 19 or 20."
            ]
        },
        {
            "Archetype Feature": "Remarkable Athlete",
            "Level": 7,
            "Archetype Feature Description": [
                "Starting at 7th level, you can add half your proficiency bonus (rounded up) to any Strength, Dexterity, or Constitution check you make that doesn't already use your proficiency bonus.",
                "In addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier.",
                "When you score a critical hit you can move without triggering an opportunity attack.",
                "Advantage on Strength (Athletics) checks.",
                "Advantage on Initiative rolls."
            ]
        },
        {
            "Archetype Feature": "Additional Fighting Style",
            "Archetype Feature Description": [
                "At 7th level, you can choose a second option from the Fighting Style class feature."
            ]
        },
        {
            "Archetype Feature": "Heroic Warrior",
            "Level": 10,
            "Archetype Feature Description": [
                "Starting at 10th level, every time the Champion starts their turn in combat without Heroic Inspiration, they automatically get it."
            ]
        },
        {
            "Archetype Feature": "Superior Critical",
            "Level": 15,
            "Archetype Feature Description": [
                "Starting at 15th level, your weapon attacks score a critical hit on a roll of 18-20."
            ]
        },
        {
            "Archetype Feature": "Survivor",
            "Level": 18,
            "Archetype Feature Description": [
                "At 18th level, you attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don't gain this benefit if you have 0 hit points.",
                "Gives advantage on death saving throws.",
                "If you roll an 18, 19, or 20 on a death saving throw it counts as a critical success."
            ]
        }
    ]
}
