{
    "Archetype Name": "Rune Knight",
    "Archetype Features": [
        {
            "Archetype Feature": "Bonus Proficiencies",
            "Archetype Feature Description": [
                "When you choose this archetype at 3rd level, you gain proficiency with smith’s tools, and you learn to speak, read, and write Giant."
            ]
        },
        {
            "Archetype Feature": "Rune Carver",
            "Archetype Feature Description": [
                "Starting at 3rd level, you can use magic runes to enhance your gear. You learn two runes of your choice, from among the runes described below, and each time you gain a level in this class, you can replace one rune you know with a different one from this feature. When you reach certain levels in this class, you learn additional runes, as shown in the Runes Known table.",
                "Whenever you finish a long rest, you can touch a number of objects equal to the number of runes you know, and you inscribe a different rune onto each of the objects. To be eligible, an object must be a weapon, a suit of armor, a shield, a piece of jewelry, or something else you can wear or hold in a hand. Your rune remains on an object until you finish a long rest, and an object can bear only one of your runes at a time."
            ],
            "Runes Available": [
                {
                    "Cloud Rune": {
                        "Description": "Emulates the deceptive magic used by some cloud giants.",
                        "Benefits": [
                            "Advantage on Dexterity (Sleight of Hand) checks and Charisma (Deception) checks.",
                            "Reaction: Redirect an attack targeting you or a nearby creature to a different creature within 30 feet."
                        ]
                    }
                },
                {
                    "Fire Rune": {
                        "Description": "Channels the masterful craftsmanship of great smiths.",
                        "Benefits": [
                            "Proficiency bonus doubled for ability checks with tools.",
                            "When you hit with a weapon attack, deal extra fire damage and potentially restrain the target."
                        ]
                    }
                },
                {
                    "Frost Rune": {
                        "Description": "Evokes the might of those who survive in the wintry wilderness.",
                        "Benefits": [
                            "Advantage on Wisdom (Animal Handling) checks and Charisma (Intimidation) checks.",
                            "Bonus action: Gain a bonus to Strength and Constitution ability checks and saving throws."
                        ]
                    }
                },
                {
                    "Stone Rune": {
                        "Description": "Channels the judiciousness associated with stone giants.",
                        "Benefits": [
                            "Advantage on Wisdom (Insight) checks and darkvision with a range of 120 feet.",
                            "Reaction: Charm a creature within 30 feet for 1 minute."
                        ]
                    }
                },
                {
                    "Hill Rune (7th Level or Higher)": {
                        "Description": "Bestows a resilience reminiscent of a hill giant.",
                        "Benefits": [
                            "Advantage on saving throws against being poisoned and resistance to poison damage.",
                            "Bonus action: Gain resistance to bludgeoning, piercing, and slashing damage."
                        ]
                    }
                },
                {
                    "Storm Rune (7th Level or Higher)": {
                        "Description": "Allows you to glimpse the future like a storm giant seer.",
                        "Benefits": [
                            "Advantage on Intelligence (Arcana) checks and immunity to surprise.",
                            "Bonus action: Enter a prophetic state to grant advantage or disadvantage on rolls within 60 feet."
                        ]
                    }
                }
            ]
        },
        {
            "Archetype Feature": "Giant Might",
            "Archetype Feature Description": [
                "At 3rd level, you have learned how to imbue yourself with the might of giants. As a bonus action, you magically gain the following benefits, which last for 1 minute:",
                {
                    "Giant Smite": [
                        "If you are smaller than Large, you become Large (if space allows).",
                        "Advantage on Strength checks and saving throws.",
                        "Deal extra damage on one weapon attack per turn."
                    ]
                },
                "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses of it when you finish a long rest."
            ]
        },
        {
            "Archetype Feature": "Runic Shield",
            "Archetype Feature Description": [
                "At 7th level, you learn to invoke your rune magic to protect your allies. When another creature you can see within 60 feet of you is hit by an attack roll, you can use your reaction to force the attacker to reroll the d20 and use the new roll.",
                "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            ]
        },
        {
            "Archetype Feature": "Great Stature",
            "Archetype Feature Description": [
                "By 10th level, the magic of your runes permanently alters you. When you gain this feature, roll 3d4. You grow a number of inches in height equal to the roll.",
                "Moreover, the extra damage you deal with your Giant's Might feature increases to 1d8."
            ]
        },
        {
            "Archetype Feature": "Master of Runes",
            "Archetype Feature Description": [
                "At 15th level, you can invoke each rune you know from your Rune Carver feature twice, rather than once, and you regain all expended uses when you finish a short or long rest."
            ]
        },
        {
            "Archetype Feature": "Runic Juggernaut",
            "Archetype Feature Description": [
                "At 18th level, you learn how to amplify your rune-powered transformation. The extra damage you deal with the Giant's Might feature increases to 1d10. Moreover, when you use that feature, your size can increase to Huge, and while you are that size, your reach increases by 5 feet."
            ]
        }
    ]
}
