{
    "2ndLevelDruidSpells": [
        {
            "Name": "Animal Messenger",
            "School": "Enchantment",
            "Description": "By means of this spell, you use an animal to deliver a message."
        },
        {
            "Name": "Barkskin",
            "School": "Transmutation",
            "Description": "You touch a willing creature. Until the spell ends, the target's skin has a rough, bark-like appearance."
        },
        {
            "Name": "Darkvision",
            "School": "Transmutation",
            "Description": "You touch a willing creature to grant it the ability to see in the dark."
        },
        {
            "Name": "Enhance Ability",
            "School": "Transmutation",
            "Description": "You touch a creature and bestow upon it a magical enhancement."
        },
        {
            "Name": "Find Traps",
            "School": "Divination",
            "Description": "You sense the presence of any trap within range that is within line of sight."
        },
        {
            "Name": "Flame Blade",
            "School": "Evocation",
            "Description": "You evoke a fiery blade in your free hand."
        },
        {
            "Name": "Flaming Sphere",
            "School": "Conjuration",
            "Description": "A 5-foot-diameter sphere of fire appears in an unoccupied space of your choice within range and lasts for the duration."
        },
        {
            "Name": "Gust of Wind",
            "School": "Evocation",
            "Description": "A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration."
        },
        {
            "Name": "Heat Metal",
            "School": "Transmutation",
            "Description": "Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor."
        },
        {
            "Name": "Hold Person",
            "School": "Enchantment",
            "Description": "The target must succeed on a Wisdom saving throw or be paralyzed for the duration."
        },
        {
            "Name": "Lesser Restoration",
            "School": "Abjuration",
            "Description": "You touch a creature and can end either one disease or one condition afflicting it."
        },
        {
            "Name": "Locate Animals or Plants",
            "School": "Divination",
            "Description": "Describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind."
        },
        {
            "Name": "Locate Object",
            "School": "Divination",
            "Description": "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you."
        },
        {
            "Name": "Moonbeam",
            "School": "Evocation",
            "Description": "A silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high cylinder centered on a point within range."
        },
        {
            "Name": "Pass without Trace",
            "School": "Abjuration",
            "Description": "A veil of shadows and silence radiates from you, masking you and your companions from detection."
        },
        {
            "Name": "Protection from Poison",
            "School": "Abjuration",
            "Description": "You touch a creature. If it is poisoned, you neutralize the poison."
        },
        {
            "Name": "Spike Growth",
            "School": "Transmutation",
            "Description": "The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns."
        }
    ]
}
