{
    "4thLevelDruidSpells": [
        {
            "Name": "Blight",
            "School": "Necromancy",
            "Description": "Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it."
        },
        {
            "Name": "Confusion",
            "School": "Enchantment",
            "Description": "This spell assaults and twists creatures' minds, spawning delusions and provoking uncontrolled actions."
        },
        {
            "Name": "Conjure Minor Elementals",
            "School": "Conjuration",
            "Description": "You summon elementals that appear in unoccupied spaces that you can see within range."
        },
        {
            "Name": "Conjure Woodland Beings",
            "School": "Conjuration",
            "Description": "You summon fey creatures that appear in unoccupied spaces that you can see within range."
        },
        {
            "Name": "Control Water",
            "School": "Transmutation",
            "Description": "Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side."
        },
        {
            "Name": "Dominate Beast",
            "School": "Enchantment",
            "Description": "You attempt to beguile a beast that you can see within range."
        },
        {
            "Name": "Freedom of Movement",
            "School": "Abjuration",
            "Description": "For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained."
        },
        {
            "Name": "Giant Insect",
            "School": "Transmutation",
            "Description": "You transform up to ten centipedes, three spiders, five wasps, or one scorpion within range into giant versions of their natural forms."
        },
        {
            "Name": "Hallucinatory Terrain",
            "School": "Illusion",
            "Description": "You make natural terrain in a 150-foot cube in range look, sound, and even smell like some other sort of natural terrain."
        },
        {
            "Name": "Ice Storm",
            "School": "Evocation",
            "Description": "A hail of rock-hard ice pounds to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range."
        },
        {
            "Name": "Locate Creature",
            "School": "Divination",
            "Description": "Describe or name a creature that is familiar to you."
        },
        {
            "Name": "Polymorph",
            "School": "Transmutation",
            "Description": "This spell transforms a creature that you can see within range into a new form."
        },
        {
            "Name": "Stone Shape",
            "School": "Transmutation",
            "Description": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose."
        },
        {
            "Name": "Stoneskin",
            "School": "Abjuration",
            "Description": "This spell turns the flesh of a willing creature you touch as hard as stone."
        },
        {
            "Name": "Wall of Fire",
            "School": "Evocation",
            "Description": "You create a wall of fire on a solid surface within range."
        }
    ]
}
