[
    {
        "Level": 1,
        "Archetype Feature": "Tempest Domain Spells",
        "Archetype Feature Description": [
            {
                "1st Level Spells": [
                    "Fog Cloud",
                    "Thunderwave"
                ]
            },
            {
                "3rd Level Spells": [
                    "Gust of Wind",
                    "Shatter"
                ]
            },
            {
                "5th Level Spells": [
                    "Call Lightning",
                    "Sleet Storm"
                ]
            },
            {
                "7th Level Spells": [
                    "Control Water",
                    "Ice Storm"
                ]
            },
            {
                "9th Level Spells": [
                    "Destructive Wave",
                    "Insect Plague"
                ]
            }
        ]
    },
    {
        "Level": 1,
        "Archetype Feature": "Bonus Proficiencies",
        "Archetype Feature Description": [
            "At 1st level, you gain proficiency with martial weapons and heavy armor."
        ]
    },
    {
        "Level": 1,
        "Archetype Feature": "Wrath of the Storm",
        "Archetype Feature Description": [
            "Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one.",
            "You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
        ]
    },
    {
        "Level": 2,
        "Archetype Feature": "Channel Divinity: Destructive Wrath",
        "Archetype Feature Description": [
            "Starting at 2nd level, you can use your Channel Divinity to wield the power of the storm with unchecked ferocity.",
            "When you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage, instead of rolling."
        ]
    },
    {
        "Level": 6,
        "Archetype Feature": "Thunderous Strike",
        "Archetype Feature Description": [
            "At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you."
        ]
    },
    {
        "Level": 8,
        "Archetype Feature": "Divine Strike",
        "Archetype Feature Description": [
            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        ]
    },
    {
        "Level": 17,
        "Archetype Feature": "Stormborn",
        "Archetype Feature Description": [
            "At 17th level, you have a flying speed equal to your current walking speed whenever you are not underground or indoors."
        ]
    }
]
