{
    "3rdLevelBardSpells": [
        {
            "Name": "Bestow Curse",
            "School": "Necromancy",
            "Description": "You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options."
        },
        {
            "Name": "Clairvoyance",
            "School": "Divination",
            "Description": "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees)."
        },
        {
            "Name": "Dispel Magic",
            "School": "Abjuration",
            "Description": "Choose any creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability."
        },
        {
            "Name": "Fear",
            "School": "Illusion",
            "Description": "You project a phantasmal image of a creature's worst fears. Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration."
        },
        {
            "Name": "Glyph of Warding",
            "School": "Abjuration",
            "Description": "When you cast this spell, you inscribe a glyph that harms other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph."
        },
        {
            "Name": "Hypnotic Pattern",
            "School": "Illusion",
            "Description": "You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes."
        },
        {
            "Name": "Major Image",
            "School": "Illusion",
            "Description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration."
        },
        {
            "Name": "Nondetection",
            "School": "Abjuration",
            "Description": "For the duration, you hide a target that you touch from divination magic. The target can be a willing creature or a place or an object no larger than 10 feet in any dimension."
        },
        {
            "Name": "Plant Growth",
            "School": "Transmutation",
            "Description": "This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits."
        },
        {
            "Name": "Sending",
            "School": "Evocation",
            "Description": "You send a short message of twenty-five words or less to a creature with which you are familiar."
        },
        {
            "Name": "Speak with Dead",
            "School": "Necromancy",
            "Description": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can't be undead."
        },
        {
            "Name": "Speak with Plants",
            "School": "Transmutation",
            "Description": "You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow simple commands."
        },
        {
            "Name": "Stinking Cloud",
            "School": "Conjuration",
            "Description": "You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners and is heavily obscured."
        },
        {
            "Name": "Tiny Hut",
            "School": "Evocation",
            "Description": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area."
        },
        {
            "Name": "Tongues",
            "School": "Divination",
            "Description": "This spell grants the creature you touch the ability to understand any spoken language it hears."
        }
    ]
}
