{
    "id": "acolyte_background",
    "BackgroundId": "acolyte",
    "Background Name": "Acolyte",
    "Description": "You have spent your life in the service of a temple to a specific god or pantheon of gods. You act as an intermediary between the realm of the holy and the mortal world, performing sacred rites and offering sacrifices in order to conduct worshipers into the presence of the divine.",
    "Skill Proficiencies": [
        "Insight",
        "Religion"
    ],
    "Languages": [
        "Two of your choice"
    ],
    "Starting Equipment": [
        "A holy symbol (a gift to you when you entered the priesthood)",
        "A prayer book or prayer wheel",
        "5 sticks of incense",
        "Vestments",
        "Common clothes",
        "15 gold pieces"
    ],
    "Feature": "Shelter of the Faithful",
    "Feature Description": "As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle. You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home.",
    "Personality Traits": [
        "1. I am always calm and composed, even in the face of danger.",
        "2. I find solace in prayer and meditation, and I often seek quiet moments of reflection.",
        "3. I am deeply curious about the beliefs and customs of other religions.",
        "4. I am fiercely loyal to my deity and will defend their honor at all costs.",
        "5. I am a good listener and am quick to offer advice and counsel to those in need.",
        "6. I have a strong sense of duty and responsibility to my temple and faith."
    ],
    "Ideals": [
        "1. Faith: My unwavering faith in my deity guides my actions and decisions. (Lawful)",
        "2. Charity: I believe in helping those less fortunate, and I give generously to the needy. (Good)",
        "3. Knowledge: I seek to expand my understanding of the divine and the mysteries of the universe. (Neutral)",
        "4. Power: I crave power and influence within my temple and will do whatever it takes to achieve it. (Evil)",
        "5. Freedom: I believe in the freedom to choose one's own path and beliefs. (Chaotic)",
        "6. Balance: I strive to maintain a balance between the mortal world and the divine. (Neutral)"
    ],
    "Bonds": [
        "1. My fellow acolytes are like family to me, and I would do anything to protect them.",
        "2. I am haunted by a vision or prophecy that I believe holds great significance.",
        "3. I am on a quest to recover a stolen relic of my deity that was lost to a rival faith.",
        "4. I owe a life debt to a stranger who once saved me from a dire situation.",
        "5. I am in love with a fellow acolyte, but our love is forbidden by the teachings of our faith.",
        "6. I am determined to convert others to my faith and share the enlightenment I have found."
    ],
    "Flaws": [
        "1. I am quick to judge those who do not share my faith or beliefs.",
        "2. I am easily manipulated by those who claim to have a divine connection.",
        "3. I am plagued by guilt over a past failure or mistake in my duties.",
        "4. I am overly superstitious and fear certain omens or signs.",
        "5. I am secretive about my true intentions and actions, even from my fellow acolytes.",
        "6. I have an insatiable desire for wealth and am willing to bend my faith's teachings to acquire it."
    ],
    "_rid": "LHEfAISGtYYKAAAAAAAAAA==",
    "_self": "dbs/LHEfAA==/colls/LHEfAISGtYY=/docs/LHEfAISGtYYKAAAAAAAAAA==/",
    "_etag": "\"55006c20-0000-1100-0000-6739f2a60000\"",
    "_attachments": "attachments/",
    "_ts": 1731850918
}