{
    "Background": [
        {
            "Background Name": "Acolyte",
            "Description": "You have spent your life in the service of a temple to a specific god or pantheon of gods. You act as an intermediary between the realm of the holy and the mortal world, performing sacred rites and offering sacrifices in order to conduct worshipers into the presence of the divine.",
            "Skill Proficiencies": [ "Insight", "Religion" ],
            "Languages": [ "Two of your choice" ],
            "Starting Equipment": [
                "A holy symbol (a gift to you when you entered the priesthood)",
                "A prayer book or prayer wheel",
                "5 sticks of incense",
                "Vestments",
                "Common clothes",
                "15 gold pieces"
            ],
            "Feature": "Shelter of the Faithful",
            "Feature Description": "As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle. You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home.",
            "Personality Traits": [
                "1. I am always calm and composed, even in the face of danger.",
                "2. I find solace in prayer and meditation, and I often seek quiet moments of reflection.",
                "3. I am deeply curious about the beliefs and customs of other religions.",
                "4. I am fiercely loyal to my deity and will defend their honor at all costs.",
                "5. I am a good listener and am quick to offer advice and counsel to those in need.",
                "6. I have a strong sense of duty and responsibility to my temple and faith."
            ],
            "Ideals": [
                "1. Faith: My unwavering faith in my deity guides my actions and decisions. (Lawful)",
                "2. Charity: I believe in helping those less fortunate, and I give generously to the needy. (Good)",
                "3. Knowledge: I seek to expand my understanding of the divine and the mysteries of the universe. (Neutral)",
                "4. Power: I crave power and influence within my temple and will do whatever it takes to achieve it. (Evil)",
                "5. Freedom: I believe in the freedom to choose one's own path and beliefs. (Chaotic)",
                "6. Balance: I strive to maintain a balance between the mortal world and the divine. (Neutral)"
            ],
            "Bonds": [
                "1. My fellow acolytes are like family to me, and I would do anything to protect them.",
                "2. I am haunted by a vision or prophecy that I believe holds great significance.",
                "3. I am on a quest to recover a stolen relic of my deity that was lost to a rival faith.",
                "4. I owe a life debt to a stranger who once saved me from a dire situation.",
                "5. I am in love with a fellow acolyte, but our love is forbidden by the teachings of our faith.",
                "6. I am determined to convert others to my faith and share the enlightenment I have found."
            ],
            "Flaws": [
                "1. I am quick to judge those who do not share my faith or beliefs.",
                "2. I am easily manipulated by those who claim to have a divine connection.",
                "3. I am plagued by guilt over a past failure or mistake in my duties.",
                "4. I am overly superstitious and fear certain omens or signs.",
                "5. I am secretive about my true intentions and actions, even from my fellow acolytes.",
                "6. I have an insatiable desire for wealth and am willing to bend my faith's teachings to acquire it."
            ]
        },
        {
            "Background Name": "Anthropologist",
            "Description": "You are a scholar of cultures, customs, and societies, fascinated by the diversity of human civilizations. You have traveled to distant lands, observing and studying the beliefs, traditions, and behaviors of various people.",
            "Skill Proficiencies": [ "Insight", "Religion" ],
            "Languages": [ "Two of your choice" ],
            "Starting Equipment": [
                "A set of traveler's clothes",
                "A diary filled with your observations",
                "A trinket from the culture you've studied",
                "A pouch containing 10 gold pieces"
            ],
            "Feature": "Cultural Chameleon",
            "Feature Description": "Before becoming an adventurer, you spent much of your adult life away from your homeland, living among people different from your kin. You came to understand these foreign cultures and the ways of their people, who eventually treated you as one of their own. One culture had more of an influence on you than any other, shaping your beliefs and customs. Choose a race whose culture you've adopted.",
            "Personality Traits": [
                "1. I am endlessly curious and eager to learn about new cultures and traditions.",
                "2. I am a patient observer, willing to spend hours watching and listening to better understand people.",
                "3. I have a knack for picking up languages and dialects quickly, making me a capable communicator.",
                "4. I am respectful of cultural differences and always try to adapt to local customs.",
                "5. I find it difficult to connect with people who don't share my passion for anthropology.",
                "6. I have a tendency to take extensive notes on everything I encounter, sometimes to the annoyance of others."
            ],
            "Ideals": [
                "1. Understanding: My goal is to foster understanding and respect between cultures. (Good)",
                "2. Knowledge: I believe that knowledge is the key to harmony and progress. (Neutral)",
                "3. Preservation: It is my duty to preserve and document the traditions of endangered cultures. (Lawful)",
                "4. Discovery: I am driven by the desire to uncover the world's hidden cultures and secrets. (Chaotic)",
                "5. Isolation: I prefer the company of ancient texts and artifacts to that of living people. (Neutral)",
                "6. Ambition: I aim to become the world's foremost authority on cultures and societies. (Any)"
            ],
            "Bonds": [
                "1. I have a mentor who inspired my love for anthropology, and I seek to make them proud.",
                "2. I am haunted by the memory of a cultural misunderstanding that had disastrous consequences.",
                "3. I am in possession of a rare artifact from a distant culture, and I feel a deep responsibility to protect it.",
                "4. My fascination with a specific culture has led me to form a deep bond with one of its members.",
                "5. I owe a debt to the academic community that sponsored my early expeditions, and I must repay it.",
                "6. I have a rival in the field of anthropology who constantly challenges and mocks my work."
            ],
            "Flaws": [
                "1. I can become overly absorbed in my studies, neglecting other important aspects of life.",
                "2. I can be overly critical of those who misunderstand or disrespect the cultures I study.",
                "3. I am hesitant to form close bonds with others, fearing that they will hinder my research.",
                "4. I have a tendency to jump to conclusions based on incomplete observations.",
                "5. I am easily frustrated when others don't share my passion for anthropology.",
                "6. I am prone to taking risks and putting myself in dangerous situations to gather information."
            ],
            "Cultural Chameleon": {
                "Race Influence": "Choose a race whose culture you've adopted."
            },
            "Adept Linguist": {
                "Description": "You can communicate with humanoids who don't speak any language you know. You must observe the humanoids interacting with one another for at least 1 day, after which you learn a handful of important words, expressions, and gestures – enough to communicate on a rudimentary level."
            }
        },
        {
            "Background Name": "Archaeologist",
            "Description": "You are an expert in uncovering the mysteries of ancient civilizations and the relics they left behind. You have spent years exploring ruins, tombs, and forgotten temples in search of knowledge and treasure.",
            "Skill Proficiencies": [ "History", "Survival" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A set of archaeologist's tools",
                "A shovel",
                "A diary filled with notes on past expeditions",
                "A trinket from a dig site",
                "A pouch containing 10 gold pieces"
            ],
            "Feature": "Archaeological Expertise",
            "Feature Description": "Your expertise in archaeology allows you to identify ancient relics, decipher forgotten scripts, and navigate through treacherous ruins. You can determine the historical significance and potential value of artifacts you find, and you have a network of contacts in the archaeological community who can provide you with information and assistance.",
            "Dust Digger": {
                "Description": "Prior to becoming an adventurer, you spent most of your young life crawling around in the dust, pilfering relics of questionable value from crypts and ruins. Though you managed to sell a few of your discoveries and earn enough coin to buy proper adventuring gear, you have held onto an item that has great emotional value to you. Roll on the Signature Item table to see what you have, or choose an item from the table.",
                "Signature Item": [
                    "1. 10-foot pole",
                    "2. Medallion",
                    "3. Crowbar",
                    "4. Shovel",
                    "5. Hat",
                    "6. Sledgehammer",
                    "7. Hooded lantern",
                    "8. Whip"
                ]
            },
            "Historical Knowledge": {
                "Description": "When you enter a ruin or dungeon, you can correctly ascertain its original purpose and determine its builders, whether those were dwarves, elves, humans, yuan-ti, or some other known race. In addition, you can determine the monetary value of art objects more than a century old."
            },
            "Personality Traits": [
                "1. I am patient and methodical in my work, willing to spend hours meticulously examining artifacts and ruins.",
                "2. I have a deep respect for the cultures of the past and a desire to preserve their history.",
                "3. I am always curious and eager to uncover new knowledge and secrets hidden in the earth.",
                "4. I tend to be a bit absent-minded, often lost in thought about the mysteries of the past.",
                "5. I enjoy sharing the stories and history I've uncovered with others, even if they're not as interested as I am.",
                "6. I have a tendency to take risks when it comes to exploring dangerous ruins and tombs."
            ],
            "Ideals": [
                "1. Knowledge: I believe that uncovering the secrets of the past is a noble pursuit and that knowledge should be shared. (Good)",
                "2. Discovery: I am driven by the desire to uncover lost civilizations and the treasures they left behind. (Neutral)",
                "3. Preservation: I am dedicated to preserving the artifacts and knowledge of the past for future generations. (Lawful)",
                "4. Adventure: I crave the thrill of exploration and the excitement of unearthing ancient mysteries. (Chaotic)",
                "5. Ambition: I am determined to become the world's most renowned archaeologist, no matter the cost. (Any)",
                "6. Obsession: I am obsessed with a particular artifact or mystery, and I will stop at nothing to find it. (Neutral)"
            ],
            "Bonds": [
                "1. I have a mentor who taught me everything I know about archaeology, and I seek to honor their legacy.",
                "2. I have a deep respect for the indigenous people of the lands where I explore, and I strive to build positive relationships with them.",
                "3. I have a rival archaeologist who constantly challenges my discoveries and seeks to outshine me.",
                "4. I owe a significant debt to a wealthy patron who funds my expeditions, and I must deliver valuable artifacts to repay them.",
                "5. I have uncovered a map or ancient text that hints at the location of a legendary lost city, and I am determined to find it.",
                "6. I have made a solemn vow to protect a sacred site from those who would loot or defile it."
            ],
            "Flaws": [
                "1. I can become overly absorbed in my work, neglecting personal relationships and safety.",
                "2. I am fiercely competitive and will go to great lengths to ensure I make the most significant discoveries.",
                "3. I am reckless when it comes to danger, often putting myself and my companions in risky situations.",
                "4. I am secretive about my discoveries, fearing that others will steal my knowledge or artifacts.",
                "5. I am easily distracted by new leads and mysteries, often abandoning current projects for the next big discovery.",
                "6. I have a tendency to overlook the practical needs of survival in my quest for knowledge."
            ]
        },
        {
            "Background Name": "Athlete",
            "Description": "You are a skilled athlete who has excelled in physical competitions and sports. You might have been a professional athlete, a celebrated champion, or a rising star in your chosen sport before you became an adventurer.",
            "Skill Proficiencies": [ "Athletics", "Acrobatics" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A set of athletic clothing",
                "A trophy or award from your past athletic career",
                "A water skin",
                "A pouch containing 10 gold pieces"
            ],
            "Feature": "Athletic Prowess",
            "Feature Description": "Your physical training and athletic abilities give you an edge in physical challenges. You have advantage on Strength (Athletics) checks and Dexterity (Acrobatics) checks related to physical feats and competitions. Additionally, you can earn a modest living through your athletic skills, such as by performing in exhibitions, teaching sports, or participating in competitions."
        },
        {
            "Personality Traits": [
                "1. I am competitive by nature and always strive to be the best at what I do.",
                "2. I am disciplined and dedicated to my physical training and strive for constant improvement.",
                "3. I love the thrill of physical challenges and am always seeking new contests to test my abilities.",
                "4. I am confident in my skills and enjoy showing off my athletic prowess to others.",
                "5. I am a team player and value cooperation and camaraderie with my fellow adventurers.",
                "6. I can be a bit of a show-off, especially when it comes to my athletic abilities."
            ],
            "Ideals": [
                "1. Excellence: I strive for excellence in all things and aim to be the best I can be. (Any)",
                "2. Competition: I live for the thrill of competition and seek out challenges to prove my skills. (Chaotic)",
                "3. Sportsmanship: I believe in fair play, respect for opponents, and upholding the spirit of the game. (Good)",
                "4. Glory: I am driven by the desire for fame, recognition, and the adoration of fans. (Any)",
                "5. Teamwork: I value teamwork and believe that together, we can achieve greatness. (Lawful)",
                "6. Fun: I view athletics as a way to have fun and enjoy life to the fullest. (Chaotic)"
            ],
            "Bonds": [
                "1. My coach or mentor played a significant role in my life, and I owe my success to their guidance.",
                "2. I have a loyal fan or supporter who follows me on my adventures and cheers me on from afar.",
                "3. I am part of a sports team or league, and my teammates are like family to me.",
                "4. I have a friendly rivalry with a fellow athlete, and we constantly push each other to improve.",
                "5. I have a sports-related goal or dream that I am determined to achieve.",
                "6. I once faced a humiliating defeat that still haunts me, and I am determined to redeem myself."
            ],
            "Flaws": [
                "1. I can be overly competitive and struggle to accept defeat gracefully.",
                "2. I sometimes prioritize my athletic pursuits over other responsibilities and commitments.",
                "3. I have a short temper, especially when I perceive unfairness or cheating in sports.",
                "4. I can be reckless in my pursuit of physical challenges, risking injury or harm to myself and others.",
                "5. I have a tendency to boast about my athletic accomplishments, which can rub people the wrong way.",
                "6. I can be overly superstitious, believing in rituals and lucky charms to improve my performance."
            ]
        },
        {
            "Background Name": "Charlatan",
            "Description": "You are a master of deception and trickery, skilled at pretending to be someone you're not. You might have been a con artist, a hustler, or a street performer who uses your skills to manipulate and deceive others for personal gain.",
            "Skill Proficiencies": [ "Deception", "Sleight of Hand" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A set of fine clothes",
                "A disguise kit",
                "A forgery kit",
                "A small token from a past scam or trick",
                "A pouch containing 15 gold pieces"
            ],
            "Feature": "False Identity",
            "Feature Description": "You have created a false identity for yourself, complete with documentation, backstories, and even relationships. This identity allows you to operate freely in certain social circles or evade the authorities. You can always find a way to disappear and create a new persona if needed."
        },
        {
            "Personality Traits": [
                "1. I am charming and charismatic, able to win people over with ease.",
                "2. I am a quick thinker and can come up with clever solutions on the spot.",
                "3. I have a mischievous sense of humor and enjoy playing pranks and tricks on others.",
                "4. I am highly observant, always on the lookout for opportunities to deceive or manipulate.",
                "5. I am confident in my abilities and often take risks to achieve my goals.",
                "6. I can be quite secretive and rarely reveal my true intentions to others."
            ],
            "Ideals": [
                "1. Freedom: I value my independence and the ability to live life on my own terms. (Chaotic)",
                "2. Greed: I am primarily motivated by wealth and am willing to do whatever it takes to get rich. (Evil)",
                "3. Creativity: I see deception and trickery as forms of art and enjoy the challenge of coming up with new schemes. (Chaotic)",
                "4. Liberation: I use my skills to help those who are oppressed or in need of escape from difficult situations. (Good)",
                "5. Survival: I do what I must to survive and thrive in a world where trust is often a liability. (Neutral)",
                "6. Aspiration: I am always seeking to climb the social ladder and gain more power and influence. (Any)"
            ],
            "Bonds": [
                "1. I have a partner-in-crime or fellow charlatan who I trust implicitly.",
                "2. I owe a significant debt to a crime lord or powerful figure who I must repay.",
                "3. I have a family member or loved one who I must protect from the consequences of my actions.",
                "4. I am seeking revenge against someone who exposed my true identity or betrayed me.",
                "5. I have a soft spot for the downtrodden and often help those in need, even if it puts me at risk.",
                "6. I am constantly on the run from the law or a vengeful victim of one of my scams."
            ],
            "Flaws": [
                "1. I am easily tempted by the allure of wealth and can't resist a lucrative opportunity.",
                "2. I am manipulative and have a hard time forming genuine, lasting relationships.",
                "3. I am a compulsive liar and often weave elaborate tales even when the truth would suffice.",
                "4. I have a short attention span and quickly lose interest in long-term plans or commitments.",
                "5. I am always looking out for number one and will betray others if it serves my interests.",
                "6. I have a tendency to underestimate the consequences of my actions, leading to trouble."
            ]
        },
        {
            "Background Name": "City Watch",
            "Description": "You are a member of the city's watch or guard force, responsible for maintaining law and order within the urban environment. You might have served as a constable, patrol officer, or investigator in a bustling city.",
            "Skill Proficiencies": [ "Athletics", "Insight" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A uniform from your city watch or guard force",
                "A badge of authority",
                "A set of manacles",
                "A signal whistle",
                "A pouch containing 10 gold pieces"
            ],
            "Feature": "Watcher's Eye",
            "Feature Description": "Your experience in law enforcement allows you to navigate urban environments effectively. You can easily find your way around city streets and neighborhoods, and you can identify criminal activity or dangerous situations with a keen eye. Additionally, you have access to city watch resources and can call upon your colleagues for assistance in certain situations."
        },
        {
            "Personality Traits": [
                "1. I am disciplined and take my duties seriously, always striving to uphold the law.",
                "2. I am observant and pay attention to the details, which helps me uncover hidden threats and suspects.",
                "3. I am protective of the citizens I serve and am always ready to step in to help those in need.",
                "4. I have a strong sense of justice and will go to great lengths to bring criminals to justice.",
                "5. I am loyal to my fellow city watch members and consider them to be like family.",
                "6. I can be a bit of a stickler for rules and regulations, often insisting on proper procedures."
            ],
            "Ideals": [
                "1. Duty: I believe in upholding the law and serving the greater good of the city. (Lawful)",
                "2. Justice: I am driven by a strong sense of justice and the need to protect the innocent. (Good)",
                "3. Order: I value order and stability within the city, even if it means sacrificing personal freedom. (Lawful)",
                "4. Independence: I am committed to personal freedom and resist any attempts to infringe on it. (Chaotic)",
                "5. Loyalty: I am fiercely loyal to my fellow city watch members and will protect them at all costs. (Neutral)",
                "6. Ambition: I seek to rise through the ranks of the city watch and gain more power and influence. (Any)"
            ],
            "Bonds": [
                "1. I have a mentor or superior officer who taught me the ropes and helped shape my career.",
                "2. I am deeply connected to my hometown or the city where I serve and will defend it fiercely.",
                "3. I have a close friend or family member who is a civilian, and I constantly worry about their safety.",
                "4. I have a nemesis or criminal adversary who always manages to evade justice, and I am determined to catch them.",
                "5. I owe a debt of gratitude to a citizen who once saved my life, and I am committed to repaying it.",
                "6. I am haunted by a past mistake or failure that still weighs on my conscience."
            ],
            "Flaws": [
                "1. I can be overly cautious, second-guessing my decisions and hesitating in critical situations.",
                "2. I am quick to assume guilt and can be suspicious of innocent individuals, especially if they are from outside the city.",
                "3. I have a tendency to use excessive force when dealing with threats, which can lead to problems with superiors or the public.",
                "4. I have hatred for my enemies which is blind and unreasoning.",
                "5. I obey the law, even if the law causes misery.",
                "6. I’d rather eat my armor than admit when I’m wrong."
            ]
        },
        {
            "Background Name": "Clan Crafter",
            "Description": "You are a skilled artisan, craftsman, or artisanal worker who hails from a close-knit clan or guild known for its exceptional craftsmanship. Whether you are a blacksmith, jeweler, stonemason, or another type of craftsman, your skills are highly valued by your clan, and you take pride in your work.",
            "Skill Proficiencies": [ "History", "Insight" ],
            "Languages": [ "Dwarvish or one other language of your choice" ],
            "Starting Equipment": [
                "A set of artisan's tools related to your craft (e.g., smith's tools, jeweler's tools, mason's tools)",
                "A set of traveler's clothes",
                "A symbol of your clan or guild",
                "A belt pouch containing 15 gold pieces"
            ],
            "Feature": "Artisan's Expertise",
            "Feature Description": "Your expertise in your craft allows you to create high-quality items and repairs. You can craft mundane items of your chosen craft at half the time and cost. Additionally, you have an extensive knowledge of materials and craftsmanship, making you a valuable resource when evaluating the quality and authenticity of items."
        },
        {
            "Personality Traits": [
                "1. I take great pride in my craft and always strive for perfection in my work.",
                "2. I am patient and methodical, willing to spend hours on a single piece to ensure its quality.",
                "3. I am deeply loyal to my clan or guild and will do anything to protect its reputation.",
                "4. I am always curious about new materials and techniques and am eager to learn from others.",
                "5. I can be quite reserved and stoic, preferring to let my work speak for me.",
                "6. I enjoy sharing stories and legends of my clan's craftsmanship with others."
            ],
            "Ideals": [
                "1. Tradition: I value the traditional ways of my clan and strive to preserve our ancient craft. (Lawful)",
                "2. Excellence: I am driven to achieve excellence in my work and create masterpieces that will be admired for generations. (Any)",
                "3. Innovation: I am always seeking new ways to improve my craft and push the boundaries of what is possible. (Chaotic)",
                "4. Community: I believe in the power of a close-knit clan or guild and the support it provides to its members. (Good)",
                "5. Ambition: I seek to gain recognition and fame beyond my clan's borders and establish my own legacy. (Any)",
                "6. Artistry: I see my craft as a form of art, and I aim to create pieces that evoke emotions and inspire others. (Any)"
            ],
            "Bonds": [
                "1. My clan or guild is like family to me, and I would do anything to protect its interests.",
                "2. I owe a significant debt of gratitude to a mentor who taught me everything I know about my craft.",
                "3. I have a rival craftsman from a competing clan or guild, and our rivalry is a driving force in my life.",
                "4. I have taken an apprentice, and I am dedicated to passing on my knowledge and skills to the next generation.",
                "5. I have a deep connection to a particular material or gemstone, and I am always on the lookout for it in my travels.",
                "6. I have uncovered a long-lost technique or secret of my craft, and I am determined to master it."
            ],
            "Flaws": [
                "1. I can be overly critical of others' work, often finding fault where others see excellence.",
                "2. I am fiercely competitive and will go to great lengths to prove the superiority of my clan's craftsmanship.",
                "3. I can become obsessed with my work, neglecting personal relationships and other responsibilities.",
                "4. I am stubborn and resistant to change, even when new techniques or ideas could improve my craft.",
                "5. I have a tendency to hoard rare materials and items related to my craft, sometimes to the detriment of others.",
                "6. I am quick to take offense when my clan's honor or craftsmanship is questioned, leading to confrontations."
            ]
        },
        {
            "Background Name": "Cloistered Scholar",
            "Description": "You are a scholar who has spent years in seclusion, studying ancient tomes, scrolls, and texts in pursuit of knowledge. Your life has been dedicated to learning and the pursuit of academic excellence.",
            "Skill Proficiencies": [ "History", "Research (Homebrew Skill)" ],
            "Languages": [ "Two of your choice" ],
            "Starting Equipment": [
                "A set of common clothes",
                "A scroll of your research notes",
                "A bottle of ink and a quill",
                "A small knife",
                "A pouch containing 10 gold pieces"
            ],
            "Feature": "Library Access",
            "Feature Description": "Your scholarly background grants you access to libraries and repositories of knowledge that are not typically available to the public. You can gain entry to academic institutions, libraries, and the personal collections of scholars and sages. Additionally, you can often request assistance and information from other scholars and researchers."
        },
        {
            "Personality Traits": [
                "1. I am inquisitive and constantly seek new knowledge and insights.",
                "2. I am patient and meticulous in my research, willing to spend hours on a single topic.",
                "3. I am introverted and prefer the company of books and scrolls to that of people.",
                "4. I am eager to share my knowledge with others and enjoy teaching and explaining complex topics.",
                "5. I am always seeking to uncover hidden truths and secrets, no matter where they may lead.",
                "6. I can be absent-minded and forgetful, often losing track of time when engrossed in my studies."
            ],
            "Ideals": [
                "1. Knowledge: I believe that knowledge is the greatest treasure and should be pursued at all costs. (Neutral)",
                "2. Wisdom: I seek to use my knowledge for the betterment of the world and the enlightenment of others. (Good)",
                "3. Ambition: I am driven by the desire to make groundbreaking discoveries and achieve academic recognition. (Any)",
                "4. Truth: I value truth and the pursuit of truth above all else, even when it challenges established beliefs. (Lawful)",
                "5. Curiosity: I am constantly driven by curiosity and the need to explore the unknown. (Chaotic)",
                "6. Isolation: I prefer the solitude of study and contemplation, valuing my personal research above all else. (Neutral)"
            ],
            "Bonds": [
                "1. I have a mentor or respected scholar who taught me the ways of academia, and I owe them a debt of gratitude.",
                "2. I am dedicated to uncovering the lost knowledge of a long-forgotten civilization or culture.",
                "3. I have a personal library or collection of rare tomes that I will go to great lengths to protect.",
                "4. I am haunted by a riddle or enigma that has eluded my understanding for years, and I am determined to solve it.",
                "5. I have a deep respect for the scholarly community, and I strive to foster collaboration and camaraderie among scholars.",
                "6. I have a special interest in a particular field of study, and I am always on the lookout for new information related to it."
            ],
            "Flaws": [
                "1. I can become obsessed with my research, neglecting personal relationships and other responsibilities.",
                "2. I am often oblivious to the world around me, frequently lost in my thoughts and studies.",
                "3. I can be condescending and impatient with those who lack my level of knowledge and understanding.",
                "4. I am secretive about my findings and discoveries, fearing that others may steal or exploit them.",
                "5. I have a tendency to overanalyze and overthink, making simple decisions more complicated than they need to be.",
                "6. I am easily distracted by new topics and ideas, often abandoning current research for the next intriguing subject."
            ]
        },
        {
            "Background Name": "Courtier",
            "Description": "You are skilled in the arts of diplomacy and courtly etiquette, and you have spent significant time in the refined and complex environment of a royal court or noble court. You may have served as an ambassador, advisor, or diplomat to a noble family or a monarch.",
            "Skill Proficiencies": [ "Persuasion", "Insight" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "Fine clothes",
                "A signet ring or emblem of your courtly rank",
                "A scroll with a letter of introduction from a noble",
                "A courtier's favor (a trinket or token given to you by a noble)",
                "A purse containing 10 gold pieces"
            ],
            "Feature": "Courtly Influence",
            "Feature Description": "Your familiarity with courtly customs and etiquette grants you access to noble circles and influential individuals. You can often secure an audience with local nobility and gain information or assistance from courtiers. Additionally, you may find it easier to negotiate in social situations and navigate the complex web of courtly intrigue."
        },
        {
            "Personality Traits": [
                "1. I am charming and skilled at making a good impression in social situations.",
                "2. I am observant and can discern the hidden motives and emotions of others.",
                "3. I am a master of diplomacy and can defuse tense situations with tact and grace.",
                "4. I enjoy the thrill of courtly intrigue and am always on the lookout for secrets and plots.",
                "5. I am loyal to my noble patrons and will go to great lengths to serve their interests.",
                "6. I can be quite proud and look down on those who lack noble status or refinement."
            ],
            "Ideals": [
                "1. Loyalty: I am devoted to my noble patrons and will protect their interests at all costs. (Lawful)",
                "2. Diplomacy: I believe in the power of diplomacy and negotiation to solve conflicts and maintain peace. (Good)",
                "3. Ambition: I am driven by personal ambition and seek to rise through the ranks of the court. (Any)",
                "4. Intrigue: I thrive on courtly intrigue and enjoy unraveling secrets and conspiracies. (Chaotic)",
                "5. Independence: I value my own freedom and interests above those of any noble. (Neutral)",
                "6. Excellence: I am committed to achieving excellence in all aspects of courtly life. (Any)"
            ],
            "Bonds": [
                "1. I have a deep and unrequited love for a noble or someone in a position of power at court.",
                "2. I am deeply loyal to a noble family that has treated me like one of their own.",
                "3. I owe a significant debt of gratitude to a noble who once saved my life or provided me with an opportunity.",
                "4. I am on a mission to uncover a dangerous secret that threatens a noble house or the entire court.",
                "5. I have a rival at court, someone who seeks to undermine me and my standing with the nobility.",
                "6. I am driven by a personal vendetta against a noble who wronged me or my family in the past."
            ],
            "Flaws": [
                "1. I can be overly trusting of noble intentions, often overlooking their hidden agendas.",
                "2. I am easily manipulated by those who use flattery and charm to gain my favor.",
                "3. I am prone to gossip and spreading rumors, which can lead to trouble in courtly circles.",
                "4. I am obsessed with social status and can become resentful of those who outrank me.",
                "5. I am a risk-taker and can make rash decisions in pursuit of personal gain or intrigue.",
                "6. I have a tendency to hold grudges and seek revenge against those who slight or insult me."
            ]
        },
        {
            "Background Name": "Criminal",
            "Description": "You have a history of illicit activities and are well-versed in the ways of crime. Whether you were a thief, a burglar, or a member of an organized crime syndicate, you are skilled at navigating the underworld and evading the law.",
            "Skill Proficiencies": [ "Deception", "Stealth" ],
            "Tool Proficiencies": [ "Thieves' Tools" ],
            "Starting Equipment": [
                "A crowbar",
                "A set of dark common clothes including a hood",
                "A pouch containing 15 gold pieces",
                "A dagger",
                "A token to remember your parents or another trinket of sentimental value"
            ],
            "Feature": "Criminal Contact",
            "Feature Description": "You have a reliable and well-informed contact within the criminal underworld. This contact can provide you with information about illegal activities, help you find fences for stolen goods, and introduce you to other criminals. You can also use this contact to arrange meetings with criminal allies or gather information about specific criminal activities."
        },
        {
            "Personality Traits": [
                "1. I am street-smart and always on the lookout for danger in my surroundings.",
                "2. I have a quick wit and a silver tongue, making it easy for me to talk my way out of trouble.",
                "3. I am loyal to my criminal associates and would never betray them.",
                "4. I am a risk-taker and love the thrill of danger and excitement.",
                "5. I am fiercely independent and don't like taking orders from others.",
                "6. I am resourceful and can find creative solutions to problems."
            ],
            "Ideals": [
                "1. Freedom: I value my independence and will do whatever it takes to maintain it. (Chaotic)",
                "2. Loyalty: I am fiercely loyal to my criminal crew and would do anything for them. (Neutral)",
                "3. Greed: I am motivated by wealth and am willing to do whatever it takes to get rich. (Evil)",
                "4. Ambition: I have big plans and am willing to climb the criminal ladder to achieve them. (Any)",
                "5. Revenge: I seek revenge against a specific person or organization that wronged me. (Chaotic)",
                "6. Survival: I do whatever it takes to survive in a dangerous world. (Neutral)"
            ],
            "Bonds": [
                "1. I have a family member or loved one who is unaware of my criminal activities, and I want to protect them from the truth.",
                "2. I owe a significant debt to a powerful crime lord, and I must repay it to stay alive.",
                "3. I have a close friend or ally from my criminal past who I trust implicitly.",
                "4. I have a rival or nemesis in the criminal underworld, and our rivalry is a driving force in my life.",
                "5. I am on the run from the law, constantly evading capture and staying one step ahead of the authorities.",
                "6. I am haunted by a past crime or betrayal that still weighs on my conscience."
            ],
            "Flaws": [
                "1. I can be ruthless and will do whatever it takes to achieve my criminal goals, even if it means harming others.",
                "2. I have a short temper and can become violent when provoked or frustrated.",
                "3. I am paranoid and constantly looking over my shoulder, fearing that my past will catch up with me.",
                "4. I have a tendency to trust too easily, making me vulnerable to betrayal by my criminal associates.",
                "5. I am superstitious and believe in omens and signs, often making decisions based on irrational fears.",
                "6. I can be overconfident in my abilities and often underestimate my enemies."
            ]
        },
        {
            "Background Name": "Entertainer",
            "Description": "You are a performer, artist, or entertainer who has honed your skills in front of live audiences. Whether you are a musician, actor, dancer, or circus performer, you thrive on applause and the spotlight.",
            "Skill Proficiencies": [ "Acrobatics", "Performance" ],
            "Tool Proficiencies": [ "One type of musical instrument or one type of artisan's tool" ],
            "Starting Equipment": [
                "A musical instrument (of your choice) or one type of artisan's tool",
                "The favor of an admirer (a small trinket or token)",
                "A costume or set of flashy clothes",
                "A pouch containing 15 gold pieces"
            ],
            "Feature": "By Popular Demand",
            "Feature Description": "You can always find a place to perform, usually in an inn or tavern but potentially with a circus, at a noble's court, or even on the streets. Your performances can earn you free room and board, or you can make a modest income while performing. The amount of money you can make varies depending on the quality of your performance and the local demand for entertainment."
        },
        {
            "Personality Traits": [
                "1. I am a natural performer and love being the center of attention.",
                "2. I am quick-witted and always ready with a clever comeback or joke.",
                "3. I am empathetic and can connect with people's emotions through my performances.",
                "4. I am easily excitable and prone to moments of enthusiasm and exuberance.",
                "5. I am fiercely dedicated to my craft and strive for perfection in my performances.",
                "6. I am a bit of a show-off and enjoy flaunting my talents whenever possible."
            ],
            "Ideals": [
                "1. Fame: I am driven by the desire for fame and recognition as the best entertainer in the world. (Any)",
                "2. Artistic Expression: I believe in the power of art and creativity to inspire and uplift others. (Good)",
                "3. Joy: I perform to bring joy and laughter to people's lives, regardless of their troubles. (Good)",
                "4. Freedom: I value my independence and the freedom to perform on my own terms. (Chaotic)",
                "5. Excellence: I strive for excellence in my craft and am always pushing the boundaries of what I can do. (Any)",
                "6. Wealth: I perform to make a comfortable living and am motivated by the promise of financial success. (Neutral)"
            ],
            "Bonds": [
                "1. I have a close friend or mentor who taught me everything I know about my art, and I owe them a great deal.",
                "2. I am dedicated to a cause or charity and use my performances to raise funds for it.",
                "3. I have a family member or loved one who is my biggest fan and attends all of my shows.",
                "4. I have a rival performer or entertainer whom I am constantly trying to outshine.",
                "5. I owe a significant debt to a patron who has supported me and my career.",
                "6. I am on a quest to find the ultimate performance piece or artistic inspiration."
            ],
            "Flaws": [
                "1. I can be easily distracted by the allure of parties, social events, and adoring fans.",
                "2. I am prone to mood swings and can be moody or temperamental, especially when my performances don't go well.",
                "3. I am a perfectionist and am highly critical of myself, often dwelling on my mistakes.",
                "4. I can be overly competitive and see other performers as rivals to be defeated.",
                "5. I am superstitious and have a set of rituals and routines I must follow before each performance.",
                "6. I have a tendency to overspend on luxuries and extravagances, leaving me in financial trouble at times."
            ]
        },
        {
            "Background Name": "Faceless",
            "Description": "You are a master of disguise and subterfuge, skilled at blending into any environment or society. Your past is a mystery, and you excel at adopting new identities and concealing your true self.",
            "Skill Proficiencies": [ "Deception", "Stealth" ],
            "Tool Proficiencies": [ "Disguise Kit" ],
            "Starting Equipment": [
                "A disguise kit",
                "A set of common clothes",
                "A hidden pocket containing 10 gold pieces",
                "A forged identification document"
            ],
            "Feature": "Chameleon Persona",
            "Feature Description": "Your expertise in disguise allows you to assume new identities with ease. You can create and maintain a false persona, complete with a backstory and forged documents. People who interact with you while you're using your persona find it difficult to remember specific details about your appearance or true identity. You have an advantage on Deception checks to maintain your disguise and on Stealth checks to blend in or disappear in a crowd."
        },
        {
            "Personality Traits": [
                "1. I am cautious and always on guard, never revealing my true feelings or thoughts.",
                "2. I am adaptable and can adjust my personality and demeanor to fit any situation.",
                "3. I am distrustful of others and find it difficult to form deep connections or friendships.",
                "4. I am curious about people and enjoy observing them from the shadows.",
                "5. I am meticulous in my preparations, paying attention to every detail in my disguises.",
                "6. I am secretive and rarely reveal anything personal about myself."
            ],
            "Ideals": [
                "1. Freedom: I value my ability to remain hidden and independent. (Chaotic)",
                "2. Truth: I believe that the truth is a powerful weapon, and I use deception to uncover it. (Neutral)",
                "3. Ambition: I am driven by personal goals and desires, and I will use any means to achieve them. (Evil)",
                "4. Justice: I use my talents to expose corruption and wrongdoing in society. (Good)",
                "5. Survival: I do whatever it takes to stay alive in a dangerous world. (Neutral)",
                "6. Mystery: I enjoy the intrigue and enigma of my own past and the secrets I uncover. (Chaotic)"
            ],
            "Bonds": [
                "1. I owe a significant debt to a secretive organization that trained me in the art of disguise and subterfuge.",
                "2. I have a mentor who taught me the skills of the Faceless background, and I owe them a great deal.",
                "3. I have a hidden agenda or mission that I am pursuing, and my true identity plays a part in it.",
                "4. I am searching for answers about my own past and true identity, driven by a mysterious past event.",
                "5. I have a close ally who knows my true identity and helps me maintain my cover.",
                "6. I am hunted by a powerful enemy who is determined to uncover my secrets and expose me."
            ],
            "Flaws": [
                "1. I can be overly cautious and paranoid, always suspecting that others are trying to expose me.",
                "2. I struggle with maintaining genuine relationships, as I fear that my true identity will be discovered.",
                "3. I am prone to identity crises, sometimes losing track of who I truly am in the midst of multiple personas.",
                "4. I have a fear of commitment and can be quick to abandon allies or plans if they become too risky.",
                "5. I am obsessed with secrecy and can be overly secretive, even when it's not necessary.",
                "6. I have a tendency to manipulate and deceive others, even when it's not in my best interest."
            ]
        },
        {
            "Background Name": "Faction Agent",
            "Description": "You are a member of a secretive organization or faction that operates behind the scenes, working to advance its own agenda and protect its interests. Whether you belong to a political faction, a spy network, a religious order, or a guild, you have access to resources, information, and support from your organization.",
            "Skill Proficiencies": [ "Insight", "Investigation" ],
            "Tool Proficiencies": [ "None" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A set of common clothes with a hidden emblem or symbol of your faction",
                "A badge or token of your faction's membership",
                "A letter of introduction from your faction",
                "A pouch containing 15 gold pieces"
            ],
            "Feature": "Faction Resources",
            "Feature Description": "You can rely on your faction for assistance, resources, and information. Your faction can provide you with safe houses, contacts, and access to secret information. In times of need, you can call upon your faction for support, such as shelter, equipment, or information about a particular topic or individual."
        },
        {
            "Personality Traits": [
                "1. I am fiercely loyal to my faction and its goals, willing to do whatever it takes to further its interests.",
                "2. I am cautious and always alert to potential threats and hidden agendas.",
                "3. I am a master of subterfuge and can blend into different social circles with ease.",
                "4. I am resourceful and can find creative solutions to problems, using the resources of my faction.",
                "5. I am secretive and rarely reveal more than necessary about my faction or its activities.",
                "6. I am committed to uncovering secrets and gathering information, driven by a thirst for knowledge."
            ],
            "Ideals": [
                "1. Loyalty: I am devoted to my faction above all else and will do whatever it takes to protect its interests. (Lawful)",
                "2. Freedom: I believe in the importance of personal freedom and work to undermine oppressive forces. (Chaotic)",
                "3. Justice: I strive to bring about justice and fairness in the world, using my faction's resources. (Good)",
                "4. Power: I seek to increase my own power and influence, both within my faction and in the world. (Neutral)",
                "5. Ambition: I am driven by personal ambition and seek to rise to the highest ranks of my faction. (Any)",
                "6. Secrecy: I value the secrecy and hidden knowledge of my faction and will protect it at all costs. (Neutral)"
            ],
            "Bonds": [
                "1. I have a mentor or senior member within my faction who guides and trains me.",
                "2. I owe a significant debt of gratitude to a faction member who once saved my life or provided me with an opportunity.",
                "3. I have a deep connection to a specific cause or mission of my faction and am dedicated to its success.",
                "4. I have a close ally within my faction whom I trust implicitly, and we work together closely.",
                "5. I am on a mission from my faction to uncover a hidden threat or conspiracy, and I am determined to see it through.",
                "6. I have a rival or adversary within my faction who challenges my position and authority."
            ],
            "Flaws": [
                "1. I am paranoid and suspicious of others, even those within my own faction.",
                "2. I can be ruthless and will do whatever it takes to achieve my faction's goals, even if it means harming innocents.",
                "3. I am secretive to a fault, making it difficult for others to trust me or work with me.",
                "4. I am driven by personal ambition and am willing to undermine or betray my faction if it serves my interests.",
                "5. I have a tendency to hoard information and resources, even when they could be used for the greater good.",
                "6. I am quick to take offense when my faction or loyalty is questioned, leading to confrontations."
            ]
        },
        {
            "Background Name": "Far Traveler",
            "Description": "You come from a distant and foreign land, having traveled far from your homeland to explore new places, cultures, and experiences. Your unique background and customs may seem strange to those you encounter in your new surroundings.",
            "Skill Proficiencies": [ "Insight", "Perception" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A set of traveler's clothes",
                "An emblem or symbol of your homeland",
                "A pouch containing 10 gold pieces",
                "A trinket or token from your homeland",
                "A staff or walking stick"
            ],
            "Feature": "Foreign Contacts",
            "Feature Description": "Your extensive travels and interactions with people from distant lands have granted you a network of foreign contacts. You can call upon these contacts for information, assistance, and shelter when you are in a foreign land or distant region. They may provide you with introductions to locals, guidance on local customs, or even safe places to stay."
        },
        {
            "Personality Traits": [
                "1. I am curious and always eager to learn about new places and cultures.",
                "2. I have a strong sense of wanderlust and am always looking for the next adventure.",
                "3. I am open-minded and accepting of different customs and beliefs.",
                "4. I am adaptable and can easily blend into new environments and social circles.",
                "5. I am proud of my homeland and enjoy sharing stories and traditions from my culture.",
                "6. I can be a bit reserved and introverted, especially when confronted with unfamiliar situations."
            ],
            "Ideals": [
                "1. Freedom: I value personal freedom and believe in the importance of individual autonomy. (Chaotic)",
                "2. Discovery: I am driven by the desire to explore and discover new places, cultures, and knowledge. (Neutral)",
                "3. Harmony: I seek to find common ground and promote harmony among people of different backgrounds. (Good)",
                "4. Adaptability: I believe in the importance of adaptability and the ability to thrive in any environment. (Neutral)",
                "5. Tradition: I am deeply attached to the customs and traditions of my homeland, and I strive to uphold them. (Lawful)",
                "6. Ambition: I am driven by personal ambition and seek to achieve greatness in my travels. (Any)"
            ],
            "Bonds": [
                "1. I have a close friend or ally from my homeland who travels with me and shares my adventures.",
                "2. I have a family member or loved one back in my homeland whom I send money or gifts to regularly.",
                "3. I am on a quest or mission from my homeland, and I am determined to fulfill it no matter what.",
                "4. I am searching for a specific artifact or treasure that is tied to my homeland's history.",
                "5. I have a mentor or teacher from my homeland who guides me in my travels and adventures.",
                "6. I am haunted by a past event or mistake from my homeland, and I am seeking redemption or closure."
            ],
            "Flaws": [
                "1. I can be naive and overly trusting of strangers, often putting myself in risky situations.",
                "2. I have a tendency to romanticize the places I visit and the people I meet, sometimes leading to disappointment.",
                "3. I can be stubborn and resistant to change or new ideas, clinging to the customs of my homeland.",
                "4. I have a short attention span and can become easily distracted by new and shiny things.",
                "5. I am fiercely protective of my homeland's reputation and am quick to defend it, even when it's not necessary.",
                "6. I have a fear of settling down and becoming tied to one place or culture, which can lead to restlessness."
            ]
        },
        {
            "Background Name": "Feylost",
            "Description": "You have a mysterious connection to the Feywild, a realm of enchantment and whimsy. Whether you were born there, stumbled upon a hidden portal, or were touched by fey magic, your life has been forever changed by the Feywild's influence.",
            "Skill Proficiencies": [ "Deception", "Survival" ],
            "Tool Proficiencies": [ "One musical instrument of your choice" ],
            "Languages": [ "Sylvan" ],
            "Starting Equipment": [
                "A musical instrument of your choice",
                "A small trinket or token from the Feywild",
                "A set of traveler's clothes",
                "A pouch containing 10 gold pieces"
            ],
            "Feature": "Fey Presence",
            "Feature Description": "Your connection to the Feywild grants you a unique presence. You can use your Fey Presence to charm or beguile others with an air of enchantment. As an action, you can speak in a captivating manner and choose one creature within 30 feet of you that can hear you. The creature must make a Wisdom saving throw against a DC equal to 8 + your Charisma modifier + your proficiency bonus. On a failed save, the creature is charmed by you for 1 minute or until it takes damage. During this time, the charmed creature regards you as a friendly acquaintance. Once you use this feature, you can't use it again until you finish a short or long rest."
        },
        {
            "Personality Traits": [
                "1. I am whimsical and often see the world through a playful and lighthearted lens.",
                "2. I am inquisitive and always eager to explore the mysteries of the Feywild and other magical realms.",
                "3. I have a mischievous streak and enjoy playing pranks or tricks on others.",
                "4. I am deeply empathetic and can sense the emotions of creatures and plants in the natural world.",
                "5. I have a strong connection to nature and am a staunch protector of the environment.",
                "6. I am dreamy and often lost in thought, experiencing vivid daydreams and fantasies."
            ],
            "Ideals": [
                "1. Freedom: I value personal freedom and believe in the importance of living life without constraints. (Chaotic)",
                "2. Harmony: I seek to bring about harmony and balance in the world, much like the Feywild itself. (Good)",
                "3. Discovery: I am driven by the desire to explore magical realms and uncover hidden mysteries. (Neutral)",
                "4. Playfulness: I believe that life should be filled with joy, laughter, and playful antics. (Chaotic)",
                "5. Conservation: I am dedicated to protecting the natural world and preserving its beauty. (Good)",
                "6. Enchantment: I am drawn to the captivating and enchanting aspects of magic and the Feywild. (Neutral)"
            ],
            "Bonds": [
                "1. I have a close friend or ally from the Feywild who shares my adventures and mysteries.",
                "2. I owe a significant debt to a powerful archfey or fey creature who granted me my unique connection.",
                "3. I am on a quest to uncover the secrets of the Feywild and its impact on the Material Plane.",
                "4. I have a special bond with a magical creature or fey beast that serves as my loyal companion.",
                "5. I am haunted by dreams and visions of the Feywild, which drive me to explore its mysteries.",
                "6. I have a rival or adversary from the Feywild who seeks to thwart my efforts and steal my connection."
            ],
            "Flaws": [
                "1. I can be overly impulsive and prone to making rash decisions, especially when tempted by the Feywild's enchantments.",
                "2. I have a tendency to become lost in the dreamy and whimsical aspects of life, neglecting practical matters.",
                "3. I am easily distracted by the allure of the Feywild, often losing focus on my current goals.",
                "4. I am overly trusting of fey creatures, even when they have mischievous intentions.",
                "5. I can be unpredictable and changeable in my emotions, sometimes swinging from joy to melancholy in an instant.",
                "6. I am fascinated by rare and exotic plants, often stopping to examine and collect them, even in dangerous situations."
            ]
        },
        {
            "Background Name": "Fisher",
            "Description": "You have spent a significant part of your life as a fisher, earning your livelihood from the bounties of rivers, lakes, or the open sea. Your experience on the water has given you a unique set of skills and insights into aquatic life and the trade of fishing.",
            "Skill Proficiencies": [ "History", "Survival" ],
            "Tool Proficiencies": [ "Fishing Tackle" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A set of fishing tackle (fishing rod, fishing line, hooks, and bait)",
                "A net",
                "A set of common clothes",
                "A pouch containing 10 gold pieces"
            ],
            "Feature": "Waterborne Expertise",
            "Feature Description": "You are an expert when it comes to matters related to waterborne activities. You can find food and fresh water for yourself and up to five other people each day, provided that the bodies of water are inhabited by fish or other aquatic creatures. Additionally, you are familiar with the navigation of waterways, including rivers, lakes, and coastal areas, and can guide a boat or ship effectively."
        },
        {
            "Personality Traits": [
                "1. I am patient and calm, even in the face of adversity or long hours of waiting.",
                "2. I have a deep respect for the creatures of the water and never waste what I catch.",
                "3. I am observant and have a keen eye for spotting changes in weather and water conditions.",
                "4. I am a storyteller and enjoy sharing tales of my fishing adventures with others.",
                "5. I am a conservationist and actively support efforts to protect aquatic ecosystems.",
                "6. I am superstitious and have a set of rituals and beliefs related to fishing and the water."
            ],
            "Ideals": [
                "1. Sustainability: I believe in the importance of sustainable fishing practices to ensure the health of aquatic environments. (Good)",
                "2. Independence: I value my freedom and independence, relying on my fishing skills to make a living. (Chaotic)",
                "3. Bounty: I am motivated by the desire for a bountiful catch and the prosperity it brings. (Neutral)",
                "4. Exploration: I seek to explore new waters and discover unknown fishing spots. (Neutral)",
                "5. Harmony: I strive to maintain a harmonious relationship with the water and its inhabitants. (Good)",
                "6. Mastery: I am driven by the pursuit of becoming a master angler, respected by all. (Any)"
            ],
            "Bonds": [
                "1. I have a close friend or family member who taught me the art of fishing and passed down their legacy.",
                "2. I owe a significant debt to a fishing crew or community that supported me in difficult times.",
                "3. I have a special connection with a particular type of aquatic creature, which I consider a good omen for my catches.",
                "4. I am on a quest to find a legendary or elusive fish that is said to bring great fortune to those who catch it.",
                "5. I have a deep respect for a specific body of water or fishing spot, considering it sacred and worthy of protection.",
                "6. I am haunted by memories of a dangerous encounter with a sea creature, which left a lasting scar on my psyche."
            ],
            "Flaws": [
                "1. I can be overly superstitious, allowing irrational beliefs to guide my actions, even to my detriment.",
                "2. I have a short temper when it comes to fishing, becoming easily frustrated when the catch is scarce.",
                "3. I am overly cautious and prone to anxiety, fearing dangerous creatures or storms at sea.",
                "4. I have a tendency to be secretive about my favorite fishing spots, guarding them as if they were treasure troves.",
                "5. I am impulsive and can make rash decisions when faced with opportunities for a big catch.",
                "6. I am fiercely protective of the water and its creatures, and I may react aggressively to those who harm them."
            ]
        },
        {
            "Background Name": "Folk Hero",
            "Description": "You come from a humble background and have gained renown among the common folk for your acts of heroism and selflessness. Your actions have inspired others, and you are a symbol of hope and justice to those in need.",
            "Skill Proficiencies": [ "Animal Handling", "Survival" ],
            "Tool Proficiencies": [ "One type of artisan's tools" ],
            "Languages": [],
            "Starting Equipment": [
                "A set of artisan's tools (one of your choice)",
                "A shovel",
                "An iron pot",
                "A set of common clothes",
                "A pouch containing 10 gold pieces"
            ],
            "Feature": "Rustic Hospitality",
            "Feature Description": "You can find a place to hide, rest, or recuperate among the common folk in rural areas. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you."
        },
        {
            "Personality Traits": [
                "1. I am loyal to my friends and will do anything for them.",
                "2. I always try to see the good in people, even when they do bad things.",
                "3. I can't resist helping those in need, even if it puts me in danger.",
                "4. I am a natural leader and inspire others with my actions and words.",
                "5. I am slow to anger and have a lot of patience.",
                "6. I believe that everyone deserves a second chance."
            ],
            "Ideals": [
                "1. Justice: I strive to right the wrongs and injustices of the world. (Good)",
                "2. Freedom: I believe in the importance of personal freedom and autonomy. (Chaotic)",
                "3. Responsibility: I take responsibility for protecting those who cannot protect themselves. (Lawful)",
                "4. Generosity: I am generous and will give away my last coin to help others in need. (Good)",
                "5. Independence: I value my freedom and independence above all else. (Chaotic)",
                "6. Aspiration: I seek to prove myself as a true hero and make a lasting mark on the world. (Any)"
            ],
            "Bonds": [
                "1. I have a close friend or family member who is still living in the village or town where I grew up.",
                "2. I owe my life to someone who stood up for me when I was in trouble.",
                "3. My hometown is in danger, and I will do whatever it takes to protect it.",
                "4. I have a romantic interest in someone who is unaware of my feelings.",
                "5. I have a deep connection to a specific place in the wilderness or countryside.",
                "6. I am haunted by a past failure or mistake and am driven to make amends for it."
            ],
            "Flaws": [
                "1. I am quick to trust others, even when they have betrayed my trust in the past.",
                "2. I can be naive and gullible, easily falling for tricks or deception.",
                "3. I have a tendency to rush into danger without thinking things through.",
                "4. I am overly protective of my friends and may put their safety above all else.",
                "5. I can be stubborn and resistant to change or new ideas.",
                "6. I have a fear of letting others down and will go to great lengths to avoid disappointment."
            ]
        },
        {
            "Background Name": "Gladiator",
            "Description": "You were once a renowned warrior in the gladiatorial arenas, entertaining crowds with your combat prowess. Whether you fought for your freedom, the glory, or the thrill of battle, your life has been shaped by the arena and the cheers of the crowd.",
            "Skill Proficiencies": [ "Acrobatics", "Performance" ],
            "Tool Proficiencies": [ "One type of gaming set" ],
            "Languages": [],
            "Starting Equipment": [
                "A trinket or token from a fan",
                "A set of common clothes",
                "A belt pouch containing 15 gold pieces"
            ],
            "Feature": "Arena Fame",
            "Feature Description": "You have gained fame and recognition as a gladiator. People in towns and cities with arenas are likely to recognize you, and you can often gain preferential treatment at such establishments. You may also have a fan or supporter who provides you with occasional gifts or assistance."
        },
        {
            "Personality Traits": [
                "1. I am confident and love being the center of attention.",
                "2. I am fiercely competitive and always seek to prove my worth in combat.",
                "3. I am loyal to those who have supported me, be it fans or fellow gladiators.",
                "4. I am a showman and enjoy putting on a good performance, even outside of the arena.",
                "5. I am calm under pressure and rarely let fear or anxiety get the best of me.",
                "6. I have a bit of a temper, especially when it comes to questioning my combat skills."
            ],
            "Ideals": [
                "1. Freedom: I value my freedom above all else and will do whatever it takes to maintain it. (Chaotic)",
                "2. Glory: I am driven by the pursuit of glory and recognition in combat. (Any)",
                "3. Loyalty: I am loyal to my fellow gladiators and will never abandon them in the arena. (Good)",
                "4. Honor: I adhere to a strict code of honor in combat and strive for fair and honorable victories. (Lawful)",
                "5. Thrill: I crave the thrill of battle and seek out ever-greater challenges. (Chaotic)",
                "6. Redemption: I fight to redeem my past and make amends for any wrongs I have committed. (Good)"
            ],
            "Bonds": [
                "1. I have a deep bond with a fellow gladiator who fought by my side and whom I would do anything for.",
                "2. I owe my freedom to a wealthy patron who sponsored my release from the arena.",
                "3. I have a fan who follows my every fight and provides me with support and encouragement.",
                "4. I am on a quest to seek out the legendary gladiatorial master who trained me.",
                "5. I have a rival or adversary from my gladiatorial days, and our rivalry is far from over.",
                "6. I am haunted by memories of a particularly brutal or unfair fight in the arena."
            ],
            "Flaws": [
                "1. I can be arrogant and overconfident, often underestimating my opponents.",
                "2. I have a short fuse and can become hot-headed when provoked.",
                "3. I am obsessed with maintaining my physical prowess and may overexert myself in training.",
                "4. I have a tendency to show off in combat, even when it would be wiser to fight strategically.",
                "5. I am haunted by the scars and trauma of my gladiatorial past, which can lead to nightmares and flashbacks.",
                "6. I can be reckless and impulsive, often diving headfirst into danger without a second thought."
            ]
        },
        {
            "Background Name": "Guild Artisan",
            "Description": "You are a skilled artisan or craftsman, a member of a guild or artisan's organization. You have honed your craft and are well-respected in your trade. Your guild membership has provided you with a network of contacts and a place to call home within a city or town.",
            "Skill Proficiencies": [ "Insight", "Persuasion" ],
            "Tool Proficiencies": [ "One type of artisan's tools" ],
            "Languages": [],
            "Starting Equipment": [
                "A set of artisan's tools (one of your choice)",
                "A letter of introduction from your guild",
                "A set of traveler's clothes",
                "A pouch containing 15 gold pieces"
            ],
            "Feature": "Guild Membership",
            "Feature Description": "You are a member of an artisan's guild, and you can rely on their support and assistance. Your guild will provide you with lodging and food if necessary, and you can receive aid from other guild members in legal and business matters. Your guild might also have a presence in larger cities and towns, which can offer you a place to work and a safe haven."
        },
        {
            "Personality Traits": [
                "1. I take pride in my work and always strive for perfection in my craft.",
                "2. I am a reliable and responsible individual who can be counted on in times of need.",
                "3. I am friendly and outgoing, always eager to make new contacts and expand my network.",
                "4. I am a bit of a perfectionist and can be critical of others' work if it doesn't meet my standards.",
                "5. I have a strong sense of loyalty to my guild and would do anything to protect its reputation.",
                "6. I am a bit of a workaholic, often putting my craft above all else."
            ],
            "Ideals": [
                "1. Community: I believe in the importance of working together and supporting one another. (Good)",
                "2. Mastery: I am dedicated to honing my craft and becoming the best at what I do. (Any)",
                "3. Independence: I value my freedom and autonomy in my work and life. (Chaotic)",
                "4. Ambition: I am driven by the desire for success and recognition in my field. (Any)",
                "5. Tradition: I am deeply attached to the traditions and customs of my guild and trade. (Lawful)",
                "6. Creativity: I strive to push the boundaries of my craft and create something new and innovative. (Any)"
            ],
            "Bonds": [
                "1. I have a close friend or mentor within my guild who has guided and inspired me.",
                "2. I owe a significant debt to my guild for training and support, and I am determined to repay it.",
                "3. I am on a quest to seek out rare materials or techniques that could elevate my craft to new heights.",
                "4. I have a rival within my guild who constantly challenges and pushes me to improve.",
                "5. I have a family member or loved one who is also a member of my guild, and we share a special bond.",
                "6. I am haunted by a mistake or failure in my work that I am determined to redeem."
            ],
            "Flaws": [
                "1. I can be overly critical of others' work, sometimes alienating potential allies or clients.",
                "2. I am a workaholic and may neglect other aspects of my life in pursuit of my craft.",
                "3. I am stubborn and resistant to change, even when new ideas could improve my craft.",
                "4. I have a tendency to become competitive and jealous of others who excel in my field.",
                "5. I am cautious and risk-averse, often hesitant to take on new challenges or opportunities.",
                "6. I can be secretive about my techniques and methods, guarding my craft as a closely held secret."
            ]
        },
        {
            "Background Name": "Guild Merchant",
            "Description": "You are a member of a merchant guild or trading company, a well-established organization that deals in goods, services, and commerce. Your guild provides you with a network of contacts and resources to excel in the world of trade.",
            "Skill Proficiencies": [ "Insight", "Persuasion" ],
            "Tool Proficiencies": [ "One type of artisan's tools" ],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A letter of introduction from your guild",
                "A set of traveler's clothes",
                "A belt pouch containing 15 gold pieces"
            ],
            "Feature": "Guild Membership",
            "Feature Description": "You are a member of a merchant guild, and you can rely on their support and assistance. Your guild will provide you with lodging and food if necessary, and you can receive aid from other guild members in legal and business matters. Your guild might also have a presence in larger cities and towns, which can offer you a place to work and a safe haven.",
            "Personality Traits": [
                "1. I am shrewd and always looking for opportunities to make a profit.",
                "2. I am friendly and outgoing, easily making connections with others in the world of commerce.",
                "3. I am meticulous and pay close attention to details in my business dealings.",
                "4. I am competitive and enjoy the challenge of outsmarting other merchants.",
                "5. I am a patient negotiator, willing to wait for the best deal to come my way.",
                "6. I am a natural networker, always seeking to expand my contacts and business relationships."
            ],
            "Ideals": [
                "1. Prosperity: I seek to accumulate wealth and build a prosperous future. (Any)",
                "2. Fairness: I believe in honest and fair business practices. (Lawful)",
                "3. Ambition: I am driven to achieve success and rise above my competitors. (Any)",
                "4. Independence: I value my freedom and autonomy in the world of trade. (Chaotic)",
                "5. Generosity: I am generous and believe in giving back to those less fortunate. (Good)",
                "6. Innovation: I strive to bring new ideas and products to the market. (Any)"
            ],
            "Bonds": [
                "1. I have a close friend or mentor within my guild who has guided and inspired me.",
                "2. I owe a significant debt to my guild for training and support, and I am determined to repay it.",
                "3. I am on a quest to seek out rare materials or trade opportunities that could benefit my guild.",
                "4. I have a rival or competitor in the world of trade, and our rivalry is far from over.",
                "5. I have a family member or loved one who is also a member of my guild, and we share a special bond.",
                "6. I am haunted by a business deal gone wrong and am determined to set things right."
            ],
            "Flaws": [
                "1. I can be overly cautious and risk-averse, missing out on potentially lucrative opportunities.",
                "2. I am prone to overworking myself, neglecting other aspects of my life in the pursuit of wealth.",
                "3. I can be ruthless and cutthroat in business, sometimes at the expense of ethics and fairness.",
                "4. I have a tendency to hoard wealth and possessions, fearing poverty or loss.",
                "5. I am easily swayed by offers of quick profits, even if they are morally questionable.",
                "6. I can be dismissive of those who are less successful in the world of trade, viewing them as inferior."
            ]
        },
        {
            "Background Name": "Haunted One",
            "Description": "You have a dark and tragic past, haunted by a traumatic event or series of events that continue to haunt you. This past has shaped you into a haunted and brooding individual, but it has also given you unique insights and strengths that others may lack.",
            "Skill Proficiencies": [ "Arcana", "Investigation" ],
            "Tool Proficiencies": [],
            "Languages": [ "Common", "Choose one exotic language from Abyssal, Celestial, Deep Speech, Draconic, Infernal, Primordial, Sylvan, or Undercommon" ],
            "Starting Equipment": [
                "A monster hunter’s pack",
                "A trinket of special significance (choose one or roll on the Gothic Trinkets table)",
                "A set of common clothes",
                "1 silver piece"
            ],
            "Feature": "Heart of Darkness",
            "Feature Description": "Your haunted past gives you a deep understanding of the dark and eerie. You can more easily discern illusions and identify hidden truths. When you make an Investigation check to determine the true nature of an illusion, you can add your proficiency bonus to the check. Additionally, you can communicate in a cryptic manner, leaving your words open to interpretation and causing unease in those who listen.",
            "Personality Traits": [
                "1. I am brooding and often lost in dark thoughts.",
                "2. I am empathetic and always try to help others who are suffering.",
                "3. I am wary of forming close bonds with others, fearing that my past will harm them.",
                "4. I am haunted by recurring nightmares or visions of the traumatic event that shaped me.",
                "5. I am introspective and always seeking answers to the questions that haunt me.",
                "6. I am drawn to the mysteries of the occult and the supernatural."
            ],
            "Ideals": [
                "1. Redemption: I am on a quest to redeem myself and make amends for my past. (Good)",
                "2. Vengeance: I seek revenge against those responsible for my suffering. (Chaotic)",
                "3. Solitude: I prefer to be alone, as my past makes it difficult to trust others. (Neutral)",
                "4. Enlightenment: I seek to understand the dark forces that haunt me and the world. (Any)",
                "5. Empathy: I am driven to help others who suffer as I have. (Good)",
                "6. Freedom: I desire freedom from my past and the shackles of my trauma. (Chaotic)"
            ],
            "Bonds": [
                "1. I am determined to protect the innocent from the horrors that haunt me.",
                "2. I seek revenge against the person or forces that caused my suffering.",
                "3. I have a close friend or family member who still believes in me and supports me.",
                "4. I am on a quest to find answers about the dark forces that haunt me.",
                "5. I have a mentor or ally who understands my plight and aids me in my quest.",
                "6. I am haunted by memories of a loved one who I failed to protect."
            ],
            "Flaws": [
                "1. I am plagued by nightmares and visions of my past, making it hard to trust others.",
                "2. I am obsessed with finding the truth about my haunted past, often to the detriment of other priorities.",
                "3. I have a tendency to push people away, fearing that my darkness will harm them.",
                "4. I am overly cautious and slow to act, haunted by the mistakes of my past.",
                "5. I have a dark side that sometimes surfaces, driven by anger and trauma.",
                "6. I am prone to reckless behavior, seeking to escape the pain of my past."
            ]
        },
        {
            "Background Name": "Hermit",
            "Description": "You have lived a life of seclusion and isolation, seeking wisdom and enlightenment away from the hustle and bustle of society. Your time spent in solitude has granted you unique insights and skills.",
            "Skill Proficiencies": [ "Medicine", "Religion" ],
            "Tool Proficiencies": [],
            "Languages": [ "One of your choice" ],
            "Starting Equipment": [
                "A scroll case stuffed full of notes from your studies or prayers",
                "A winter blanket",
                "A set of common clothes",
                "10 gold pieces"
            ],
            "Feature": "Discovery",
            "Feature Description": "Your long hours of study and meditation have granted you an understanding of a particular field of knowledge or spiritual insight. You can accurately answer questions related to your chosen field, and you have advantage on Intelligence (Religion) checks made to recall information about deities, religious traditions, holy symbols, and the like.",
            "Personality Traits": [
                "1. I am a recluse who prefers solitude and quiet contemplation.",
                "2. I am kind and compassionate, always willing to offer a helping hand to those in need.",
                "3. I am curious and eager to learn more about the world beyond my hermitage.",
                "4. I am distrustful of authority and institutions, preferring to rely on my own judgment.",
                "5. I am wise and patient, rarely reacting impulsively to situations.",
                "6. I have a peculiar habit or quirk that makes me stand out in social situations."
            ],
            "Ideals": [
                "1. Solitude: I value my isolation and seek to preserve it. (Neutral)",
                "2. Enlightenment: I am on a quest for spiritual and intellectual enlightenment. (Any)",
                "3. Charity: I believe in helping others and giving back to the world. (Good)",
                "4. Independence: I value my freedom and autonomy above all else. (Chaotic)",
                "5. Wisdom: I believe in the power of knowledge and wisdom to guide us. (Lawful)",
                "6. Simplicity: I prefer a simple and unadorned life, free from materialistic desires. (Neutral)"
            ],
            "Bonds": [
                "1. I have a mentor or teacher who guided me in my hermitage and to whom I owe a great debt.",
                "2. I am on a quest to seek out a particular piece of ancient knowledge or a lost relic.",
                "3. I have a deep connection to a natural location, such as a forest, cave, or mountaintop, where I found solitude and enlightenment.",
                "4. I have a vision or prophecy that I believe will come to pass, and I am working to fulfill it.",
                "5. I have a family member or loved one from whom I became estranged during my time of seclusion, and I seek to reconnect with them.",
                "6. I am haunted by a mysterious event or phenomenon from my time of isolation, and I aim to uncover the truth behind it."
            ],
            "Flaws": [
                "1. I can be socially awkward and have difficulty relating to others.",
                "2. I am set in my ways and resistant to change or new ideas.",
                "3. I can be overly cautious, hesitating to take risks or step out of my comfort zone.",
                "4. I have a tendency to withdraw from social situations and avoid interaction with others.",
                "5. I am prone to eccentric or idiosyncratic behavior that can be off-putting to others.",
                "6. I can be overly critical of those who do not share my values or beliefs."
            ]
        },
        {
            "Background Name": "House Agent",
            "Description": "You have sworn fealty to a dragonmarked house. If you have a dragonmark, you're likely a member of one of the house's influential families; otherwise, you're an outsider who hopes to make your fortune through the house. Your main task is to serve as the eyes of your house, but you could be called on at any time to act as its hand. Such missions can be perilous but lucrative.",
            "Skill Proficiencies": [ "Investigation", "Persuasion" ],
            "Tool Proficiencies": [],
            "Languages": [],
            "Starting Equipment": [
                "A set of fine clothes",
                "The signet ring of your house",
                "Identification papers",
                "A purse containing 20 gold pieces"
            ],
            "Feature": "House Connection",
            "Feature Description": "As an agent of your house, you can always get food and lodging for yourself and your friends at a house enclave. When the house assigns you a mission, it will usually provide you with the necessary supplies and transportation. Beyond this, you have many old friends, mentors, and rivals in your house, and you may encounter one of them when you interact with a house business. The degree to which such acquaintances are willing to help you depends on your current standing in your house.",
            "Personality Traits": [
                "1. I'm always looking to improve efficiency.",
                "2. I love to share trivia about my house's business.",
                "3. I never forget an insult against me or my house.",
                "4. I'm enthusiastic about everything my house does.",
                "5. I represent my house and take pride in my looks.",
                "6. I'm critical of monarchies and limits on the houses."
            ],
            "Ideals": [
                "1. Common Good. My house serves a vital function, and its prosperity will help everyone. (Good)",
                "2. Tradition. I uphold traditions of my house and bring honor to my family. (Lawful)",
                "3. Innovation. Abandon old traditions and find better ways to do things. (Chaotic)",
                "4. Power. I want to ensure the prosperity of my house and wield its power myself. (Evil)",
                "5. Discovery. I want to learn all I can, both for my house and for my own curiosity. (Any)",
                "6. Comfort. I want to ensure that me and mine enjoy the best things in life. (Any)"
            ],
            "Bonds": [
                "1. My house is my family. I would do anything for it.",
                "2. I love someone from another house, but the relationship is forbidden.",
                "3. Someone I love was killed by a rival faction within my house, and I will have revenge.",
                "4. I don't care about the house as a whole, but I would do anything for my old mentor.",
                "5. My house must evolve, and I'll lead the evolution.",
                "6. I'm determined to impress the leaders of my house and to become a leader myself."
            ],
            "Flaws": [
                "1. I'm fixated on following official protocols.",
                "2. I'm obsessed with conspiracy theories and worried about secret societies and hidden demons.",
                "3. My house and bloodline make me the best!",
                "4. My secret could get me expelled from my house.",
                "5. My religious beliefs aren't widespread in my house.",
                "6. I'm working for a hidden faction in my house that gives me secret assignments."
            ]
        },
        {
            "Background Name": "Knight",
            "Description": "You have been trained as a knight, a noble warrior skilled in combat, chivalry, and the service of a lord or lady. You have pledged your loyalty to a liege lord and serve as their trusted champion.",
            "Skill Proficiencies": [ "History", "Persuasion" ],
            "Tool Proficiencies": [],
            "Languages": [],
            "Starting Equipment": [
                "A set of fine clothes",
                "A signet ring or emblem of your knighthood",
                "A scroll or document proving your status as a knight",
                "A purse containing 25 gold pieces"
            ],
            "Feature": "Knightly Regard",
            "Feature Description": "As a knight, you command respect and admiration from those who respect the traditions of chivalry. You can usually gain an audience with nobles and other high-ranking officials, and people are more likely to be helpful and courteous when dealing with you.",
            "Personality Traits": [
                "1. I am unfailingly loyal to my liege lord and will defend them with my life.",
                "2. I take great pride in my chivalrous conduct and strive to be a model of honor and courtesy.",
                "3. I am fearless in the face of danger and never back down from a challenge.",
                "4. I am driven by a strong sense of duty to protect the weak and uphold justice.",
                "5. I have a strong competitive spirit and enjoy proving my skill and valor in combat.",
                "6. I am deeply religious and believe that my actions are guided by divine purpose."
            ],
            "Ideals": [
                "1. Loyalty. I would lay down my life for my liege lord and uphold their cause. (Lawful)",
                "2. Honor. I adhere to a strict code of chivalry and conduct myself with integrity. (Lawful)",
                "3. Justice. I seek to right wrongs and protect the innocent from harm. (Good)",
                "4. Glory. I crave fame and recognition for my valor and deeds in battle. (Any)",
                "5. Ambition. I am determined to rise in status and power, regardless of the means. (Any)",
                "6. Faith. I serve a higher power and believe in the divine purpose of my actions. (Any)"
            ],
            "Bonds": [
                "1. My loyalty to my liege lord is unwavering, and I would do anything to fulfill their wishes.",
                "2. I have a close-knit group of fellow knights, and we share a bond of brotherhood and camaraderie.",
                "3. I am haunted by a past failure or dishonor and seek to redeem myself in the eyes of my peers.",
                "4. I have a duty to protect and care for a specific noble family or person, and I take this duty seriously.",
                "5. I am on a quest to prove my worthiness and earn a legendary reputation as a knight.",
                "6. I have a deep respect for the traditions and history of knighthood and strive to uphold them."
            ],
            "Flaws": [
                "1. I can be overly rigid in my adherence to chivalric codes, even when it is not practical.",
                "2. I have a tendency to be overly critical of those who do not meet the standards of honor and virtue.",
                "3. I am prone to recklessness in battle, seeking glory at any cost.",
                "4. I can be quick to anger when my honor or the honor of my liege lord is insulted.",
                "5. I have a deep-seated fear of failure and will go to great lengths to avoid it.",
                "6. I am haunted by past battles and the lives I have taken, leading to inner turmoil."
            ]
        },
        {
            "Background Name": "Noble",
            "Description": "You were born into a noble family, and you are accustomed to the privileges and responsibilities of noble life. You have connections, wealth, and a sense of entitlement that comes from your social status.",
            "Skill Proficiencies": [ "History", "Persuasion" ],
            "Tool Proficiencies": [],
            "Languages": [],
            "Starting Equipment": [
                "A set of fine clothes",
                "A signet ring or emblem of your family's crest",
                "A scroll of pedigree or lineage",
                "A purse containing 25 gold pieces"
            ],
            "Feature": "Position of Privilege",
            "Feature Description": "Thanks to your noble birth, people are inclined to be helpful and courteous to you. You can usually gain access to influential people and high society events, and you can secure audiences with nobles and political leaders. Common folk tend to defer to you, and you can often get away with minor infractions due to your status.",
            "Personality Traits": [
                "1. I am accustomed to the finest things in life and expect to be treated accordingly.",
                "2. I am polite and courteous to all, regardless of their station, and expect the same in return.",
                "3. I am protective of my family's honor and reputation and will not tolerate insults.",
                "4. I enjoy the power and influence that my noble status grants me and use it to my advantage.",
                "5. I am inquisitive about the lives and cultures of common folk, and I enjoy mingling with them.",
                "6. I have a deep sense of responsibility to my family and will do whatever it takes to uphold our name."
            ],
            "Ideals": [
                "1. Responsibility. I must fulfill my family's duties and uphold our traditions. (Lawful)",
                "2. Noblesse Oblige. I have a duty to protect and care for those less fortunate than myself. (Good)",
                "3. Ambition. I seek to increase my family's power and wealth at any cost. (Any)",
                "4. Tradition. I adhere to the customs and values of my noble heritage. (Lawful)",
                "5. Power. I strive to attain and wield as much influence as possible. (Evil)",
                "6. Freedom. I reject the constraints of my noble birth and seek personal freedom. (Chaotic)"
            ],
            "Bonds": [
                "1. My family's honor is everything to me, and I would do anything to protect it.",
                "2. I have a deep and abiding loyalty to a childhood friend or a loyal servant.",
                "3. My family has a longstanding feud with another noble house, and I seek to settle the score.",
                "4. I am in love with a commoner, and our love is forbidden by society.",
                "5. I owe a life debt to a commoner who once saved my life.",
                "6. I am on a personal quest to prove my worthiness and distinguish myself from my family's name."
            ],
            "Flaws": [
                "1. I can be condescending and patronizing to those of lower social status.",
                "2. I am quick to anger when my honor or family's honor is insulted.",
                "3. I am bound by tradition and reluctant to embrace change or new ideas.",
                "4. I am a spendthrift and often indulge in extravagance and luxury.",
                "5. I am naive about the hardships faced by common people and their struggles.",
                "6. I am prone to jealousy and envy when others receive attention or accolades."
            ]
        },
        {
            "Background Name": "Outlander",
            "Description": "You grew up in the wilds, far from civilization, and you have survived and thrived in the natural world. You are at home in the untamed wilderness and have learned to live off the land.",
            "Skill Proficiencies": [ "Athletics", "Survival" ],
            "Tool Proficiencies": [],
            "Languages": [],
            "Starting Equipment": [
                "A staff",
                "A hunting trap",
                "A set of traveler's clothes",
                "A belt pouch containing 10 gold pieces"
            ],
            "Feature": "Wanderer",
            "Feature Description": "You have an excellent memory for maps and geography. You can always recall the general layout of terrain, settlements, and other features around you. In addition, you can find food and fresh water for yourself and up to five other people each day, provided the land offers such resources.",
            "Personality Traits": [
                "1. I am fiercely independent and value my freedom above all else.",
                "2. I am curious about the world beyond the wilderness and am eager to explore it.",
                "3. I have a deep respect for the natural world and its creatures.",
                "4. I am slow to trust people from civilization, but once trust is earned, I am loyal.",
                "5. I enjoy the thrill of the hunt and the challenges of survival.",
                "6. I am wary of the trappings of civilization and prefer a simple, rustic life."
            ],
            "Ideals": [
                "1. Nature. The natural world is sacred, and I must protect it. (Good)",
                "2. Independence. I value freedom and self-reliance above all else. (Chaotic)",
                "3. Community. I seek to build a close-knit community in the wilderness. (Lawful)",
                "4. Survival. Life is harsh, and I must do whatever it takes to endure. (Neutral)",
                "5. Dominance. The strongest rule the wilds, and I must prove my strength. (Evil)",
                "6. Discovery. I am driven to explore new lands and uncover their secrets. (Any)"
            ],
            "Bonds": [
                "1. I am dedicated to protecting my homeland from threats and invaders.",
                "2. I have a close bond with the animals and creatures of the wilderness.",
                "3. I owe a debt to a wise hermit or guide who taught me survival skills.",
                "4. I am searching for a legendary location or hidden treasure in the wilderness.",
                "5. I have a family or tribe that I am determined to reunite with.",
                "6. I am on a quest to uncover the truth about a natural phenomenon or mystery."
            ],
            "Flaws": [
                "1. I have a deep-seated fear of cities and crowded places.",
                "2. I am uncomfortable with modern technology and inventions from civilization.",
                "3. I have a tendency to be blunt and direct in my interactions with others.",
                "4. I am fiercely protective of my territory and can become hostile to intruders.",
                "5. I have difficulty understanding or relating to the customs and norms of civilization.",
                "6. I am slow to forgive those who harm the natural world or its creatures."
            ]
        },
        {
            "Background Name": "Sage",
            "Description": "You are a scholar, researcher, or academic who has dedicated your life to the pursuit of knowledge. You have spent years studying and accumulating information in various fields of expertise.",
            "Skill Proficiencies": [ "Arcana", "History" ],
            "Tool Proficiencies": [],
            "Languages": [],
            "Starting Equipment": [
                "A letter of introduction from a university or academic institution",
                "A book of lore or a tome of knowledge",
                "A set of common clothes",
                "A belt pouch containing 10 gold pieces"
            ],
            "Feature": "Researcher",
            "Feature Description": "You have access to a vast network of academic contacts, and you can reach out to fellow scholars and experts for information and assistance. You can spend time in libraries or universities to gain access to valuable research materials and archives.",
            "Personality Traits": [
                "1. I am constantly seeking to expand my knowledge and understanding.",
                "2. I am eager to share my expertise with others and enjoy educating them.",
                "3. I can be absent-minded and preoccupied with my thoughts and research.",
                "4. I am often seen as eccentric or unconventional in my thinking and behavior.",
                "5. I am driven by a thirst for discovery and solving mysteries.",
                "6. I tend to be skeptical and demand evidence before accepting claims or theories."
            ],
            "Ideals": [
                "1. Knowledge. The pursuit of knowledge is the highest goal in life. (Neutral)",
                "2. Discovery. I am driven to uncover hidden truths and mysteries. (Any)",
                "3. Wisdom. I use my knowledge to guide and help others. (Good)",
                "4. Power. Knowledge is power, and I seek to wield it for my own gain. (Evil)",
                "5. Curiosity. I am endlessly curious and seek to learn about everything. (Chaotic)",
                "6. Innovation. I strive to create new knowledge and push the boundaries of understanding. (Any)"
            ],
            "Bonds": [
                "1. I have a mentor or teacher who greatly influenced my intellectual development.",
                "2. I am searching for a rare and ancient tome of knowledge that holds the key to a great secret.",
                "3. I am dedicated to preserving and protecting valuable knowledge from being lost or destroyed.",
                "4. I have a deep respect for a particular deity or patron of knowledge.",
                "5. I have a close-knit group of fellow scholars and researchers who are like family to me.",
                "6. I am on a quest to unravel a great mystery or solve a complex puzzle."
            ],
            "Flaws": [
                "1. I can become obsessed with my research and neglect other aspects of life.",
                "2. I am often oblivious to social cues and norms, leading to awkward interactions.",
                "3. I can be dismissive of those who are not as knowledgeable or intelligent as I am.",
                "4. I am easily frustrated when faced with ignorance or incompetence.",
                "5. I have a tendency to overanalyze situations and see complexity where it may not exist.",
                "6. I am secretive and protective of my research, even to the point of paranoia."
            ]
        },
        {
            "Background Name": "Sailor",
            "Description": "You are an experienced sailor who has spent a significant part of your life aboard ships. Whether a pirate, merchant sailor, or naval crew member, the sea is your home, and you're skilled in the ways of maritime life.",
            "Skill Proficiencies": [ "Athletics", "Perception" ],
            "Tool Proficiencies": [ "Navigator's Tools", "Vehicles (Water)" ],
            "Languages": [],
            "Starting Equipment": [
                "A belaying pin (club)",
                "50 feet of silk rope",
                "A lucky charm (trinket)",
                "A set of common clothes",
                "A belt pouch containing 10 gold pieces"
            ],
            "Feature": "Ship's Passage",
            "Feature Description": "You can secure free passage aboard a sailing ship for yourself and your companions. You are also able to gain work as a crew member on a ship or receive discounts on passage fares when traveling by sea.",
            "Personality Traits": [
                "1. I am accustomed to hard work and don't shy away from manual labor.",
                "2. I enjoy the camaraderie of a ship's crew and easily make friends with fellow sailors.",
                "3. I have a strong sense of duty and discipline instilled by life at sea.",
                "4. I am superstitious and have many sailor's beliefs and rituals.",
                "5. I am quick to tell sea stories and embellish my experiences for dramatic effect.",
                "6. I have a deep love for the sea and can spend hours gazing at its expanse."
            ],
            "Ideals": [
                "1. Freedom. The open sea represents true freedom, and I long for adventure and independence. (Chaotic)",
                "2. Loyalty. I would never abandon my shipmates or crew, no matter the danger. (Good)",
                "3. Ambition. I seek to rise through the ranks and become a respected captain one day. (Any)",
                "4. Tradition. I adhere to the customs and superstitions of sailors. (Lawful)",
                "5. Adventure. Life as a sailor is a thrilling and endless adventure. (Chaotic)",
                "6. Wealth. I am driven by the desire for riches and treasure. (Any)"
            ],
            "Bonds": [
                "1. My ship and its crew are like family to me, and I would do anything for them.",
                "2. I have a sworn enemy or rival among pirates, sailors, or naval officers.",
                "3. I am searching for a lost ship or a legendary maritime artifact.",
                "4. I have a loved one or family waiting for my return from sea, and I must provide for them.",
                "5. I am haunted by a shipwreck or maritime disaster in which I lost comrades.",
                "6. I owe a life debt to a fellow sailor who saved my life at sea."
            ],
            "Flaws": [
                "1. I have a tendency to be overly superstitious and fearful of ill omens.",
                "2. I can be reckless and prone to taking unnecessary risks, especially during storms or battles at sea.",
                "3. I am quick to anger when faced with insubordination or disrespect on a ship.",
                "4. I am haunted by memories of a shipwreck or naval battle in which I lost comrades.",
                "5. I have difficulty trusting those who are not fellow sailors and often view outsiders with suspicion.",
                "6. I have a fear of drowning or a deep aversion to underwater environments."
            ]
        },
        {
            "Background Name": "Shipwright",
            "Description": "You have sailed into war on the decks of great ships, patching their hulls with soup bowls and prayers. You once helped build a fishing vessel that single-handedly saved a town from starvation. You have seen a majestic prow in your dreams that you have not been able to replicate in wood. Since childhood, you have loved the water and have been captivated by the many vessels that travel on it.",
            "Skill Proficiencies": [ "History", "Perception" ],
            "Tool Proficiencies": [ "Carpenter's Tools", "Vehicles (Water)" ],
            "Languages": [],
            "Starting Equipment": [
                "A set of well-loved carpenter's tools",
                "A blank book",
                "1 ounce of ink",
                "An ink pen",
                "A set of traveler's clothes",
                "A leather pouch with 10 gold pieces"
            ],
            "Feature": "I'll patch it!",
            "Feature Description": "Provided you have carpenter's tools and wood, you can perform repairs on a water vehicle. When you use this ability, you restore a number of hit points to the hull of a water vehicle equal to 5 × your proficiency modifier. A vehicle cannot be patched by you in this way again until after it has been pulled ashore and fully repaired.",
            "Life at Sea": [
                "Grand Designs. You are working on plans and schematics for a new, very fast ship. You must examine as many different kinds of vessels as possible to help ensure the success of your design.",
                "Solid and Sound. You patched up a war galley and prevented it from sinking. The local navy regards you as a friend.",
                "Favored. You insisted on thicker planking for a merchant vessel's hull, which saved it from sinking when it smashed against a reef. You have a standing invitation to visit the merchant's distant mansion.",
                "Master of Armaments. You specialized in designing and mounting defenses for the navy. You easily recognize and determine the quality of such items.",
                "Low Places. You have contacts in the smuggling outfits along the coast; you occasionally repair the criminals' ships in exchange for coin and favors.",
                "Mysteries of the Deep. You experienced an encounter with a possibly divine being while sailing alone. Work with your DM to determine the secret about the deep waters of the sea that this entity revealed to you."
            ],
            "Personality Traits": [
                "1. I love talking and being heard more than I like to listen.",
                "2. I'm extremely fond of puzzles.",
                "3. I thrive under pressure.",
                "4. I love sketching and designing objects, especially boats.",
                "5. I'm not afraid of hard work—in fact, I prefer it.",
                "6. A pipe, an ale, and the smell of the sea: paradise.",
                "7. I have an endless supply of cautionary tales related to the sea.",
                "8. I don't mind getting my hands dirty."
            ],
            "Ideals": [
                "1. Crew. If everyone on deck pitches in, we'll never sink. (Good)",
                "2. Careful Lines. A ship must be balanced according to the laws of the universe. (Lawful)",
                "3. Invention. Make what you need out of whatever is at hand. (Chaotic)",
                "4. Perfection. To measure a being and find it lacking is the greatest disappointment. (Evil)",
                "5. Reflection. Muddied water always clears in time. (Any)",
                "6. Hope. The horizon at sea holds the greatest promise. (Any)"
            ],
            "Bonds": [
                "1. I must visit all the oceans of the world and behold the ships that sail there.",
                "2. Much of the treasure I claim will be used to enrich my community.",
                "3. I must find a kind of wood rumored to possess magical qualities.",
                "4. I repair broken things to redeem what's broken in myself.",
                "5. I will craft a boat capable of sailing through the most dangerous of storms.",
                "6. A kraken destroyed my masterpiece; its teeth shall adorn my hearth."
            ],
            "Flaws": [
                "1. I don't know when to throw something away. You never know when it might be useful again.",
                "2. I get frustrated to the point of distraction by shoddy craftsmanship.",
                "3. Though I am an excellent crafter, my work tends to look as though it belongs on a ship.",
                "4. I am so obsessed with sketching my ideas for elaborate inventions that I sometimes forget little things like eating and sleeping.",
                "5. I'm judgmental of those who are not skilled with tools of some kind.",
                "6. I sometimes take things that don't belong to me, especially if they are very well made."
            ]
        },
        {
            "Background Name": "Soldier",
            "Description": "You are a trained and disciplined soldier who has served in a military organization or militia. You are well-versed in combat tactics and are accustomed to a life of discipline, drills, and warfare.",
            "Skill Proficiencies": [ "Athletics", "Intimidation" ],
            "Tool Proficiencies": [],
            "Languages": [],
            "Starting Equipment": [
                "An insignia of rank",
                "A trophy taken from a fallen enemy (such as a severed finger, belt, or emblem)",
                "A set of bone dice or a deck of cards",
                "A set of common clothes",
                "A belt pouch containing 10 gold pieces"
            ],
            "Feature": "Military Rank",
            "Feature Description": "You have a military rank from your career as a soldier. Soldiers loyal to your former military organization still recognize your authority, and they might defer to your rank. You can gain access to military encampments and fortresses where your rank is recognized.",
            "Personality Traits": [
                "1. I am fiercely loyal to my comrades and would do anything to protect them.",
                "2. I have a strong sense of duty and responsibility, and I take my orders seriously.",
                "3. I am disciplined and focused, and I don't easily succumb to fear or panic.",
                "4. I enjoy the thrill of battle and find it exhilarating.",
                "5. I am deeply committed to upholding the values and principles of my military organization.",
                "6. I can be gruff and stoic, and I often prefer action to words."
            ],
            "Ideals": [
                "1. Duty. I will follow orders and serve my country without question. (Lawful)",
                "2. Honor. I will uphold the values and traditions of my military organization. (Good)",
                "3. Loyalty. My comrades are like family, and I will protect them at all costs. (Lawful)",
                "4. Courage. I will never back down from a fight, no matter the odds. (Chaotic)",
                "5. Freedom. I fight for the cause of liberty and against tyranny. (Chaotic)",
                "6. Glory. I seek fame, recognition, and a legacy of heroic deeds. (Any)"
            ],
            "Bonds": [
                "1. I have a deep bond with my fellow soldiers, and we share a strong camaraderie.",
                "2. I have a family back home that I must protect and provide for.",
                "3. My loyalty to my commanding officer knows no bounds, and I would follow them anywhere.",
                "4. I am haunted by a traumatic event from my military service that I cannot forget.",
                "5. I am on a quest to redeem a past failure or dishonor.",
                "6. I have a personal rivalry or vendetta against an enemy officer or foe."
            ],
            "Flaws": [
                "1. I have difficulty adjusting to civilian life and often feel lost or out of place.",
                "2. I am haunted by the memories of battles and violence, and I have nightmares.",
                "3. I can be overly rigid and uncompromising in my beliefs and principles.",
                "4. I have a short temper and can become easily angered or aggressive.",
                "5. I struggle with authority figures who do not share my military background.",
                "6. I find it hard to trust others who have not proven themselves in combat."
            ]
        },
        {
            "Background Name": "Spy",
            "Description": "You are a covert operative skilled in espionage, infiltration, and subterfuge. You have spent years working in the shadows, gathering information, and carrying out covert missions for a secretive organization or government agency.",
            "Skill Proficiencies": [ "Deception", "Stealth" ],
            "Tool Proficiencies": [ "Forgery Kit", "Disguise Kit" ],
            "Languages": [],
            "Starting Equipment": [
                "A set of common clothes suitable for blending into urban environments",
                "A disguise kit",
                "A forgery kit",
                "A small knife",
                "A belt pouch containing 15 gold pieces"
            ],
            "Feature": "Covert Operative",
            "Feature Description": "You have a network of contacts and informants in the world of espionage. You can use this network to gather information, gain access to secure locations, and receive assistance from other spies or operatives when needed.",
            "Personality Traits": [
                "1. I am always cautious and alert, even in seemingly safe situations.",
                "2. I have a knack for blending into crowds and going unnoticed.",
                "3. I am skilled at reading people and can quickly determine their intentions.",
                "4. I am comfortable lying and deceiving others to achieve my goals.",
                "5. I am highly adaptable and can quickly adjust to new environments and situations.",
                "6. I have a strong sense of duty and loyalty to my organization."
            ],
            "Ideals": [
                "1. Loyalty. I am unwaveringly loyal to my organization and will do whatever it takes to protect its secrets. (Lawful)",
                "2. Freedom. I fight for the cause of freedom and against oppressive regimes and organizations. (Chaotic)",
                "3. Self-Preservation. My primary goal is to survive and thrive in the dangerous world of espionage. (Neutral)",
                "4. Justice. I seek to uncover and expose corruption, wrongdoing, and injustice. (Good)",
                "5. Power. I desire to gain personal power and influence through my actions as a spy. (Evil)",
                "6. Knowledge. I value information and seek to uncover hidden truths and mysteries. (Any)"
            ],
            "Bonds": [
                "1. I have a mentor or handler who taught me the ways of espionage and to whom I owe a debt of gratitude.",
                "2. I have a deep cover identity that I must protect at all costs.",
                "3. I have a loved one or family member who is unaware of my life as a spy, and I must keep it a secret to protect them.",
                "4. I have a longstanding rivalry with another spy or operative who always seems to be one step ahead of me.",
                "5. I have a mission or objective that I have been pursuing for years, and I will not rest until it is accomplished.",
                "6. I have a connection to a powerful and secretive organization that can provide me with resources and support."
            ],
            "Flaws": [
                "1. I am paranoid and constantly suspicious of others, even my allies.",
                "2. I am haunted by the moral compromises I have made in the name of espionage.",
                "3. I have a tendency to go to extreme measures to maintain my cover and complete my missions.",
                "4. I struggle with trust issues and find it difficult to open up to others.",
                "5. I am known to disappear suddenly and without warning, leaving my allies in the dark.",
                "6. I have made many enemies in the world of espionage, and they are always looking for a chance to exact revenge."
            ]
        },
        {
            "Background Name": "Tinkerer",
            "Description": "You have a natural aptitude for tinkering, invention, and working with machines. Whether you're an inventor, a repair expert, or a creative gadgeteer, you are skilled in crafting and modifying mechanical devices.",
            "Skill Proficiencies": [ "Investigation", "Sleight of Hand" ],
            "Tool Proficiencies": [ "Tinker's Tools" ],
            "Languages": [],
            "Starting Equipment": [
                "A set of tinker's tools",
                "A small collection of spare parts and gears",
                "A set of common clothes",
                "A belt pouch containing 10 gold pieces"
            ],
            "Feature": "Inventor's Insight",
            "Feature Description": "You have a knack for understanding and working with mechanical devices. You can attempt to repair or modify mechanical devices with a successful Intelligence (Investigation) check, and you can identify the functions and potential uses of unfamiliar mechanical devices.",
            "Personality Traits": [
                "1. I am endlessly curious and always eager to take things apart to see how they work.",
                "2. I am a problem solver and enjoy finding creative solutions to challenges.",
                "3. I have a tendency to get lost in my thoughts and forget about the world around me.",
                "4. I am passionate about my inventions and can become obsessed with perfecting them.",
                "5. I enjoy sharing my knowledge and teaching others about the wonders of technology.",
                "6. I can be absent-minded and forgetful, especially when I'm engrossed in a project."
            ],
            "Ideals": [
                "1. Innovation. I strive to push the boundaries of technology and create new inventions. (Chaotic)",
                "2. Precision. I believe that every machine should be finely tuned and perfectly crafted. (Lawful)",
                "3. Curiosity. I am driven by a relentless desire to explore and understand the mysteries of the world. (Neutral)",
                "4. Empowerment. I use my inventions to help those in need and make the world a better place. (Good)",
                "5. Profit. I am in it for the money and will do whatever it takes to turn a profit from my creations. (Neutral)",
                "6. Mastery. I seek to become the greatest tinkerer and inventor in the world. (Any)"
            ],
            "Bonds": [
                "1. My greatest invention is a work in progress, and I am determined to complete it someday.",
                "2. I have a mentor or a fellow tinkerer who taught me the art of invention.",
                "3. I am on a quest to find a rare and elusive piece of technology or ancient mechanical artifact.",
                "4. I have a deep connection to a particular type of machine, and I treat it like a loyal companion.",
                "5. I am haunted by a past invention that went terribly wrong and caused harm to others.",
                "6. I have a rival tinkerer who constantly challenges and inspires me to improve."
            ],
            "Flaws": [
                "1. I can be easily distracted by new and shiny technology, often losing track of time.",
                "2. I tend to underestimate the danger of experimenting with dangerous machines and volatile substances.",
                "3. I have a tendency to overcomplicate simple tasks, making things more complicated than they need to be.",
                "4. I can be overly critical of others' work and struggle to accept help or collaborate with others.",
                "5. I have a habit of taking apart perfectly functional machines just to see how they work.",
                "6. I am secretive about my inventions and reluctant to share my discoveries with others."
            ]
        }
    ]
}