{
    "Backgrounds": [
        {
            "Background Name": "Tinkerer",
            "Description": "You have a natural aptitude for tinkering, invention, and working with machines. Whether you're an inventor, a repair expert, or a creative gadgeteer, you are skilled in crafting and modifying mechanical devices.",
            "Skill Proficiencies": [ "Investigation", "Sleight of Hand" ],
            "Tool Proficiencies": [ "Tinker's Tools" ],
            "Languages": [],
            "Starting Equipment": [
                "A set of tinker's tools",
                "A small collection of spare parts and gears",
                "A set of common clothes",
                "A belt pouch containing 10 gold pieces"
            ],
            "Feature": "Inventor's Insight",
            "Feature Description": "You have a knack for understanding and working with mechanical devices. You can attempt to repair or modify mechanical devices with a successful Intelligence (Investigation) check, and you can identify the functions and potential uses of unfamiliar mechanical devices."
        }
    ],
    "Personality Traits": [
        "1. I am endlessly curious and always eager to take things apart to see how they work.",
        "2. I am a problem solver and enjoy finding creative solutions to challenges.",
        "3. I have a tendency to get lost in my thoughts and forget about the world around me.",
        "4. I am passionate about my inventions and can become obsessed with perfecting them.",
        "5. I enjoy sharing my knowledge and teaching others about the wonders of technology.",
        "6. I can be absent-minded and forgetful, especially when I'm engrossed in a project."
    ],
    "Ideals": [
        "1. Innovation. I strive to push the boundaries of technology and create new inventions. (Chaotic)",
        "2. Precision. I believe that every machine should be finely tuned and perfectly crafted. (Lawful)",
        "3. Curiosity. I am driven by a relentless desire to explore and understand the mysteries of the world. (Neutral)",
        "4. Empowerment. I use my inventions to help those in need and make the world a better place. (Good)",
        "5. Profit. I am in it for the money and will do whatever it takes to turn a profit from my creations. (Neutral)",
        "6. Mastery. I seek to become the greatest tinkerer and inventor in the world. (Any)"
    ],
    "Bonds": [
        "1. My greatest invention is a work in progress, and I am determined to complete it someday.",
        "2. I have a mentor or a fellow tinkerer who taught me the art of invention.",
        "3. I am on a quest to find a rare and elusive piece of technology or ancient mechanical artifact.",
        "4. I have a deep connection to a particular type of machine, and I treat it like a loyal companion.",
        "5. I am haunted by a past invention that went terribly wrong and caused harm to others.",
        "6. I have a rival tinkerer who constantly challenges and inspires me to improve."
    ],
    "Flaws": [
        "1. I can be easily distracted by new and shiny technology, often losing track of time.",
        "2. I tend to underestimate the danger of experimenting with dangerous machines and volatile substances.",
        "3. I have a tendency to overcomplicate simple tasks, making things more complicated than they need to be.",
        "4. I can be overly critical of others' work and struggle to accept help or collaborate with others.",
        "5. I have a habit of taking apart perfectly functional machines just to see how they work.",
        "6. I am secretive about my inventions and inventions and reluctant to share my discoveries with others."
    ]
}

