{
    "Backgrounds": [
        {
            "Background Name": "Guild Artisan",
            "Description": "You are a skilled artisan or craftsman, a member of a guild or artisan's organization. You have honed your craft and are well-respected in your trade. Your guild membership has provided you with a network of contacts and a place to call home within a city or town.",
            "Skill Proficiencies": [ "Insight", "Persuasion" ],
            "Tool Proficiencies": [ "One type of artisan's tools" ],
            "Languages": [],
            "Starting Equipment": [
                "A set of artisan's tools (one of your choice)",
                "A letter of introduction from your guild",
                "A set of traveler's clothes",
                "A pouch containing 15 gold pieces"
            ],
            "Feature": "Guild Membership",
            "Feature Description": "You are a member of an artisan's guild, and you can rely on their support and assistance. Your guild will provide you with lodging and food if necessary, and you can receive aid from other guild members in legal and business matters. Your guild might also have a presence in larger cities and towns, which can offer you a place to work and a safe haven."
        }
    ],
    "Personality Traits": [
        "1. I take pride in my work and always strive for perfection in my craft.",
        "2. I am a reliable and responsible individual who can be counted on in times of need.",
        "3. I am friendly and outgoing, always eager to make new contacts and expand my network.",
        "4. I am a bit of a perfectionist and can be critical of others' work if it doesn't meet my standards.",
        "5. I have a strong sense of loyalty to my guild and would do anything to protect its reputation.",
        "6. I am a bit of a workaholic, often putting my craft above all else."
    ],
    "Ideals": [
        "1. Community: I believe in the importance of working together and supporting one another. (Good)",
        "2. Mastery: I am dedicated to honing my craft and becoming the best at what I do. (Any)",
        "3. Independence: I value my freedom and autonomy in my work and life. (Chaotic)",
        "4. Ambition: I am driven by the desire for success and recognition in my field. (Any)",
        "5. Tradition: I am deeply attached to the traditions and customs of my guild and trade. (Lawful)",
        "6. Creativity: I strive to push the boundaries of my craft and create something new and innovative. (Any)"
    ],
    "Bonds": [
        "1. I have a close friend or mentor within my guild who has guided and inspired me.",
        "2. I owe a significant debt to my guild for training and support, and I am determined to repay it.",
        "3. I am on a quest to seek out rare materials or techniques that could elevate my craft to new heights.",
        "4. I have a rival within my guild who constantly challenges and pushes me to improve.",
        "5. I have a family member or loved one who is also a member of my guild, and we share a special bond.",
        "6. I am haunted by a mistake or failure in my work that I am determined to redeem."
    ],
    "Flaws": [
        "1. I can be overly critical of others' work, sometimes alienating potential allies or clients.",
        "2. I am a workaholic and may neglect other aspects of my life in pursuit of my craft.",
        "3. I am stubborn and resistant to change, even when new ideas could improve my craft.",
        "4. I have a tendency to become competitive and jealous of others who excel in my field.",
        "5. I am cautious and risk-averse, often hesitant to take on new challenges or opportunities.",
        "6. I can be secretive about my techniques and methods, guarding my craft as a closely held secret."
    ]
}

