{
    "id": "clan_crafter_background",
    "BackgroundId": "clan_crafter",
    "Background Name": "Clan Crafter",
    "Description": "You are a skilled artisan, craftsman, or artisanal worker who hails from a close-knit clan or guild known for its exceptional craftsmanship. Whether you are a blacksmith, jeweler, stonemason, or another type of craftsman, your skills are highly valued by your clan, and you take pride in your work.",
    "Skill Proficiencies": [
        "History",
        "Insight"
    ],
    "Languages": [
        "Dwarvish or one other language of your choice"
    ],
    "Starting Equipment": [
        "A set of artisan's tools related to your craft (e.g., smith's tools, jeweler's tools, mason's tools)",
        "A set of traveler's clothes",
        "A symbol of your clan or guild",
        "A belt pouch containing 15 gold pieces"
    ],
    "Feature": "Artisan's Expertise",
    "Feature Description": "Your expertise in your craft allows you to create high-quality items and repairs. You can craft mundane items of your chosen craft at half the time and cost. Additionally, you have an extensive knowledge of materials and craftsmanship, making you a valuable resource when evaluating the quality and authenticity of items.",
    "Personality Traits": [
        "1. I take great pride in my craft and always strive for perfection in my work.",
        "2. I am patient and methodical, willing to spend hours on a single piece to ensure its quality.",
        "3. I am deeply loyal to my clan or guild and will do anything to protect its reputation.",
        "4. I am always curious about new materials and techniques and am eager to learn from others.",
        "5. I can be quite reserved and stoic, preferring to let my work speak for me.",
        "6. I enjoy sharing stories and legends of my clan's craftsmanship with others."
    ],
    "Ideals": [
        "1. Tradition: I value the traditional ways of my clan and strive to preserve our ancient craft. (Lawful)",
        "2. Excellence: I am driven to achieve excellence in my work and create masterpieces that will be admired for generations. (Any)",
        "3. Innovation: I am always seeking new ways to improve my craft and push the boundaries of what is possible. (Chaotic)",
        "4. Community: I believe in the power of a close-knit clan or guild and the support it provides to its members. (Good)",
        "5. Ambition: I seek to gain recognition and fame beyond my clan's borders and establish my own legacy. (Any)",
        "6. Artistry: I see my craft as a form of art, and I aim to create pieces that evoke emotions and inspire others. (Any)"
    ],
    "Bonds": [
        "1. My clan or guild is like family to me, and I would do anything to protect its interests.",
        "2. I owe a significant debt of gratitude to a mentor who taught me everything I know about my craft.",
        "3. I have a rival craftsman from a competing clan or guild, and our rivalry is a driving force in my life.",
        "4. I have taken an apprentice, and I am dedicated to passing on my knowledge and skills to the next generation.",
        "5. I have a deep connection to a particular material or gemstone, and I am always on the lookout for it in my travels.",
        "6. I have uncovered a long-lost technique or secret of my craft, and I am determined to master it."
    ],
    "Flaws": [
        "1. I can be overly critical of others' work, often finding fault where others see excellence.",
        "2. I am fiercely competitive and will go to great lengths to prove the superiority of my clan's craftsmanship.",
        "3. I can become obsessed with my work, neglecting personal relationships and other responsibilities.",
        "4. I am stubborn and resistant to change, even when new techniques or ideas could improve my craft.",
        "5. I have a tendency to hoard rare materials and items related to my craft, sometimes to the detriment of others.",
        "6. I am quick to take offense when my clan's honor or craftsmanship is questioned, leading to confrontations."
    ],
    "_rid": "LHEfAISGtYYPAAAAAAAAAA==",
    "_self": "dbs/LHEfAA==/colls/LHEfAISGtYY=/docs/LHEfAISGtYYPAAAAAAAAAA==/",
    "_etag": "\"5500463f-0000-1100-0000-6739f4f00000\"",
    "_attachments": "attachments/",
    "_ts": 1731851504
}