{
    "id": "criminal_background",
    "BackgroundId": "criminal",
    "Background Name": "Criminal",
    "Description": "You have a history of illicit activities and are well-versed in the ways of crime. Whether you were a thief, a burglar, or a member of an organized crime syndicate, you are skilled at navigating the underworld and evading the law.",
    "Skill Proficiencies": [
        "Deception",
        "Stealth"
    ],
    "Tool Proficiencies": [
        "Thieves' Tools"
    ],
    "Starting Equipment": [
        "A crowbar",
        "A set of dark common clothes including a hood",
        "A pouch containing 15 gold pieces",
        "A dagger",
        "A token to remember your parents or another trinket of sentimental value"
    ],
    "Feature": "Criminal Contact",
    "Feature Description": "You have a reliable and well-informed contact within the criminal underworld. This contact can provide you with information about illegal activities, help you find fences for stolen goods, and introduce you to other criminals. You can also use this contact to arrange meetings with criminal allies or gather information about specific criminal activities.",
    "Personality Traits": [
        "1. I am street-smart and always on the lookout for danger in my surroundings.",
        "2. I have a quick wit and a silver tongue, making it easy for me to talk my way out of trouble.",
        "3. I am loyal to my criminal associates and would never betray them.",
        "4. I am a risk-taker and love the thrill of danger and excitement.",
        "5. I am fiercely independent and don't like taking orders from others.",
        "6. I am resourceful and can find creative solutions to problems."
    ],
    "Ideals": [
        "1. Freedom: I value my independence and will do whatever it takes to maintain it. (Chaotic)",
        "2. Loyalty: I am fiercely loyal to my criminal crew and would do anything for them. (Neutral)",
        "3. Greed: I am motivated by wealth and am willing to do whatever it takes to get rich. (Evil)",
        "4. Ambition: I have big plans and am willing to climb the criminal ladder to achieve them. (Any)",
        "5. Revenge: I seek revenge against a specific person or organization that wronged me. (Chaotic)",
        "6. Survival: I do whatever it takes to survive in a dangerous world. (Neutral)"
    ],
    "Bonds": [
        "1. I have a family member or loved one who is unaware of my criminal activities, and I want to protect them from the truth.",
        "2. I owe a significant debt to a powerful crime lord, and I must repay it to stay alive.",
        "3. I have a close friend or ally from my criminal past who I trust implicitly.",
        "4. I have a rival or nemesis in the criminal underworld, and our rivalry is a driving force in my life.",
        "5. I am on the run from the law, constantly evading capture and staying one step ahead of the authorities.",
        "6. I am haunted by a past crime or betrayal that still weighs on my conscience."
    ],
    "Flaws": [
        "1. I can be ruthless and will do whatever it takes to achieve my criminal goals, even if it means harming others.",
        "2. I have a short temper and can become violent when provoked or frustrated.",
        "3. I am paranoid and constantly looking over my shoulder, fearing that my past will catch up with me.",
        "4. I have a tendency to trust too easily, making me vulnerable to betrayal by my criminal associates.",
        "5. I am superstitious and believe in omens and signs, often making decisions based on irrational fears.",
        "6. I can be overconfident in my abilities and often underestimate my enemies."
    ],
    "_rid": "LHEfAISGtYYSAAAAAAAAAA==",
    "_self": "dbs/LHEfAA==/colls/LHEfAISGtYY=/docs/LHEfAISGtYYSAAAAAAAAAA==/",
    "_etag": "\"5500844c-0000-1100-0000-6739f5df0000\"",
    "_attachments": "attachments/",
    "_ts": 1731851743
}