{
    "id": "knight_background",
    "BackgroundId": "knight",
    "Background Name": "Knight",
    "Description": "You have been trained as a knight, a noble warrior skilled in combat, chivalry, and the service of a lord or lady. You have pledged your loyalty to a liege lord and serve as their trusted champion.",
    "Skill Proficiencies": [
        "History",
        "Persuasion"
    ],
    "Tool Proficiencies": [],
    "Languages": [],
    "Starting Equipment": [
        "A set of fine clothes",
        "A signet ring or emblem of your knighthood",
        "A scroll or document proving your status as a knight",
        "A purse containing 25 gold pieces"
    ],
    "Feature": "Knightly Regard",
    "Feature Description": "As a knight, you command respect and admiration from those who respect the traditions of chivalry. You can usually gain an audience with nobles and other high-ranking officials, and people are more likely to be helpful and courteous when dealing with you.",
    "Personality Traits": [
        "1. I am unfailingly loyal to my liege lord and will defend them with my life.",
        "2. I take great pride in my chivalrous conduct and strive to be a model of honor and courtesy.",
        "3. I am fearless in the face of danger and never back down from a challenge.",
        "4. I am driven by a strong sense of duty to protect the weak and uphold justice.",
        "5. I have a strong competitive spirit and enjoy proving my skill and valor in combat.",
        "6. I am deeply religious and believe that my actions are guided by divine purpose."
    ],
    "Ideals": [
        "1. Loyalty. I would lay down my life for my liege lord and uphold their cause. (Lawful)",
        "2. Honor. I adhere to a strict code of chivalry and conduct myself with integrity. (Lawful)",
        "3. Justice. I seek to right wrongs and protect the innocent from harm. (Good)",
        "4. Glory. I crave fame and recognition for my valor and deeds in battle. (Any)",
        "5. Ambition. I am determined to rise in status and power, regardless of the means. (Any)",
        "6. Faith. I serve a higher power and believe in the divine purpose of my actions. (Any)"
    ],
    "Bonds": [
        "1. My loyalty to my liege lord is unwavering, and I would do anything to fulfill their wishes.",
        "2. I have a close-knit group of fellow knights, and we share a bond of brotherhood and camaraderie.",
        "3. I am haunted by a past failure or dishonor and seek to redeem myself in the eyes of my peers.",
        "4. I have a duty to protect and care for a specific noble family or person, and I take this duty seriously.",
        "5. I am on a quest to prove my worthiness and earn a legendary reputation as a knight.",
        "6. I have a deep respect for the traditions and history of knighthood and strive to uphold them."
    ],
    "Flaws": [
        "1. I can be overly rigid in my adherence to chivalric codes, even when it is not practical.",
        "2. I have a tendency to be overly critical of those who do not meet the standards of honor and virtue.",
        "3. I am prone to recklessness in battle, seeking glory at any cost.",
        "4. I can be quick to anger when my honor or the honor of my liege lord is insulted.",
        "5. I have a deep-seated fear of failure and will go to great lengths to avoid it.",
        "6. I am haunted by past battles and the lives I have taken, leading to inner turmoil."
    ],
    "_rid": "LHEfAISGtYYgAAAAAAAAAA==",
    "_self": "dbs/LHEfAA==/colls/LHEfAISGtYY=/docs/LHEfAISGtYYgAAAAAAAAAA==/",
    "_etag": "\"550001d1-0000-1100-0000-6739ff580000\"",
    "_attachments": "attachments/",
    "_ts": 1731854168
}