{
    "Class Name": "Barbarian",
    "Hit Dice": "1d12 per barbarian level",
    "At 1st Level": "12 + your Constitution modifier",
    "At Higher Levels": "1d12 (or 7) + your Constitution modifier per barbarian level after 1st",
    "Armor": "Light armor, medium armor, shields",
    "Weapons": "Simple weapons, martial weapons",
    "Tools": "None",
    "Saving Throws": "Strength, Constitution",
    "Skills": "Choose two from Animal Handling, Athletics, Intimidation, Nature, Perception, and Survival",
    "Equipment": [
        "(a) a greataxe or (b) any martial melee weapon",
        "(a) two handaxes or (b) any simple weapon",
        "An explorer's pack and four javelins"
    ],
    "Class Features": [
        {
            "Level": 1,
            "Class Feature": "Rage",
            "Class Feature Description": [
                "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.",
                "While raging, you gain the following benefits if you aren’t wearing heavy armor:",
                "- You have advantage on Strength checks and Strength saving throws.",
                "- When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.",
                "- You have resistance to bludgeoning, piercing, and slashing damage.",
                "If you are able to cast spells, you can’t cast them or concentrate on them while raging.",
                "Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.",
                "You can use this feature a number of times as shown for your barbarian level in the Rages column of the Barbarian table. You regain one expended use of Rage after each Short Rest.",
                "Rage can be maintained by using a Bonus Action or by forcing an enemy to make a saving throw."
            ]
        },
        {
            "Level": 1,
            "Class Feature": "Weapon Mastery",
            "Class Feature Description": [
                "Choose two melee weapons. You gain use of their mastery properties.",
                "You may change your chosen weapons each long rest.",
                "Gain access to more mastery properties as you level up."
            ]
        },
        {
            "Level": 1,
            "Class Feature": "Unarmored Defense",
            "Class Feature Description": [
                "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
            ]
        },
        {
            "Level": 2,
            "Class Feature": "Reckless Attack",
            "Class Feature Description": [
                "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
            ]
        },
        {
            "Level": 2,
            "Class Feature": "Danger Sense",
            "Class Feature Description": [
                "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger.",
                "You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. You no longer need to see or hear effects to gain advantage on Dexterity saving throws."
            ]
        },
        {
            "Level": 3,
            "Class Feature": "Primal Knowledge",
            "Class Feature Description": [
                "Starting at 3rd level, you gain proficiency in a Barbarian skill of your choice.",
                "You can replace the typical ability score with Strength when making certain skill checks when your Rage is active."
            ]
        },
        {
            "Level": 3,
            "Class Feature": "Barbarian Subclass",
            "Class Feature Description": [
                "At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker, the Path of the Totem Warrior, the Path of the Wild Heart, the Path of the World Tree, or the Path of the Zealot, all detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
                "Path of the Berserker: Frenzy now deals extra damage instead of giving extra attacks and no longer provides Exhaustion.",
                "Path of the Wild Heart: Choices are balanced and streamlined, and can be changed out each time you Rage or after a Long Rest.",
                "Path of the World Tree (New): A whole new Barbarian subclass that draws power from the multiversal tree, Yggdrasil.",
                "Path of the Zealot: Focus has been shifted to staying alive, rather than being easier to resurrect."
            ]
        },
        {
            "Level": 4,
            "Class Feature": "Ability Score Improvement",
            "Class Feature Description": [
                "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
            ]
        },
        {
            "Level": 5,
            "Class Feature": "Extra Attack",
            "Class Feature Description": [
                "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
            ]
        },
        {
            "Level": 5,
            "Class Feature": "Fast Movement",
            "Class Feature Description": [
                "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor."
            ]
        },
        {
            "Level": 6,
            "Class Feature": "Subclass Feature",
            "Class Feature Description": [
                "Gain a feature from your Barbarian archetype."
            ]
        },
        {
            "Level": 7,
            "Class Feature": "Feral Instinct",
            "Class Feature Description": [
                "By 7th level, your instincts are so honed that you have advantage on initiative rolls.",
                "Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
                "You can no longer act while surprised, even if you enter Rage."
            ]
        },
        {
            "Level": 7,
            "Class Feature": "Instinctive Pounce",
            "Class Feature Description": [
                "At 7th level, as part of the bonus action you take to enter your rage, you can move up to half your speed."
            ]
        },
        {
            "Level": 9,
            "Class Feature": "Brutal Strike (replaces Brutal Critical)",
            "Class Feature Description": [
                "Starting at 9th level, you can trade off advantage when using Reckless Attack to inflict more damage and a debuff when you hit."
            ]
        },
        {
            "Level": 10,
            "Class Feature": "Subclass Feature",
            "Class Feature Description": [
                "Gain a feature from your Barbarian archetype."
            ]
        },
        {
            "Level": 11,
            "Class Feature": "Relentless Rage",
            "Class Feature Description": [
                "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
                "When you drop to 0 hit points while your Rage is active, you can instead heal for a number of hit points equal to twice your Barbarian level."
            ]
        },
        {
            "Level": 12,
            "Class Feature": "Ability Score Improvement",
            "Class Feature Description": [
                "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
            ]
        },
        {
            "Level": 13,
            "Class Feature": "Improved Brutal Strike",
            "Class Feature Description": [
                "Starting at 13th level, you get more options to inflict with your Brutal Strike feature."
            ]
        },
        {
            "Level": 14,
            "Class Feature": "Subclass Feature",
            "Class Feature Description": [
                "Gain a feature from your Barbarian archetype."
            ]
        },
        {
            "Level": 15,
            "Class Feature": "Persistent Rage",
            "Class Feature Description": [
                "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
                "Once per long rest, regain all uses of Rage if you roll Initiative and have none."
            ]
        },
        {
            "Level": 16,
            "Class Feature": "Ability Score Improvement",
            "Class Feature Description": [
                "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
            ]
        },
        {
            "Level": 17,
            "Class Feature": "Improved Brutal Strike",
            "Class Feature Description": [
                "Starting at 17th level, your Brutal Strike now deals 2d10 damage and you can use two different effects when you hit."
            ]
        },
        {
            "Level": 18,
            "Class Feature": "Indomitable Might",
            "Class Feature Description": [
                "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
                "Now includes Strength saving throws."
            ]
        },
        {
            "Level": 19,
            "Class Feature": "Epic Boon",
            "Class Feature Description": [
                "At 19th level, you receive one of twelve Epic Boons or another feat."
            ]
        },
        {
            "Level": 20,
            "Class Feature": "Primal Champion",
            "Class Feature Description": [
                "At 20th level, your limit for Strength and Constitution is now 25."
            ]
        }
    ]
}
