{
    "Class Name": "Fighter",
    "HitDice": "1d10 per fighter level",
    "HitPoints": {
        "At 1st Level": "10 + your Constitution modifier",
        "At Higher Levels": "1d10 (or 6) + your Constitution modifier per fighter level after 1st"
    },
    "Proficiencies": {
        "Armor": "All armor, shields",
        "Weapons": "Simple weapons, martial weapons",
        "Tools": "None",
        "Saving Throws": "Strength, Constitution",
        "Skills": "Choose two skills from Acrobatics, Animal Handling, Athletics, History, Insight, Intimidation, Perception, and Survival"
    },
    "Starting Equipment": [
        "(a) chain mail or (b) leather, longbow, and 20 arrows",
        "(a) a martial weapon and a shield or (b) two martial weapons",
        "(a) a light crossbow and 20 bolts or (b) two handaxes",
        "(a) a dungeoneer's pack or (b) an explorer's pack"
    ],
    "Fighting Styles": [
        {
            "Archery": "You gain a +2 bonus to attack rolls you make with ranged weapons."
        },
        {
            "BlindFighting": "You have blindsight with a range of 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you."
        },
        {
            "Defense": "While you are wearing armor, you gain a +1 bonus to AC."
        },
        {
            "Dueling": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
        },
        {
            "GreatWeaponFighting": "When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit."
        },
        {
            "Interception": "When a creature you can see hits a target, other than you, within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by 1d10 + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction."
        },
        {
            "Protection": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
        },
        {
            "SuperiorTechnique": "You learn one maneuver of your choice from among those available to the Battle Master archetype. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice.)\n\nYou gain one superiority die, which is a d6 (this die is added to any superiority dice you have from another source). This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest."
        },
        {
            "ThrownWeaponFighting": "You can draw a weapon that has the thrown property as part of the attack you make with the weapon.\n\nIn addition, when you hit with a ranged attack using a thrown weapon, you gain a +2 bonus to the damage roll."
        },
        {
            "TwoWeaponFighting": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
        },
        {
            "UnarmedFighting": "Your unarmed strikes can deal bludgeoning damage equal to 1d6 + your Strength modifier on a hit. If you aren't wielding any weapons or a shield when you make the attack roll, the d6 becomes a d8.\n\nAt the start of each of your turns, you can deal 1d4 bludgeoning damage to one creature grappled by you."
        },
        {
            "CloseQuartersShooter": "When making a ranged attack while you are within 5 feet of a hostile creature, you do not have disadvantage on the attack roll. Your ranged attacks ignore half cover and three-quarters cover against targets within 30 feet of you. You have a +1 bonus to attack rolls on ranged attacks."
        },
        {
            "Mariner": "As long as you are not wearing heavy armor or using a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to armor class."
        },
        {
            "TunnelFighter": "As a bonus action, you can enter a defensive stance that lasts until the start of your next turn. While in your defensive stance, you can make opportunity attacks without using your reaction, and you can use your reaction to make a melee attack against a creature that moves more than 5 feet while within your reach."
        }
    ],
    "Class Features": [
        {
            "Level": 1,
            "Feature": "Second Wind",
            "Description": [
                "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again.",
                "Gain more uses of Second Wind as you level up."
            ]
        },
        {
            "Level": 1,
            "Feature": "Weapon Mastery",
            "Description": [
                "Choose three weapons. You gain use of their mastery properties.",
                "You may change your chosen weapons each Long Rest.",
                "Gain access to more mastery properties as you level up."
            ]
        },
        {
            "Level": 2,
            "Feature": "Tactical Mind",
            "Description": [
                "Expend a use of Second Wind to add 1d10 to a failed ability check. If you still fail, the use of Second Wind isn’t expended."
            ]
        },
        {
            "Level": 2,
            "Feature": "Action Surge",
            "Description": [
                "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action."
            ]
        },
        {
            "Level": 3,
            "Feature": "Martial Archetype",
            "Description": [
                "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level.",
                {
                    "Class Archetypes": [
                        "Arcane Archer",
                        "Banneret",
                        "Battle Master",
                        "Cavalier",
                        "Champion",
                        "Echo Knight",
                        "Eldritch Knight",
                        "Psi Warrior",
                        "Rune Knight",
                        "Samurai"
                    ]
                }
            ]
        },
        {
            "Level": 4,
            "Feature": "Ability Score Improvement",
            "Description": [
                "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
            ]
        },
        {
            "Level": 5,
            "Feature": "Extra Attack",
            "Description": [
                "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
                "The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
            ]
        },
        {
            "Level": 5,
            "Feature": "Tactical Shift",
            "Description": [
                "Move half your Speed without provoking Opportunity Attacks when you use Second Wind as a Bonus Action."
            ]
        },
        {
            "Level": 6,
            "Feature": "Ability Score Improvement"
        },
        {
            "Level": 7,
            "Feature": "Martial Archetype",
            "Description": [
                "Your Martial Archetype grants you a feature at 7th level."
            ]
        },
        {
            "Level": 8,
            "Feature": "Ability Score Improvement"
        },
        {
            "Level": 9,
            "Feature": "Indomitable",
            "Description": [
                "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.",
                "You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level.",
                "Add your Fighter level to rerolls made with Indomitable."
            ]
        },
        {
            "Level": 9,
            "Feature": "Tactical Master",
            "Description": [
                "Replace a weapon’s mastery property with Push, Sap, or Slow for that attack."
            ]
        },
        {
            "Level": 10,
            "Feature": "Martial Archetype",
            "Description": [
                "Your Martial Archetype grants you a feature at 10th level."
            ]
        },
        {
            "Level": 12,
            "Feature": "Ability Score Improvement"
        },
        {
            "Level": 13,
            "Feature": "Indomitable",
            "Description": [
                "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.",
                "You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level.",
                "Add your Fighter level to rerolls made with Indomitable."
            ]
        },
        {
            "Level": 13,
            "Feature": "Studied Attacks",
            "Description": [
                "Get Advantage on attacks against a target creature after you miss an attack."
            ]
        },
        {
            "Level": 14,
            "Feature": "Ability Score Improvement"
        },
        {
            "Level": 15,
            "Feature": "Martial Archetype",
            "Description": [
                "Your Martial Archetype grants you a feature at 15th level."
            ]
        },
        {
            "Level": 16,
            "Feature": "Ability Score Improvement"
        },
        {
            "Level": 17,
            "Feature": "Indomitable",
            "Description": [
                "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.",
                "You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level.",
                "Add your Fighter level to rerolls made with Indomitable."
            ]
        },
        {
            "Level": 18,
            "Feature": "Martial Archetype",
            "Description": [
                "Your Martial Archetype grants you a feature at 18th level."
            ]
        },
        {
            "Level": 19,
            "Feature": "Ability Score Improvement"
        },
        {
            "Level": 19,
            "Feature": "Epic Boon",
            "Description": [
                "At 19th level, you choose one Epic Boon feat or another feat of your choice."
            ]
        },
        {
            "Level": 20,
            "Feature": "Extra Attack",
            "Description": [
                "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
                "The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
            ]
        }
    ]
}
