{
    "Class Name": "Druid",
    "Hit Dice": "1d8 per druid level",
    "Hit Points": {
        "At 1st Level": "8 + your Constitution modifier",
        "At Higher Levels": "1d8 (or 5) + your Constitution modifier per druid level after 1st"
    },
    "Proficiencies": {
        "Armor": "Light armor, medium armor, shields (druids will not wear armor or use shields made of metal)",
        "Weapons": "Clubs, daggers, darts, javelins, maces, quarterstaffs, scimitars, sickles, slings, spears",
        "Tools": "Herbalism kit",
        "Saving Throws": "Intelligence, Wisdom",
        "Skills": "Choose two from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival"
    },
    "Starting Equipment": [
        "(a) a wooden shield or (b) any simple weapon",
        "(a) a scimitar or (b) any simple melee weapon",
        "(a) a explorer's pack or (b) a druid's pack"
    ],
    "Class Features": [
        {
            "Level": 1,
            "Feature": "Spellcasting",
            "Description": "The Druid Spell List has been revised and expanded."
        },
        {
            "Level": 1,
            "Feature": "Druidic",
            "Description": "You gain proficiency with the Herbalism kit. You also learn the Druidic language, which allows you to understand the language and the script used by druids. Additionally, you can speak with animals."
        },
        {
            "Level": 1,
            "Feature": "Primal Order",
            "Description": "At 1st level, you choose a Primal Order that shapes your connection to the natural world, granting you features at 2nd, 6th, 10th, and 14th levels. Choose from the following options:"
        },
        {
            "Level": 2,
            "Feature": "Wild Shape",
            "Description": "Starting at 2nd level, you can use your Wild Shape as a bonus action. Additionally, while in beast form during Wild Shape, you can speak using your own voice, even if the beast form cannot normally speak."
        },
        {
            "Level": 2,
            "Feature": "Wild Companion",
            "Description": "You can use your Wild Shape feature to cast Find Familiar as a ritual."
        },
        {
            "Level": 3,
            "Feature": "Druid Subclass",
            "Description": "At 3rd level, you choose a circle that binds you to the natural world, shaping your spellcasting and granting you features. Choose from the following circles:"
        },
        {
            "Level": 5,
            "Feature": "Wild Resurgence",
            "Description": "Starting at 5th level, you can expend a spell slot to regain one use of Wild Shape. Additionally, you can expend a use of Wild Shape to restore one level 1 spell slot during a long rest."
        },
        {
            "Level": 7,
            "Feature": "Elemental Fury",
            "Description": "At 7th level, you choose between Potent Spellcasting or Primal Strike. Potent Spellcasting allows you to add your Wisdom modifier to the damage dealt by your Druid cantrips. Primal Strike allows your attacks to deal an extra 1d8 Cold, Fire, Lightning, or Thunder damage once per turn."
        },
        {
            "Level": 18,
            "Feature": "Beast Spells",
            "Description": "Starting at 18th level, you can cast spells while in Wild Shape form."
        },
        {
            "Level": 19,
            "Feature": "Epic Boon",
            "Description": "At 19th level, you receive one Epic Boon feat or another feat of your choice."
        },
        {
            "Level": 20,
            "Feature": "Archdruid",
            "Description": "At 20th level, you regain one expended use of Wild Shape when you roll initiative, if you have no uses of Wild Shape remaining. Additionally, you can spend a spell slot once per day to regain one use of Wild Shape."
        }
    ]
}
