{
    "7thLevelBardSpells": [
        {
            "Name": "Arcane Sword",
            "School": "Evocation",
            "Description": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration."
        },
        {
            "Name": "Etherealness",
            "School": "Transmutation",
            "Description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell."
        },
        {
            "Name": "Forcecage",
            "School": "Evocation",
            "Description": "An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range."
        },
        {
            "Name": "Magnificent Mansion",
            "School": "Conjuration",
            "Description": "You conjure an extradimensional dwelling in range that lasts for the duration. You choose where its one entrance is located."
        },
        {
            "Name": "Mirage Arcane",
            "School": "Illusion",
            "Description": "You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain."
        },
        {
            "Name": "Project Image",
            "School": "Illusion",
            "Description": "You create an illusory duplicate of yourself that lasts for the duration."
        },
        {
            "Name": "Regenerate",
            "School": "Transmutation",
            "Description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points."
        },
        {
            "Name": "Resurrection",
            "School": "Necromancy",
            "Description": "You touch a dead creature that has been dead for no more than a century, that didn't die of old age, and that isn't undead."
        },
        {
            "Name": "Symbol",
            "School": "Abjuration",
            "Description": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph."
        },
        {
            "Name": "Teleport",
            "School": "Conjuration",
            "Description": "This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select."
        }
    ]
}
