{
    "WizardLevel1Spells": [
        {
            "Name": "Alarm",
            "School": "Abjuration",
            "Description": "You set an alarm against unwanted intrusion."
        },
        {
            "Name": "Burning Hands",
            "School": "Evocation",
            "Description": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips."
        },
        {
            "Name": "Charm Person",
            "School": "Enchantment",
            "Description": "You attempt to charm a humanoid you can see within range."
        },
        {
            "Name": "Color Spray",
            "School": "Illusion",
            "Description": "A dazzling array of flashing, colored light springs from your hand."
        },
        {
            "Name": "Comprehend Languages",
            "School": "Divination",
            "Description": "For the duration, you understand the literal meaning of any spoken language that you hear."
        },
        {
            "Name": "Detect Magic",
            "School": "Divination",
            "Description": "For the duration, you sense the presence of magic within 30 feet of you."
        },
        {
            "Name": "Disguise Self",
            "School": "Illusion",
            "Description": "You make yourself—including your clothing, armor, weapons, and other belongings on your person—look different until the spell ends."
        },
        {
            "Name": "Expeditious Retreat",
            "School": "Transmutation",
            "Description": "This spell allows you to move at an incredible pace."
        },
        {
            "Name": "False Life",
            "School": "Necromancy",
            "Description": "Bolstering yourself with a necromantic facsimile of life, you gain 1d4 + 4 temporary hit points for the duration."
        },
        {
            "Name": "Feather Fall",
            "School": "Transmutation",
            "Description": "Choose up to five falling creatures within range."
        },
        {
            "Name": "Find Familiar",
            "School": "Conjuration",
            "Description": "You gain the service of a familiar, a spirit that takes an animal form you choose."
        },
        {
            "Name": "Floating Disk",
            "School": "Conjuration",
            "Description": "This spell creates a circular, horizontal plane of force, 3 feet in diameter and 1 inch thick."
        },
        {
            "Name": "Fog Cloud",
            "School": "Conjuration",
            "Description": "You create a 20-foot-radius sphere of fog centered on a point within range."
        },
        {
            "Name": "Grease",
            "School": "Conjuration",
            "Description": "Slick grease covers the ground in a 10-foot square centered on a point within range."
        },
        {
            "Name": "Hideous Laughter",
            "School": "Enchantment",
            "Description": "The creature of your choice that you can see within range perceives everything as hilariously funny and falls into fits of laughter."
        },
        {
            "Name": "Identify",
            "School": "Divination",
            "Description": "You choose one object that you must touch throughout the casting of the spell."
        },
        {
            "Name": "Illusory Script",
            "School": "Illusion",
            "Description": "You write on parchment, paper, or some other suitable writing material and imbue it with a potent illusion that lasts for the duration."
        },
        {
            "Name": "Jump",
            "School": "Transmutation",
            "Description": "You touch a creature. The creature's jump distance is tripled until the spell ends."
        },
        {
            "Name": "Longstrider",
            "School": "Transmutation",
            "Description": "You touch a creature. The target's speed increases by 10 feet until the spell ends."
        },
        {
            "Name": "Mage Armor",
            "School": "Abjuration",
            "Description": "You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends."
        },
        {
            "Name": "Magic Missile",
            "School": "Evocation",
            "Description": "You create three glowing darts of magical force."
        },
        {
            "Name": "Protection from Evil and Good",
            "School": "Abjuration",
            "Description": "Until the spell ends, one willing creature you touch is protected against certain types of creatures."
        },
        {
            "Name": "Shield",
            "School": "Abjuration",
            "Description": "An invisible barrier of magical force appears and protects you."
        },
        {
            "Name": "Silent Image",
            "School": "Illusion",
            "Description": "You create the image of an object, a creature, or some other visible phenomenon."
        },
        {
            "Name": "Sleep",
            "School": "Enchantment",
            "Description": "This spell sends creatures into a magical slumber."
        },
        {
            "Name": "Thunderwave",
            "School": "Evocation",
            "Description": "A wave of thunderous force sweeps out from you."
        },
        {
            "Name": "Unseen Servant",
            "School": "Conjuration",
            "Description": "This spell creates an invisible, mindless, shapeless force that performs simple tasks at your command until the spell ends."
        }
    ]
}
