{
    "Archetype Name": "The Archfey",
    "Archetype Abilities": [
        {
            "Archetype Ability": "Expanded Spell List",
            "Archetype Ability Description": [
                "The Archfey lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
                {
                    "Archfey Expanded Spells": [
                        {
                            "Spell Level": "1st",
                            "Spells": [
                                "Faerie Fire",
                                "Sleep"
                            ]
                        },
                        {
                            "Spell Level": "2nd",
                            "Spells": [
                                "Calming Emotions",
                                "Phantasmal Force"
                            ]
                        },
                        {
                            "Spell Level": "3rd",
                            "Spells": [
                                "Blink",
                                "Plant Growth"
                            ]
                        },
                        {
                            "Spell Level": "4th",
                            "Spells": [
                                "Dominate Beast",
                                "Greater Invisibility"
                            ]
                        },
                        {
                            "Spell Level": "5th",
                            "Spells": [
                                "Dominate Person",
                                "Seeming"
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "Archetype Ability": "Misty Escape",
            "Archetype Ability Description": [
                "Starting at 6th level, you can vanish in a puff of mist in response to harm. When you take damage, you can use your reaction to turn invisible and teleport up to 60 feet to an unoccupied space you can see. You remain invisible until the start of your next turn or until you attack or cast a spell. Once you use this feature, you can't use it again until you finish a short or long rest."
            ]
        },
        {
            "Archetype Ability": "Beguiling Defenses",
            "Archetype Ability Description": [
                "Beginning at 10th level, your patron teaches you how to turn the mind-affecting magic of your enemies against them. You are immune to being charmed, and when another creature attempts to charm you, you can use your reaction to attempt to turn the charm back on them. The creature must succeed on a Wisdom saving throw against your warlock spell save DC, or be charmed by you for 1 minute or until the creature takes damage."
            ]
        },
        {
            "Archetype Ability": "Dark Delirium",
            "Archetype Ability Description": [
                "Starting at 14th level, you can plunge a creature into an illusory realm. As an action, choose a creature you can see within 60 feet of you. That creature must make a Wisdom saving throw against your warlock spell save DC. On a failed save, it is charmed or frightened by you (your choice) for 1 minute or until it takes damage.",
                "This effect ends early if the creature takes damage. Until the illusion ends, the charmed or frightened target is incapacitated, and its speed becomes 0. If the target is moved out of your line of sight, the illusion ends for that target."
            ]
        },
        {
            "Archetype Ability": "Faerie Form",
            "Archetype Ability Description": [
                "At 18th level, you can assume the form of a fey creature of your choice, as if using the polymorph spell. You can do this a number of times equal to your Charisma modifier (a minimum of once). You regain all expended uses of this feature when you finish a long rest."
            ]
        }
    ]
}
