{
    "Trinkets": [
        {
            "Dice Number": 1,
            "Trinket": "A compass that always points to Mulmaster."
        },
        {
            "Dice Number": 2,
            "Trinket": "A paper fan that won't produce a breeze no matter how hard it's waved."
        },
        {
            "Dice Number": 3,
            "Trinket": "A petrified potato that resembles someone important to you."
        },
        {
            "Dice Number": 4,
            "Trinket": "A glass cup that can only be filled half way no matter how much liquid is poured into it."
        },
        {
            "Dice Number": 5,
            "Trinket": "A mirror that only shows the back of your head."
        },
        {
            "Dice Number": 6,
            "Trinket": "A small glass bird that when set down near water dips its head in as if to get a drink."
        },
        {
            "Dice Number": 7,
            "Trinket": "A lady's coin purse containing two sharp fangs."
        },
        {
            "Dice Number": 8,
            "Trinket": "A small sea conch with the words 'From the beginning' painted on the lip."
        },
        {
            "Dice Number": 9,
            "Trinket": "A frost-covered silver locket that's frozen shut."
        },
        {
            "Dice Number": 10,
            "Trinket": "A seal which imprints a mysterious, unknown coat of arms into hard rock."
        },
        {
            "Dice Number": 11,
            "Trinket": "A small wooden doll that when held brings back fond memories."
        },
        {
            "Dice Number": 12,
            "Trinket": "A small handmirror which only reflects inanimate objects."
        },
        {
            "Dice Number": 13,
            "Trinket": "A glass eyeball that looks about of its own accordance, and can roll around."
        },
        {
            "Dice Number": 14,
            "Trinket": "A glass orb that replicates yesterday's weather inside itself."
        },
        {
            "Dice Number": 15,
            "Trinket": "A drinking cup that randomly fills with fresh or saltwater. Refilling once emptied."
        },
        {
            "Dice Number": 16,
            "Trinket": "A deep blue piece of flint, that when struck with steel produces not a spark but a drop of water."
        },
        {
            "Dice Number": 17,
            "Trinket": "A conch shell which is always damp and constantly drips saltwater."
        },
        {
            "Dice Number": 18,
            "Trinket": "A charred, half-melted pewter clasp that glows as if smoldering but releases no heat."
        },
        {
            "Dice Number": 19,
            "Trinket": "A clockwork finch that flaps its wings in the presence of a breeze."
        },
        {
            "Dice Number": 20,
            "Trinket": "An unbreakable sealed jar of glowing water that hums when shaken."
        },
        {
            "Dice Number": 21,
            "Trinket": "A small, finely polished geode whose crystals slowly fade between every color of the spectrum."
        },
        {
            "Dice Number": 22,
            "Trinket": "A rough stone eye pulled from a petrified creature."
        },
        {
            "Dice Number": 23,
            "Trinket": "A stone smoking pipe that never needs lighting."
        },
        {
            "Dice Number": 24,
            "Trinket": "A small whistle, that when blown, whispers a name of a person or place unknown to you, instead of the whistle sound."
        },
        {
            "Dice Number": 25,
            "Trinket": "A fist sized rock that 'beats' like a heart."
        },
        {
            "Dice Number": 26,
            "Trinket": "A pair of bronze scissors in the shape of a pair of leaping dolphins."
        },
        {
            "Dice Number": 27,
            "Trinket": "A bronze oil lamp which is rumored to have once held a genie."
        },
        {
            "Dice Number": 28,
            "Trinket": "A single gauntlet inscribed with a fire motif and an unfamiliar name in Primordial."
        },
        {
            "Dice Number": 29,
            "Trinket": "A one-eyed little fish inside a spherical vial, much bigger than the vial's neck. He has a cunning look."
        },
        {
            "Dice Number": 30,
            "Trinket": "The tiny skull of a rabbit that whispers scathing insults when nobody is looking."
        },
        {
            "Dice Number": 31,
            "Trinket": "A rag doll in the likeness of an owlbear."
        },
        {
            "Dice Number": 32,
            "Trinket": "The desiccated body of a small eight-legged black lizard."
        },
        {
            "Dice Number": 33,
            "Trinket": "A small toy boat made with a walnut shell, toothpick, and piece of cloth."
        },
        {
            "Dice Number": 34,
            "Trinket": "A small pocket mirror that slowly fogs over while held."
        },
        {
            "Dice Number": 35,
            "Trinket": "Wind chimes that glow when the wind blows."
        },
        {
            "Dice Number": 36,
            "Trinket": "A small, clay square with an unknown rune etched into one side."
        },
        {
            "Dice Number": 37,
            "Trinket": "A tea kettle that heats itself when filled with water."
        },
        {
            "Dice Number": 38,
            "Trinket": "An old scratched monocle which shows an underwater landscape whenever someone looks through it."
        },
        {
            "Dice Number": 39,
            "Trinket": "A rose carved from coral."
        },
        {
            "Dice Number": 40,
            "Trinket": "A set of dice with elemental symbols and primordial runes instead of pips or numbers."
        },
        {
            "Dice Number": 41,
            "Trinket": "An amulet filled with liquid that churns, freezes, or boils to match its wearer's mood."
        },
        {
            "Dice Number": 42,
            "Trinket": "A small silver bell that makes a sound like quiet, distant thunder when it's struck."
        },
        {
            "Dice Number": 43,
            "Trinket": "A small vial of black sand that glows slightly in the moonlight."
        },
        {
            "Dice Number": 44,
            "Trinket": "A small whale tooth with etched with an image of waves crashing upon a beach."
        },
        {
            "Dice Number": 45,
            "Trinket": "An hourglass in which the sands pour upward instead of downward."
        },
        {
            "Dice Number": 46,
            "Trinket": "A glass pendant with a hole in the center that a mild breeze always blows out of."
        },
        {
            "Dice Number": 47,
            "Trinket": "A soft feather that falls like a stone when dropped."
        },
        {
            "Dice Number": 48,
            "Trinket": "A large transparent gem that, when gripped tightly, whispers in Terran."
        },
        {
            "Dice Number": 49,
            "Trinket": "A small crystal snowglobe that, when shaken, seems to form silhouettes of dancing forms."
        },
        {
            "Dice Number": 50,
            "Trinket": "Half of a palm-sized geode that pulses dimly with purple light."
        },
        {
            "Dice Number": 51,
            "Trinket": "A book filled with writing that only appears when the book is held underwater."
        },
        {
            "Dice Number": 52,
            "Trinket": "A sealed envelope made of red leather that you haven’t been able to open. It smells of campfire."
        },
        {
            "Dice Number": 53,
            "Trinket": "A locket of hair that is rumored to have come from a famed fire genasi."
        },
        {
            "Dice Number": 54,
            "Trinket": "Flint and steel that, when used to start a fire, creates a random colored flame."
        },
        {
            "Dice Number": 55,
            "Trinket": "A blank piece of wet parchment that never seems to dry."
        },
        {
            "Dice Number": 56,
            "Trinket": "A small puzzle box made of brass, that is slightly warm to the touch."
        },
        {
            "Dice Number": 57,
            "Trinket": "A cloudy chunk of glass that is said to hold a spark of breath from a blue dragon."
        },
        {
            "Dice Number": 58,
            "Trinket": "A crude chalice made of coal."
        },
        {
            "Dice Number": 59,
            "Trinket": "A miniature brass horn, silent when played, but fills the air with the scent of warm and exotic spices."
        },
        {
            "Dice Number": 60,
            "Trinket": "An eye-sized blue pearl that floats in salt water."
        },
        {
            "Dice Number": 61,
            "Trinket": "A tuning fork made from a dark metal which glows with a pale, white light during thunderstorms."
        },
        {
            "Dice Number": 62,
            "Trinket": "A small vial that is always filled with the smell of autumn wind."
        },
        {
            "Dice Number": 63,
            "Trinket": "A clear marble that slowly rolls toward the nearest source of running water."
        },
        {
            "Dice Number": 64,
            "Trinket": "A small collapsible silver cup that perspires constantly when opened."
        },
        {
            "Dice Number": 65,
            "Trinket": "An hourglass that tells time with falling mist instead of sand."
        },
        {
            "Dice Number": 66,
            "Trinket": "An ornate razor, which only cuts in freezing cold temperature."
        },
        {
            "Dice Number": 67,
            "Trinket": "A shark tooth covered in tiny etched words from a lost language."
        },
        {
            "Dice Number": 68,
            "Trinket": "A large brass coin with no markings or images on it."
        },
        {
            "Dice Number": 69,
            "Trinket": "A small wooden box filled with a strange red clay."
        },
        {
            "Dice Number": 70,
            "Trinket": "A necklace with a small, rusted iron anchor."
        },
        {
            "Dice Number": 71,
            "Trinket": "A small brass flute adorned with silver wire that is always faintly sounding."
        },
        {
            "Dice Number": 72,
            "Trinket": "A red and black Aarakocra feather."
        },
        {
            "Dice Number": 73,
            "Trinket": "A palm-sized stone with a hole in it, through which can be heard a constantly whispering wind."
        },
        {
            "Dice Number": 74,
            "Trinket": "A small conch shell covered in black crystal."
        },
        {
            "Dice Number": 75,
            "Trinket": "A small music box made of brass. It features a pair of tiny automatons that resemble Azer working at a forge."
        },
        {
            "Dice Number": 76,
            "Trinket": "A glass jar containing the preserved corpse of an unfamiliar aquatic creature."
        },
        {
            "Dice Number": 77,
            "Trinket": "A piece of petrified wood carved into the shape of a seashell."
        },
        {
            "Dice Number": 78,
            "Trinket": "A wooden puzzle cube covered in elemental symbols."
        },
        {
            "Dice Number": 79,
            "Trinket": "A small stone cube that acts as a magnet when placed against another stone."
        },
        {
            "Dice Number": 80,
            "Trinket": "A ring made of a white metal. On the inside is a name etched in Auran."
        },
        {
            "Dice Number": 81,
            "Trinket": "A bracelet made of silvered fish hooks."
        },
        {
            "Dice Number": 82,
            "Trinket": "A journal filled with poetry hand-written in Primordial."
        },
        {
            "Dice Number": 83,
            "Trinket": "A yellow gemstone that glows dimly when a storm is nearby."
        },
        {
            "Dice Number": 84,
            "Trinket": "A charred chisel with an unfamiliar symbol stamped into its base."
        },
        {
            "Dice Number": 85,
            "Trinket": "A canteen filled with a foul smelling orange mud."
        },
        {
            "Dice Number": 86,
            "Trinket": "A faceless doll made of driftwood."
        },
        {
            "Dice Number": 87,
            "Trinket": "A heavy iron key bearing the name of a ship long lost to the sea."
        },
        {
            "Dice Number": 88,
            "Trinket": "A small jewelry box made from the shell of a turtle."
        },
        {
            "Dice Number": 89,
            "Trinket": "A chess piece fashioned to look like fire myrmidon."
        },
        {
            "Dice Number": 90,
            "Trinket": "A spinning top with an image of one of the four elements on each side."
        },
        {
            "Dice Number": 91,
            "Trinket": "A single hoop earring made of a porous red stone."
        },
        {
            "Dice Number": 92,
            "Trinket": "An arrowhead carved from seasalt."
        },
        {
            "Dice Number": 93,
            "Trinket": "A small comb made of blue coral."
        },
        {
            "Dice Number": 94,
            "Trinket": "Seven small beads of sandstone on a string, all different colors."
        },
        {
            "Dice Number": 95,
            "Trinket": "A romance chapbook written in Undercommon titled 'Just one Layer of Grey'."
        },
        {
            "Dice Number": 96,
            "Trinket": "A tiny, broken clockwork Harpy."
        },
        {
            "Dice Number": 97,
            "Trinket": "An ivory whale statuette."
        },
        {
            "Dice Number": 98,
            "Trinket": "A fist-sized cog, covered in barnacles."
        },
        {
            "Dice Number": 99,
            "Trinket": "An eyepatch made of obsidian and a black leather cord."
        },
        {
            "Dice Number": 100,
            "Trinket": "A glass bottle with a tiny ship of unfamiliar design inside."
        }
    ]
}
