{
    "Archetype Name": "Aberrant Mind",
    "Archetype Features": [
        {
            "Level": 1,
            "Archetype Feature": "Aberrant Origins",
            "Archetype Feature Description": [
                "You roll on the Aberrant Origins table to determine the nature of your connection to the Far Realm:",
                {
                    "1": "You were exposed to the Far Realm's warping influence. You are convinced that a tentacle is now growing on you, but no one else can see it.",
                    "2": "A psychic wind from the Astral Plane carried psionic energy to you. When you use your powers, faint motes of light sparkle around you.",
                    "3": "You once suffered the dominating powers of an aboleth, leaving a psychic splinter in your mind.",
                    "4": "You were implanted with a mind flayer tadpole, but the ceremorphosis never completed. And now its psionic power is yours. When you use it, your flesh shines with a strange mucus.",
                    "5": "As a child, you had an imaginary friend that looked like a flumph or a strange platypus-like creature. One day, it gifted you with psionic powers, which have ended up being not so imaginary.",
                    "6": "Your nightmares whisper the truth to you: your psionic powers are not your own. You draw them from your parasitic twin!"
                }
            ]
        },
        {
            "Level": 1,
            "Archetype Feature": "Psionic Spells",
            "Archetype Feature Description": [
                "You learn additional spells as shown on the Psionic Spells table. These spells count as sorcerer spells but don’t count against the number of sorcerer spells you know.",
                "Whenever you gain a sorcerer level, you can replace one spell you gained from this feature with another divination or enchantment spell from the sorcerer, warlock, or wizard spell list."
            ],
            "Psionic Spells Table": {
                "1st Level Spells": [ "Arms of Hadar", "Dissonant Whispers", "Mind Sliver" ],
                "3rd Level Spells": [ "Calm Emotions", "Detect Thoughts" ],
                "5th Level Spells": [ "Hunger of Hadar", "Sending" ],
                "7th Level Spells": [ "Evard's Black Tentacles", "Summon Aberration" ],
                "9th Level Spells": [ "Rary's Telepathic Bond", "Telekinesis" ]
            }
        },
        {
            "Level": 1,
            "Archetype Feature": "Telepathic Speech",
            "Archetype Feature Description": [
                "You can form a telepathic connection with a creature you can see within 30 feet. You and the chosen creature can communicate telepathically within a number of miles equal to your Charisma modifier (minimum of 1 mile).",
                "The connection lasts for a number of minutes equal to your sorcerer level, ending early if you are incapacitated, die, or form a new connection with a different creature."
            ]
        },
        {
            "Level": 6,
            "Archetype Feature": "Psionic Sorcery",
            "Archetype Feature Description": [
                "When you cast any spell of 1st level or higher from your Psionic Spells feature, you can cast it by expending a spell slot or by spending a number of sorcery points equal to the spell's level. Casting with sorcery points requires no verbal, somatic, or material components, unless consumed by the spell."
            ]
        },
        {
            "Level": 6,
            "Archetype Feature": "Psychic Defenses",
            "Archetype Feature Description": [
                "You gain resistance to psychic damage and have advantage on saving throws against being charmed or frightened."
            ]
        },
        {
            "Level": 14,
            "Archetype Feature": "Revelation in Flesh",
            "Archetype Feature Description": [
                "You can transform your body for 10 minutes by spending 1 or more sorcery points. For each sorcery point spent, choose one benefit:",
                [
                    "You can see any invisible creature within 60 feet of you. Your eyes turn black or become writhing sensory tendrils.",
                    "You gain a flying speed equal to your walking speed and can hover. Your skin glistens with mucus or shines with an otherworldly light.",
                    "You gain a swimming speed equal to twice your walking speed and can breathe underwater. Gills grow from your neck, or your fingers become webbed.",
                    "Your body and any equipment you are wearing or carrying become slimy and pliable. You can move through spaces as narrow as 1 inch and escape from nonmagical restraints or grappling with 5 feet of movement."
                ]
            ]
        },
        {
            "Level": 18,
            "Archetype Feature": "Warping Implosion",
            "Archetype Feature Description": [
                "You can teleport to an unoccupied space within 120 feet. Creatures within 30 feet of your former space must make a Strength saving throw. On a failed save, they take 3d10 force damage and are pulled toward your former space. On a successful save, they take half damage and aren't pulled.",
                "Once used, you can't use this feature again until you finish a long rest, unless you spend 5 sorcery points to use it again."
            ]
        }
    ]
}
