{
    "Subclass Name": "Swarmkeeper",
    "Subclass Features": [
        {
            "Feature Name": "Swarmkeeper Magic",
            "Feature Description": [
                "Starting at 3rd level, you learn an additional spell when you reach certain levels in this subclass, as shown in the Swarmkeeper Spells table. The spell counts as a Ranger spell for you, but it doesn't count against the number of Ranger spells you know.",
                {
                    "Swarm Appearance": [
                        {
                            "Dice Number": 1,
                            "Appearance": "Swarming insects"
                        },
                        {
                            "Dice Number": 2,
                            "Appearance": "Miniature twig blights"
                        },
                        {
                            "Dice Number": 3,
                            "Appearance": "Fluttering birds"
                        },
                        {
                            "Dice Number": 4,
                            "Appearance": "Playful pixies"
                        }
                    ]
                },
                "Once on each of your turns, you can cause the swarm to assist you in one of the following ways, immediately after you hit a creature with an attack:",
                [
                    "The attack's target takes 1d6 piercing damage from the swarm.",
                    "The attack's target must succeed on a Strength saving throw against your spell save DC or be moved by the swarm up to 15 feet horizontally in a direction of your choice.",
                    "You are moved by the swarm 5 feet horizontally in a direction of your choice."
                ]
            ]
        },
        {
            "Feature Name": "Swarmkeeper's Magic",
            "Feature Description": [
                "At 3rd level, you learn an additional spell when you reach certain levels in this subclass, as shown in the Swarmkeeper Spells table. The spell counts as a Ranger spell for you, but it doesn't count against the number of Ranger spells you know."
            ]
        },
        {
            "Feature Name": "Gathered Swarm",
            "Feature Description": [
                "Starting at 3rd level, you can magically attract a swarm of fey spirits that cling to your body and protect you.",
                "As a bonus action, you can summon the swarm, which manifests as a spectral, swarm-like aura that surrounds you. The aura has a radius of 10 feet and lasts for 1 minute or until you dismiss it (no action required). While the aura is active, you gain the following benefits:",
                "- Difficult Terrain: The area within the aura is considered difficult terrain for your enemies.",
                "- Ranged Attack Defense: When a ranged weapon attack is made against a creature within the aura, the attacker has disadvantage on the attack roll.",
                "- Swarm's Protection: When a creature you can see hits you with an attack, you can use your reaction to reduce the attack's damage by 1d6. The damage reduction increases to 2d6 at 7th level and 3d6 at 15th level.",
                "Once you use this feature, you can't use it again until you finish a short or long rest."
            ]
        },
        {
            "Feature Name": "Swarmkeeper Spells",
            "Feature Description": [
                "Your connection to the fey allows you to learn certain spells. At 3rd, 5th, 9th, 13th, and 17th level, you gain access to the spells listed in the Swarmkeeper Spells table. These spells are Ranger spells for you, but they don't count against the number of Ranger spells you know.",
                {
                    "Swarmkeeper Spells": [
                        {
                            "Level": "3rd",
                            "Spells": [ "Hunters Mark", "Protection from Evil and Good" ]
                        },
                        {
                            "Level": "5th",
                            "Spells": [ "Barkskin", "Web" ]
                        },
                        {
                            "Level": "9th",
                            "Spells": [ "Freedom of Movement", "Gaseous Form" ]
                        },
                        {
                            "Level": "13th",
                            "Spells": [ "Blight", "Insect Plague" ]
                        },
                        {
                            "Level": "17th",
                            "Spells": [ "Awaken", "Tree Stride" ]
                        }
                    ]
                }
            ]
        },
        {
            "Feature Name": "Writhing Tide",
            "Feature Description": [
                "At 7th level, your swarm becomes more aggressive and can hinder your enemies. While your Gathered Swarm is active, you can use your action to force one creature you can see within the aura to make a Strength saving throw against your spell save DC. On a failed save, the target takes 2d6 slashing damage as the swarm bites and claws at it. On a successful save, the target takes half as much damage.",
                "Once you use this feature, you can't use it again until you finish a short or long rest."
            ]
        },
        {
            "Feature Name": "Scuttling Eyes",
            "Feature Description": [
                "At 11th level, your swarm's fey spirits can extend their senses. You can use your action to magically gain the benefits of the 'See Invisibility' spell for 10 minutes, but only within the aura created by your Gathered Swarm feature.",
                "Once you use this feature, you can't use it again until you finish a short or long rest."
            ]
        },
        {
            "Feature Name": "Swarm Form",
            "Feature Description": [
                "At 15th level, you can transform your body into a mass of swarming fey spirits. As an action, you can use your Gathered Swarm feature and choose a number of
