{
    "6thLevelClericSpells": [
        {
            "Name": "Blade Barrier",
            "School": "Evocation",
            "Description": "You create a vertical wall of whirling, razor-sharp blades made of magical energy."
        },
        {
            "Name": "Create Undead",
            "School": "Necromancy",
            "Description": "You can cast this spell only at night. Choose up to three corpses of Medium or Small humanoids within range."
        },
        {
            "Name": "Find the Path",
            "School": "Divination",
            "Description": "This spell allows you to find the shortest, most direct physical route to a specific fixed location that you are familiar with on the same plane of existence."
        },
        {
            "Name": "Forbiddance",
            "School": "Abjuration",
            "Description": "You create a ward against magical travel that protects up to 40,000 square feet of floor space to a height of 30 feet above the floor."
        },
        {
            "Name": "Harm",
            "School": "Necromancy",
            "Description": "You unleash a virulent disease on a creature that you can see within range."
        },
        {
            "Name": "Heal",
            "School": "Evocation",
            "Description": "A surge of positive energy washes through the creature, causing it to regain 70 hit points."
        },
        {
            "Name": "Heroes' Feast",
            "School": "Conjuration",
            "Description": "You bring forth a great feast, including magnificent food and drink."
        },
        {
            "Name": "Planar Ally",
            "School": "Conjuration",
            "Description": "You beseech an otherworldly entity for aid. The being must be known to you: a god, a primordial, a demon prince, or some other being of cosmic power."
        },
        {
            "Name": "True Seeing",
            "School": "Divination",
            "Description": "This spell gives the willing creature you touch the ability to see things as they actually are."
        },
        {
            "Name": "Word of Recall",
            "School": "Conjuration",
            "Description": "You and up to five willing creatures within 5 feet of you instantly teleport to a previously designated sanctuary."
        }
    ]
}
