{
    "5thLevelClericSpells": [
        {
            "Name": "Commune",
            "School": "Divination",
            "Description": "You contact your deity or a divine proxy and ask up to three questions that can be answered with a yes or no."
        },
        {
            "Name": "Contagion",
            "School": "Necromancy",
            "Description": "Your touch inflicts disease. Make a melee spell attack against a creature you can reach."
        },
        {
            "Name": "Dispel Evil and Good",
            "School": "Abjuration",
            "Description": "Shimmering energy surrounds and protects you from fey, undead, and creatures originating from beyond the Material Plane."
        },
        {
            "Name": "Flame Strike",
            "School": "Evocation",
            "Description": "A vertical column of divine fire roars down from the heavens in a location you specify."
        },
        {
            "Name": "Geas",
            "School": "Enchantment",
            "Description": "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide."
        },
        {
            "Name": "Greater Restoration",
            "School": "Abjuration",
            "Description": "You imbue a creature you touch with positive energy to undo a debilitating effect."
        },
        {
            "Name": "Hallow",
            "School": "Evocation",
            "Description": "You touch a point and infuse an area around it with holy (or unholy) power."
        },
        {
            "Name": "Insect Plague",
            "School": "Conjuration",
            "Description": "Swarming, biting locusts fill a 20-foot-radius sphere centered on a point you choose within range."
        },
        {
            "Name": "Legend Lore",
            "School": "Divination",
            "Description": "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named."
        },
        {
            "Name": "Mass Cure Wounds",
            "School": "Evocation",
            "Description": "A wave of healing energy washes out from a point of your choice within range."
        },
        {
            "Name": "Planar Binding",
            "School": "Abjuration",
            "Description": "With this spell, you attempt to bind a celestial, an elemental, a fey, or a fiend to your service."
        },
        {
            "Name": "Raise Dead",
            "School": "Necromancy",
            "Description": "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days."
        },
        {
            "Name": "Scrying",
            "School": "Divination",
            "Description": "You can see and hear a particular creature you choose that is on the same plane of existence as you."
        }
    ]
}
