{
    "4thLevelClericSpells": [
        {
            "Name": "Banishment",
            "School": "Abjuration",
            "Description": "You attempt to send one creature that you can see within range to another plane of existence."
        },
        {
            "Name": "Control Water",
            "School": "Transmutation",
            "Description": "Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side."
        },
        {
            "Name": "Death Ward",
            "School": "Abjuration",
            "Description": "You touch a creature and grant it a measure of protection from death."
        },
        {
            "Name": "Divination",
            "School": "Divination",
            "Description": "Your magic and an offering put you in contact with a god or a god’s servants."
        },
        {
            "Name": "Freedom of Movement",
            "School": "Abjuration",
            "Description": "For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target’s speed nor cause the target to be paralyzed or restrained."
        },
        {
            "Name": "Guardian of Faith",
            "School": "Conjuration",
            "Description": "A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range."
        },
        {
            "Name": "Locate Creature",
            "School": "Divination",
            "Description": "Describe or name a creature that is familiar to you. You sense the direction to the creature’s location, as long as that creature is within 1,000 feet of you."
        },
        {
            "Name": "Stone Shape",
            "School": "Transmutation",
            "Description": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose."
        }
    ]
}
