{
    "Feats": [
        {
            "Feat Name": "Aberrant Dragonmark",
            "Prerequisite": "None",
            "Description": "You have manifested an aberrant dragonmark. It might have appeared as a result of a sudden trauma, or it might have appeared through an epiphany you had in a moment of extreme emotion. The circumstances of its appearance are likely tied to the emotional state you were in when it manifested. Work with your DM to determine the origin of your aberrant dragonmark.",
            "Dragonmark": "Choose one of the dragonmarks you don't already have. You gain the ability to use the spells and the spell-like abilities provided by the dragonmark.",
            "Aberrant Mark": "Your aberrant mark is a unique sigil, a glowing rune, or some other strange manifestation that evidences its otherworldly origin. It might look like an old scar, a cluster of eyes, puckered flesh, a glowing tattoo, or an iridescent birthmark. The mark is a manifestation of the power within you and of the bond between you and the aberrant forces that gave you this gift. Your mark glows visibly when you use its spells or when you use your Tainted Mark trait.",
            "Ability Score Increase": "Your Constitution or Charisma score increases by 1, to a maximum of 20.",
            "Tainted Mark": "You can use your mark to cast certain spells even if you aren’t capable of casting spells. Casting these spells requires no material components, and you cast them as if you had a spellcasting ability. Once you cast a spell with this trait, you can't do so again until you finish a long rest, unless you expend a Hit Die to cast it again. The spells on the list associated with your mark are considered sorcerer spells for you, and they don’t count against the number of sorcerer spells you know.",
            "Aberrant Dragonmark Spells": [
                {
                    "Spell Level": "1st Level",
                    "Spells": [ "Mage armor" ]
                },
                {
                    "Spell Level": "3rd Level",
                    "Spells": [ "Detect thoughts" ]
                },
                {
                    "Spell Level": "5th Level",
                    "Spells": [ "Dispel magic" ]
                },
                {
                    "Spell Level": "7th Level",
                    "Spells": [ "Dominate beast" ]
                },
                {
                    "Spell Level": "9th Level",
                    "Spells": [ "Dominate person" ]
                }
            ]
        },
        {
            "Feat Name": "Actor",
            "Prerequisite": "None",
            "Description": "You have an extraordinary talent for assuming other identities and mimicry. You gain the following benefits:",
            "Ability Score Increase": "Your Charisma score increases by 1, to a maximum of 20.",
            "Mimicry": "You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking or heard the creature make the sound for at least 1 minute. A successful Wisdom (Insight) check contested by your Charisma (Deception) check allows a listener to determine that the effect is faked.",
            "Disguise": "You can create disguises, enabling you to pass as other people. You must spend at least 1 hour creating the disguise and have appropriate materials (disguise kit). A successful Wisdom (Insight) check contested by your Charisma (Deception) check allows a person to see through your disguise.",
            "False Identity": "You have documentation, established acquaintances, and disguises that allow you to assume a new identity. You can create a second identity that includes documentation, established acquaintances, and disguises. The documentation includes official papers, certificates of birth and citizenship, and licenses, such as a license to practice law or a license to be a merchant. Your new identity might even have an associated profession, but none of your characteristics change. You can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy."
        },
        {
            "Feat Name": "Alert",
            "Prerequisite": "None",
            "Description": "You gain a +5 bonus to initiative. You can't be surprised while you are conscious, and other creatures don't gain advantage on attack rolls against you as a result of being hidden from you."
        },
        {
            "Feat Name": "Athlete",
            "Prerequisite": "None",
            "Description": "You have undergone extensive physical training to gain the following benefits:\n\n- Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- When you are prone, standing up uses only 5 feet of your movement.\n- Climbing doesn't cost you extra movement.\n- You can make a running long jump or running high jump after moving only 5 feet on foot, rather than 10 feet."
        },
        {
            "Feat Name": "Bountiful Luck",
            "Prerequisite": "Halfling",
            "Description": "Your people are more prone to having small, everyday miracles than most folk. You gain the following benefits:",
            "Ability Score Increase": "Your Charisma score increases by 1, to a maximum of 20.",
            "Survivor's Luck": "When an ally you can see rolls a 1 on a d20 roll for an attack roll, ability check, or saving throw, you can use your reaction to let the ally reroll the die. The ally must use the new roll.",
            "Fearless Luck": "You have a talent for turning fear into a source of strength. When you make a saving throw against being frightened, you can use your reaction to roll a d4 and add the number rolled to the save. If the result of the d4 roll turns the failure into a success, the fear effect on you ends.",
            "Fortune's Favor": "When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
        },
        {
            "Feat Name": "Charger",
            "Prerequisite": "Strength 13 or higher",
            "Description": "When you use your action to Dash, you can use a bonus action to make one melee weapon attack or to shove a creature. If you move at least 10 feet in a straight line immediately before taking this bonus action, you either gain a +5 bonus to the attack’s damage roll (if you chose to make a melee weapon attack and hit) or push the target up to 10 feet away from you (if you chose to shove and you succeed)."
        },
        {
            "Feat Name": "Chef",
            "Prerequisite": "None",
            "Description": "You gain proficiency with cook's utensils if you don't already have it. As part of a short rest, you can cook special food, provided you have ingredients and cook's utensils on hand. You can prepare enough of this food for a number of creatures equal to 4 + your proficiency bonus. At the end of the short rest, any creature who eats the food"
        },
        {
            "Feat Name": "Crossbow Expert",
            "Prerequisite": "None",
            "Description": "You ignore the loading property of crossbows with which you are proficient. Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls. When you use the Attack action and attack with a one-handed weapon, you can use a bonus action to attack with a loaded hand crossbow you are holding."
        },
        {
            "Feat Name": "Crusher",
            "Prerequisite": "Strength or Dexterity 13 or higher",
            "Description": "You are practiced in the art of crushing your enemies, granting you the following benefits:\n\n- Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 5 feet to an unoccupied space, provided the target is no more than one size larger than you.\n- When you score a critical hit that deals bludgeoning damage to a creature, attack rolls against that creature have advantage until the start of your next turn."
        },
        {
            "Feat Name": "Defensive Duelist",
            "Prerequisite": "Dexterity 13 or higher",
            "Description": "When you are wielding a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you."
        },
        {
            "Feat Name": "Dragon Fear",
            "Prerequisite": "Dragonborn",
            "Description": "Your draconic ancestry manifests in a powerful roar. You can use your action to unleash a mighty roar, causing fear in your enemies. Each creature of your choice within 30 feet of you that can hear you must make a Wisdom saving throw against a DC of 8 + your proficiency bonus + your Charisma modifier. On a failed save, a creature becomes frightened for 1 minute. If a creature succeeds on the saving throw, it is immune to your Dragon Fear for the next 24 hours."
        },
        {
            "Feat Name": "Dragon Hide",
            "Prerequisite": "Dragonborn",
            "Description": "Your draconic heritage grants you enhanced scales. Your skin toughens like a dragon's, granting you the following benefits:\n\n- Your Armor Class increases by 1, as your scales provide extra protection.\n- You have resistance to the damage type associated with your dragon ancestry (acid for black or copper, cold for silver or white, fire for red or gold, lightning for blue or bronze, poison for green). If your dragon ancestry does not have a damage type associated with it, you gain resistance to a type of damage of your choice (subject to DM approval).\n\nThis feat does not affect your ability to use natural weapons, such as a dragonborn's breath weapon."
        },
        {
            "Feat Name": "Drow Elf Magic",
            "Prerequisite": "Drow",
            "Description": "You have inherited the innate spellcasting ability of drow. This ability allows you to cast some spells innately, as well as granting you other magical abilities. You gain the following benefits:",
            "Ability Score Increase": "Your Charisma score increases by 1, to a maximum of 20.",
            "Innate Spellcasting": [
                {
                    "Spell Level": "1st Level",
                    "Spells": [ "Dancing Lights" ]
                },
                {
                    "Spell Level": "3rd Level",
                    "Spells": [ "Faerie Fire" ]
                },
                {
                    "Spell Level": "5th Level",
                    "Spells": [ "Darkness" ]
                }
            ],
            "Drow Weapon Training": "You have proficiency with rapiers, shortswords, and hand crossbows."
        },
        {
            "Feat Name": "Dual Wielder",
            "Prerequisite": "None",
            "Description": "You master fighting with two weapons, gaining the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Two-Weapon Fighting": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.",
            "Drawing Two Weapons": "You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.",
            "Dual Wielder Master": "You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand."
        },
        {
            "Feat Name": "Dungeon Delver",
            "Prerequisite": "None",
            "Description": "You have learned the hard way that sharp eyes and quick reflexes are needed to survive in dungeons and other dark and treacherous underground spaces. You gain the following benefits:",
            "Alert to Hidden Doors and Traps": "You have advantage on Wisdom (Perception) and Intelligence (Investigation) checks made to detect the presence of secret doors. You also have advantage on saving throws made to avoid or resist traps.",
            "Finding Traps": "You can search for traps while traveling at a normal pace, instead of only at a slow pace.",
            "Tinkerer": "You have proficiency with artisan's tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a tiny, clockwork device (AC 5, 1 hp) that emits a sound when someone comes within 10 feet of it. The device makes a tinkling sound that can be heard from up to 10 feet away. It is reusable, but it ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you dismantle it to create a new device.",
            "Trap Sense": "You have advantage on saving throws made to avoid or resist traps, and you have resistance to damage dealt by traps.",
            "Evasion": "You can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take half damage, you instead take no damage on a successful save, and only half damage on a failed save."
        },
        {
            "Feat Name": "Durable",
            "Prerequisite": "None",
            "Description": "Hardy and resilient, you gain the following benefits:",
            "Ability Score Increase": "Your Constitution score increases by 1, to a maximum of 20.",
            "Durable Endurance": "When you roll a Hit Die to regain hit points, the minimum number of hit points you regain is equal to twice your Constitution modifier (minimum of 2)."
        },
        {
            "Feat Name": "Dwarf Fortitude",
            "Prerequisite": "Dwarf",
            "Description": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
        },
        {
            "Feat Name": "Eldritch Adept",
            "Prerequisite": "None",
            "Description": "Studying occult lore, you have unlocked eldritch power within yourself. You gain the following benefits:",
            "Ability Score Increase": "Your Intelligence or Charisma score increases by 1, to a maximum of 20.",
            "Eldritch Invocation": "You learn one eldritch invocation option of your choice from the warlock class. If the invocation has a prerequisite of warlock level, you must meet it."
        },
        {
            "Feat Name": "Elemental Adept",
            "Prerequisite": "None",
            "Description": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, poison, or thunder. Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.",
            "Special": "You can select this feat multiple times. Each time you do so, you must choose a different damage type."
        },
        {
            "Feat Name": "Elven Accuracy",
            "Prerequisite": "Elf or Half-Elf",
            "Description": "You have uncanny aim. You gain the following benefits:",
            "Ability Score Increase": "Your Dexterity, Intelligence, Wisdom, or Charisma score increases by 1, to a maximum of 20.",
            "Elven Accuracy": "When you have advantage on an attack roll using Dexterity, Intelligence, Wisdom, or Charisma, you can reroll one of the dice once."
        },
        {
            "Feat Name": "Ember of the Fire Giant",
            "Prerequisite": "Tiefling",
            "Description": "You have unlocked the latent power of your fire giant heritage, gaining the following benefits:",
            "Ability Score Increase": "Your Strength score increases by 1, to a maximum of 20.",
            "Fire Giant's Fury": "You can call on the fiery power within you to fuel your strikes. When you hit with an attack using a melee weapon, you can choose to deal an extra 1d4 fire damage to the target. The damage increases to 1d6 at 6th level, 1d8 at 11th level, and 1d10 at 16th level. After using this ability, you can't use it again until you finish a short or long rest."
        },
        {
            "Feat Name": "Fade Away",
            "Prerequisite": "None",
            "Description": "You know how to hide, even when you are in plain sight. You gain the following benefits:",
            "Ability Score Increase": "Your Dexterity score increases by 1, to a maximum of 20.",
            "Fade Away": "When you take damage, you can use your reaction to magically become invisible until the end of your next turn or until you attack, deal damage, or force a creature to make a saving throw. Once you use this ability, you can't use it again until you finish a short or long rest."
        },
        {
            "Feat Name": "Fey Teleportation",
            "Prerequisite": "Elf or Half-Elf",
            "Description": "You learn to harness the power of the Feywild to teleport short distances. You gain the following benefits:",
            "Ability Score Increase": "Your Dexterity or Charisma score increases by 1, to a maximum of 20.",
            "Fey Step": "You can cast the misty step spell once using this trait. You regain the ability to do so when you finish a short or long rest."
        },
        {
            "Feat Name": "Fey Touched",
            "Prerequisite": "None",
            "Description": "You have been touched by the power of the Feywild. You gain the following benefits:",
            "Ability Score Increase": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
            "Fey Magic": "You learn the misty step spell and one 1st-level spell of your choice. You can cast the 1st-level spell once without expending a spell slot. You regain the ability to do so when you finish a short or long rest."
        },
        {
            "Feat Name": "Fighting Initiate",
            "Prerequisite": "None",
            "Description": "You have practiced a set of martial techniques. You gain the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Fighting Style": "Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again."
        },
        {
            "Feat Name": "Flames of Phlegethos",
            "Prerequisite": "Tiefling",
            "Description": "You have learned to unleash the magical potential within your blood, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence score increases by 1, to a maximum of 20.",
            "Fiery Teleportation": "When you are hit by an attack, you can use your reaction to invoke the hellish flames within you, causing them to burst out and engulf your attacker. The attacker takes fire damage equal to your Charisma modifier (minimum of 1 damage). After using this ability, you can't use it again until you finish a short or long rest."
        },
        {
            "Feat Name": "Fury of the Frost Giant",
            "Prerequisite": "Goliath",
            "Description": "You have unlocked the innate fury of the frost giant within your blood, gaining the following benefits:",
            "Ability Score Increase": "Your Strength score increases by 1, to a maximum of 20.",
            "Frost Giant's Fury": "You can call on your icy heritage to fuel your attacks. When you hit with an attack using a melee weapon, you can choose to deal an extra 1d6 cold damage to the target. The damage increases to 1d8 at 6th level, 1d10 at 11th level, and 1d12 at 16th level. After using this ability, you can't use it again until you finish a short or long rest."
        },
        {
            "Feat Name": "Gift of the Chromatic Dragon",
            "Prerequisite": "Dragonborn",
            "Description": "Your draconic ancestry has bestowed you with chromatic energy. You gain the following benefits:",
            "Ability Score Increase": "Your Constitution score increases by 1, to a maximum of 20.",
            "Chromatic Breath": "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After using this ability, you can't use it again until you finish a short or long rest."
        },
        {
            "Feat Name": "Gift of the Gem Dragon",
            "Prerequisite": "Dragonborn",
            "Description": "You have absorbed the essence of gem dragons, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence score increases by 1, to a maximum of 20.",
            "Gem Dragon's Breath": "You can use your action to exhale magical energy. Your gem dragon ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your gem dragon ancestry. The DC for this saving throw equals 8 + your Intelligence modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After using this ability, you can't use it again until you finish a short or long rest."
        },
        {
            "Feat Name": "Gift of the Metallic Dragon",
            "Prerequisite": "Dragonborn",
            "Description": "Your draconic ancestry is tied to metallic dragons, granting you the following benefits:",
            "Ability Score Increase": "Your Charisma score increases by 1, to a maximum of 20.",
            "Metallic Dragon's Breath": "You can use your action to exhale a destructive energy. Your metallic dragon ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your metallic dragon ancestry. The DC for this saving throw equals 8 + your Charisma modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After using this ability, you can't use it again until you finish a short or long rest."
        },
        {
            "Feat Name": "Grappler",
            "Prerequisite": "Strength 13 or higher",
            "Description": "You have practiced the art of wrestling and grappling, gaining the following benefits:",
            "Ability Score Increase": "Your Strength score increases by 1, to a maximum of 20.",
            "Wrestler": "You have advantage on attack rolls against a creature you are grappling. You can use your action to try to pin a creature grappled by you. To do so, make another grapple check. If you succeed, you and the creature are both restrained until the grapple ends."
        },
        {
            "Feat Name": "Great Weapon Master",
            "Prerequisite": "None",
            "Description": "You have mastered the use of heavy and two-handed weapons, gaining the following benefits:",
            "Ability Score Increase": "Your Strength score increases by 1, to a maximum of 20.",
            "Great Weapon Master": "On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action."
        },
        {
            "Feat Name": "Guile of the Cloud Giant",
            "Prerequisite": "None",
            "Description": "You possess the trickery and deviousness of the cloud giants. You gain the following benefits:",
            "Ability Score Increase": "Your Dexterity score increases by 1, to a maximum of 20.",
            "Cloud Giant's Trickery": "You can cast the minor illusion cantrip. Intelligence is your spellcasting ability for this spell."
        },
        {
            "Feat Name": "Gunner",
            "Prerequisite": "None",
            "Description": "You have a quick hand and keen eye when employing firearms, gaining the following benefits:",
            "Ability Score Increase": "Your Dexterity score increases by 1, to a maximum of 20.",
            "Firearm Specialist": "You gain proficiency with firearms, and you ignore the loading property of firearms you are proficient with. Additionally, being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls with a firearm."
        },
        {
            "Feat Name": "Healer",
            "Prerequisite": "None",
            "Description": "You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:",
            "Ability Score Increase": "Your Wisdom score increases by 1, to a maximum of 20.",
            "Healer's Kit": "You gain proficiency with healer's kits. As an action, you can use a healer's kit to stabilize a creature that has 0 hit points, without needing to make a Wisdom (Medicine) check. Additionally, when you use a healer's kit to stabilize a dying creature and that creature regains hit points after finishing a short rest, it regains an additional 1 hit point."
        },
        {
            "Feat Name": "Heavily Armored",
            "Prerequisite": "Proficiency with medium armor",
            "Description": "You have trained to master the use of heavy armor, gaining the following benefits:",
            "Ability Score Increase": "Your Strength score increases by 1, to a maximum of 20.",
            "Heavy Armor Proficiency": "You gain proficiency with heavy armor."
        },
        {
            "Feat Name": "Heavy Armor Master",
            "Prerequisite": "Proficiency with heavy armor",
            "Description": "You can use your armor to deflect strikes that would kill others. You gain the following benefits:",
            "Ability Score Increase": "Your Strength score increases by 1, to a maximum of 20.",
            "Heavy Armor Master": "While you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take from non-magical weapons is reduced by 3."
        },
        {
            "Feat Name": "Infernal Constitution",
            "Prerequisite": "Tiefling",
            "Description": "You have been touched by the fires of the Nine Hells, gaining resistance to fire damage and becoming immune to the effects of heat.",
            "Ability Score Increase": "Your Constitution score increases by 1, to a maximum of 20.",
            "Fire Resistance": "You have resistance to fire damage.",
            "Heat Immunity": "You are immune to the effects of extreme heat, as described in chapter 5 of the Dungeon Master’s Guide."
        },
        {
            "Feat Name": "Inspiring Leader",
            "Prerequisite": "None",
            "Description": "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature gains temporary hit points equal to your level + your Charisma modifier (minimum of 1). A creature can’t gain temporary hit points from this feat again until it has finished a short or long rest.",
            "Ability Score Increase": "Your Charisma score increases by 1, to a maximum of 20."
        },
        {
            "Feat Name": "Keen Mind",
            "Prerequisite": "None",
            "Description": "You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits:",
            "Ability Score Increase": "Your Intelligence score increases by 1, to a maximum of 20.",
            "Keen Mind": [
                "You always know which way is north.",
                "You always know the number of hours left before the next sunrise or sunset.",
                "You can accurately recall anything you have seen or heard within the past month."
            ]
        },
        {
            "Feat Name": "Keenness of the Stone Giant",
            "Prerequisite": "Stone Giant",
            "Description": "You have inherited the keen senses of a stone giant, allowing you to perceive your surroundings with exceptional clarity.",
            "Ability Score Increase": "Your Wisdom score increases by 1, to a maximum of 20.",
            "Stone Giant Senses": "You gain proficiency in the Perception skill. If you are already proficient in Perception, you gain expertise in the skill instead."
        },
        {
            "Feat Name": "Lightly Armored",
            "Prerequisite": "None",
            "Description": "You have trained to master the basics of light armor, gaining the following benefits:",
            "Ability Score Increase": "Your Dexterity or Strength score increases by 1, to a maximum of 20.",
            "Light Armor Proficiency": "You gain proficiency with light armor."
        },
        {
            "Feat Name": "Linguist",
            "Prerequisite": "None",
            "Description": "You have studied languages and codes, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
            "Linguistic Talent": "You learn three languages of your choice.",
            "Cryptography": "You can create written ciphers. Others can’t decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it."
        },
        {
            "Feat Name": "Lucky",
            "Prerequisite": "None",
            "Description": "You have inexplicable luck that seems to kick in at just the right moment. You have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw.",
            "Ability Score Increase": "None"
        },
        {
            "Feat Name": "Mage Slayer",
            "Prerequisite": "None",
            "Description": "You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Mage Slayer": [
                "When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature.",
                "When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration."
            ]
        },
        {
            "Feat Name": "Magic Initiate",
            "Prerequisite": "None",
            "Description": "Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class's spell list. In addition, choose one 1st-level spell from that same list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a long rest before you can cast it again using this feat.",
            "Ability Score Increase": "None"
        },
        {
            "Feat Name": "Martial Adept",
            "Prerequisite": "None",
            "Description": "You have martial training that allows you to perform special combat maneuvers. You gain the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Combat Superiority": "You gain one superiority die, which is a d6. This die is used to fuel your special maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice after a short or long rest.",
            "Maneuvers": "You learn two maneuvers of your choice from the Battle Master archetype. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack."
        },
        {
            "Feat Name": "Medium Armor Master",
            "Prerequisite": "Proficiency with medium armor",
            "Description": "You have practiced moving in medium armor to gain the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Medium Armor Master": [
                "Wearing medium armor doesn’t impose disadvantage on your Dexterity (Stealth) checks.",
                "When you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher."
            ]
        },
        {
            "Feat Name": "Metamagic Adept",
            "Prerequisite": "Sorcerer",
            "Description": "You have learned how to exert your will on your spells to alter their effects. You gain the following benefits:",
            "Ability Score Increase": "Your Charisma score increases by 1, to a maximum of 20.",
            "Metamagic Adept": [
                "You learn two Metamagic options of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise.",
                "You gain 2 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source, but you can never have more sorcery points than your sorcerer level). You regain all spent sorcery points when you finish a long rest."
            ]
        },
        {
            "Feat Name": "Mobile",
            "Prerequisite": "None",
            "Description": "You are exceptionally speedy and agile. You gain the following benefits:",
            "Ability Score Increase": "Your Dexterity score increases by 1, to a maximum of 20.",
            "Speed Increase": "Your speed increases by 10 feet.",
            "Dashing Acrobat": "When you make a Dash action, difficult terrain doesn’t cost you extra movement on that turn.",
            "Nimble": "When you make an attack against a creature, you don’t provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not."
        },
        {
            "Feat Name": "Moderately Armored",
            "Prerequisite": "None",
            "Description": "You have trained to master the use of medium armor and shields, gaining the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Medium Armor Proficiency": "You gain proficiency with medium armor and shields."
        },
        {
            "Feat Name": "Mounted Combatant",
            "Prerequisite": "None",
            "Description": "You are a dangerous foe to face while mounted. While you are mounted and aren't incapacitated, you gain the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Advantage on Melee Attacks": "You have advantage on melee attack rolls against any unmounted creature that is smaller than your mount.",
            "Force Attacks to Your Mount": "If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage on a successful save. If your mount provokes an opportunity attack while you’re on it, the attacker can target you or your mount."
        },
        {
            "Feat Name": "Observant",
            "Prerequisite": "None",
            "Description": "Quick to notice details of your environment, you gain the following benefits:",
            "Ability Score Increase": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
            "Lip Reading": "You can read the lips of a creature speaking a language you understand, even if that language is a secret language. This feature doesn’t reveal the actual words spoken but does reveal the general subject of the conversation.",
            "Passive Investigation and Perception": "You can see or hear most creatures or objects even if they are lightly obscured, heavily obscured, or invisible, provided that they are in an area of dim light or brighter. You can also see or hear invisible creatures and objects within 10 feet of you that are in an area of dim light or brighter."
        },
        {
            "Feat Name": "Orcish Fury",
            "Prerequisite": "Half-Orc",
            "Description": "Your fury burns brightly, lending power to your blows. You gain the following benefits:",
            "Ability Score Increase": "Your Strength score increases by 1, to a maximum of 20.",
            "Orcish Fury": [
                "When you hit with an attack using a simple or martial weapon, you can roll one of the weapon’s damage dice one additional time and add it as extra damage of the weapon’s damage type. Once you use this ability, you can’t use it again until you finish a short or long rest."
            ]
        },
        {
            "Feat Name": "Piercer",
            "Prerequisite": "None",
            "Description": "You have achieved a precision in combat that allows you to strike where it hurts most, gaining the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Piercing Precision": "Once per turn, when you hit a creature with an attack that deals piercing damage, you can reroll one of the attack's damage dice and use the higher result."
        },
        {
            "Feat Name": "Poisoner",
            "Prerequisite": "None",
            "Description": "You have learned techniques to enhance your weapons and hone your abilities, gaining the following benefits:",
            "Ability Score Increase": "Your Constitution or Dexterity score increases by 1, to a maximum of 20.",
            "Poisoner": "You can apply poison to your weapons during a short rest. Your poison damage die increases to d4, and you gain proficiency with the poisoner’s kit if you don’t already have it. You can apply poison to a number of pieces of ammunition equal to your proficiency bonus. The poison retains potency for 1 minute before drying."
        },
        {
            "Feat Name": "Polearm Master",
            "Prerequisite": "None",
            "Description": "You can keep your enemies at bay with reach weapons. You gain the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Opportunity Attack": "When a creature enters the reach you have with a melee weapon, you can use your reaction to make a melee attack against that creature."
        },
        {
            "Feat Name": "Prodigy",
            "Prerequisite": "None",
            "Description": "You have an innate talent for a certain skill or set of skills, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
            "Skill Versatility": "You gain proficiency in one skill of your choice and in one tool of your choice. Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it."
        },
        {
            "Feat Name": "Resilient",
            "Prerequisite": "None",
            "Description": "You are tougher than most people, gaining the following benefits:",
            "Ability Score Increase": "Increase your Constitution score by 1, to a maximum of 20.",
            "Saving Throws": "Choose one ability score. You gain proficiency in saving throws using that ability."
        },
        {
            "Feat Name": "Ritual Caster",
            "Prerequisite": "None",
            "Description": "You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.",
            "Ability Score Increase": "None",
            "Ritual Casting": "You can cast any spell you have written in your ritual book as a ritual if it has the ritual tag. You don’t need to have the spell prepared, and it doesn’t count against the number of spells you can prepare each day."
        },
        {
            "Feat Name": "Rune Shaper",
            "Prerequisite": "None",
            "Description": "You have learned the ancient art of rune shaping, granting you the following benefits:",
            "Ability Score Increase": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
            "Runic Knowledge": "You gain proficiency in the Arcana skill. If you are already proficient in the Arcana skill, you gain expertise in the skill instead."
        },
        {
            "Feat Name": "Savage Attacker",
            "Prerequisite": "None",
            "Description": "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon’s damage dice and use either total.",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20."
        },
        {
            "Feat Name": "Second Chance",
            "Prerequisite": "None",
            "Description": "When an attacker you can see hits you with an attack, you can use your reaction to force that attacker to reroll the attack's damage dice and use either total.",
            "Ability Score Increase": "Your Dexterity or Constitution score increases by 1, to a maximum of 20."
        },
        {
            "Feat Name": "Sentinel",
            "Prerequisite": "None",
            "Description": "You have mastered techniques to take advantage of every drop in any enemy's guard, gaining the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Sentinel": [
                "When you hit a creature with an opportunity attack, the creature's speed becomes 0 for the rest of the turn.",
                "Creatures provoke opportunity attacks from you even if they take the Disengage action before leaving your reach.",
                "When a creature within 5 feet of you makes an attack against a target other than you (and that target doesn’t have this feat), you can use your reaction to make a melee weapon attack against the attacking creature."
            ]
        },
        {
            "Feat Name": "Shadow Touched",
            "Prerequisite": "None",
            "Description": "You have gained the favor of a shadowy patron, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence or Charisma score increases by 1, to a maximum of 20.",
            "Shadowy Connection": "You learn the mage hand cantrip. You also learn one 1st-level spell of your choice from the sorcerer spell list: detect magic, disguise self, or invisibility. You can cast the chosen spell once without expending a spell slot, and you regain the ability to do so when you finish a long rest. Intelligence is your spellcasting ability for these spells."
        },
        {
            "Feat Name": "Sharp Shooter",
            "Prerequisite": "None",
            "Description": "You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:",
            "Ability Score Increase": "Your Dexterity score increases by 1, to a maximum of 20.",
            "Sharpshooter": [
                "Attacking at long range doesn’t impose disadvantage on your ranged weapon attack rolls.",
                "Your ranged weapon attacks ignore half cover and three-quarters cover.",
                "Before you make an attack with a ranged weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack’s damage."
            ]
        },
        {
            "Feat Name": "Shield Master",
            "Prerequisite": "None",
            "Description": "You use shields not just for protection but also for offense. You gain the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Shield Master": [
                "If you take the Attack action on your turn, you can use a bonus action to try to shove a creature within 5 feet of you with your shield.",
                "If you aren’t incapacitated, you can add your shield’s AC bonus to any Dexterity saving throw you make against a spell or other harmful effect that targets only you.",
                "If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage on a successful save, interposing your shield between yourself and the source of the effect."
            ]
        },
        {
            "Feat Name": "Skill Expert",
            "Prerequisite": "None",
            "Description": "You have honed your proficiency with a few skills, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence or Dexterity score increases by 1, to a maximum of 20.",
            "Additional Skills": "You gain proficiency in two skills of your choice. If you are already proficient in the chosen skills, you gain expertise in them, which means your proficiency bonus is doubled for any ability check you make with them."
        },
        {
            "Feat Name": "Skilled",
            "Prerequisite": "None",
            "Description": "You gain proficiency in any combination of three skills or tools of your choice.",
            "Ability Score Increase": "None"
        },
        {
            "Feat Name": "Skulker",
            "Prerequisite": "None",
            "Description": "You are an expert at slinking through shadows. You gain the following benefits:",
            "Ability Score Increase": "Your Dexterity score increases by 1, to a maximum of 20.",
            "Stealth": "You can try to hide when you are lightly obscured from the creature from which you are hiding.",
            "Dim Light": "When you are in an area of dim light or darkness, you can move through a creature's space without squeezing if the creature is one size larger than you."
        },
        {
            "Feat Name": "Slasher",
            "Prerequisite": "None",
            "Description": "You have learned where to cut to have the greatest results. You gain the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Slashing Opportunity": "When you hit a creature with an opportunity attack, the target’s speed is reduced by 10 feet until the start of your next turn."
        },
        {
            "Feat Name": "Soul of the Storm Giant",
            "Prerequisite": "None",
            "Description": "You harness the primordial power of the storm giant, gaining the following benefits:",
            "Ability Score Increase": "Your Strength or Charisma score increases by 1, to a maximum of 20.",
            "Storm Giant's Resilience": "You have resistance to lightning and thunder damage.",
            "Storm Giant's Wrath": "When you hit a creature with a melee weapon attack, you can cause the attack to deal an extra 1d6 lightning or thunder damage (your choice) to the target. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
        },
        {
            "Feat Name": "Spell Sniper",
            "Prerequisite": "None",
            "Description": "You have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
            "Spell Attack Range": "When you cast a spell that requires you to make an attack roll, the spell’s range is doubled."
        },
        {
            "Feat Name": "Squat Nimbleness",
            "Prerequisite": "Dwarf",
            "Description": "Your compact frame and dense muscles make you more nimble. You gain the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Squat Nimbleness": [
                "You gain proficiency in the Acrobatics or Athletics skill (your choice).",
                "Being within 5 feet of a larger creature doesn’t impose disadvantage on your ranged attack rolls or on Wisdom (Perception) checks that you make.",
                "You can move through the space of any creature that is of a size larger than yours."
            ]
        },
        {
            "Feat Name": "Strike of Giants",
            "Prerequisite": "None",
            "Description": "You have learned how to harness the immense power of giants to strike with devastating force. You gain the following benefits:",
            "Ability Score Increase": "Your Strength score increases by 1, to a maximum of 20.",
            "Strike of Giants": [
                "When you hit with an opportunity attack or a melee attack on your turn, you can roll one of the weapon’s damage dice one additional time and add it as extra damage of the weapon’s damage type (including magical weapons)."
            ]
        },
        {
            "Feat Name": "Tavern Brawler",
            "Prerequisite": "None",
            "Description": "Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:",
            "Ability Score Increase": "Your Strength or Constitution score increases by 1, to a maximum of 20.",
            "Tavern Brawler": [
                "You are proficient with improvised weapons.",
                "Your unarmed strikes use a d4 for damage.",
                "When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target."
            ]
        },
        {
            "Feat Name": "Telekinetic",
            "Prerequisite": "None",
            "Description": "You learn to move things with your mind, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
            "Telekinetic Talent": [
                "You learn the mage hand cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand invisible. The hand can carry a weight of up to 10 pounds, and its spellcasting ability is Intelligence.",
                "When you cast mage hand, you can make the spectral hand invisible."
            ]
        },
        {
            "Feat Name": "Telepathic",
            "Prerequisite": "None",
            "Description": "You awaken the ability to mentally connect with others, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence or Charisma score increases by 1, to a maximum of 20.",
            "Telepathy": "You gain the ability to mentally communicate with another creature that knows at least one language within a range of 60 feet. The communication is silent and can occur as long as you and the target are within range. The two of you can communicate telepathically as long as you share a language, or the target can understand at least one language known by you."
        },
        {
            "Feat Name": "Tough",
            "Prerequisite": "None",
            "Description": "Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points.",
            "Ability Score Increase": "None"
        },
        {
            "Feat Name": "Vigor of the Hill Giant",
            "Prerequisite": "None",
            "Description": "You have inherited some of the incredible resilience of a hill giant, gaining the following benefits:",
            "Ability Score Increase": "Your Constitution score increases by 1, to a maximum of 20.",
            "Hill Giant Toughness": "Your hit point maximum increases by an amount equal to your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional hit point."
        },
        {
            "Feat Name": "War Caster",
            "Prerequisite": "None",
            "Description": "You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:",
            "Ability Score Increase": "Your Constitution score increases by 1, to a maximum of 20.",
            "War Caster": [
                "You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.",
                "You can perform the somatic components of spells even when you have weapons or a shield in one or both hands.",
                "When a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature."
            ]
        },
        {
            "Feat Name": "Weapon Master",
            "Prerequisite": "None",
            "Description": "You have practiced extensively with a variety of weapons, gaining the following benefits:",
            "Ability Score Increase": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
            "Weapon Training": "You gain proficiency with four weapons of your choice."
        },
        {
            "Feat Name": "Wood Elf Magic",
            "Prerequisite": "Wood Elf",
            "Description": "You learn to harness the power of wood and wind, gaining the following benefits:",
            "Ability Score Increase": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
            "Elf Magic": "You learn the druidcraft cantrip. You also learn one 1st-level spell from the druid spell list: entangle. You can cast entangle once without expending a spell slot, and you regain the ability to do so when you finish a long rest. Wisdom is your spellcasting ability for these spells."
        }
    ]
}